{"author":"Benjamin J. Balter","title":"PHP is Insecure (and Other Enterprise Open-Source F.U.D.)\n","excerpt":null,"layout":"post","categories":["Technology"],"tags":["code","enterprise","fud","government","microsoft","open source","php","security","security though obscurity","wordpress"],"post_format":[],"related_posts":[{"url":"/2010/09/12/wordpress-resume-plugin/","id":"/2010/09/12/wordpress-resume-plugin","title":"WordPress Resume Plugin"},{"url":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party/","id":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party","title":"New Media Flak: Megaphone vs. Cocktail Party"},{"url":"/2010/10/10/does-every-cloud-have-a-silver-lining/","id":"/2010/10/10/does-every-cloud-have-a-silver-lining","title":"Does Every Cloud Have a Silver Lining?"},{"url":"/2010/11/06/removing-the-barriers-to-organizational-agility/","id":"/2010/11/06/removing-the-barriers-to-organizational-agility","title":"Removing the Barriers to Organizational Agility\n"},{"url":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing/","id":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing","title":"What Fourteen-Century Apple Pie Teaches Us About Sharing\n"},{"url":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds/","id":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds","title":"Will Federal Contracting Officers Soon Have Their Heads in the Clouds?\n"},{"url":"/2010/11/29/free-trade-in-china-just-google-it/","id":"/2010/11/29/free-trade-in-china-just-google-it","title":"Free Trade in China? Just Google it."},{"url":"/2010/11/29/twitter-mentions-as-comments/","id":"/2010/11/29/twitter-mentions-as-comments","title":"Twitter Mentions as Comments WordPress Plugin\n"},{"url":"/2010/12/01/the-internet-is-series-of-tubes/","id":"/2010/12/01/the-internet-is-series-of-tubes","title":"The Internet is Series of Tubes (oh, and Tollgates too)\n"},{"url":"/2010/12/20/late-night-infomercials/","id":"/2010/12/20/late-night-infomercials","title":"Late-Night Infomercials: Guaranteed to Extend the 4th Amendment or Your Money Back"}],"url":"/2012/03/02/php-is-insecure-and-other-enterprise-open-source-fud/","date":"2012-03-02 00:00:00 +0000","id":"/2012/03/02/php-is-insecure-and-other-enterprise-open-source-fud","next":"/2012/03/05/wordpress-for-government-and-enterprise","previous":"/2012/02/28/github-for-journalism-what-wordpress-post-forking-could-do-to-editorial-workflows","content":"<p>PHP (and the open-source software it powers) often gets a bad rap in many government and enterprise circles, the brunt of such anecdotal cries as &#8220;it&#8217;s inherently insecure&#8221; or &#8220;X proprietary product is much safer.&#8221; The truth is, much of this unfortunate stereotype is the result of carefully crafted <a href='http://en.wikipedia.org/wiki/Fear,_uncertainty_and_doubt'>fear, uncertainty, and doubt (FUD)</a>. An established disinformation tactic historically used by big names in software for decades, one of the most notorious instances of FUD being the leaked Microsoft &#8221;<a href='https://en.wikipedia.org/wiki/Halloween_documents'>Halloween Documents</a>&#8221; that outlined the software firm&#8217;s strategy to paint open-source, for example, as more costly or under-supported.</p>\n\n<p>So is PHP secure? In a word: <strong>yes</strong>. In my mind, PHP&#8217;s ill-deserved reputation can be traced to three key causes (beyond mere proprietary propaganda):</p>\n\n<ol>\n<li><strong>It was</strong> - More than a decade ago, there was a legitimate argument to be made for PHP being insecure. It used to be that PHP shipped with a poorly thought out setting toggled on by default (that any coder worth their weight in Mountain Dew would toggle off) called <code>register_globals</code>. The setting allowed poorly written code to be short-circuited by passing certain parameters in the URL.  The default was flipped to off in 2000, and removed completely in 2009. End. Of. Story.</li>\n\n<li><strong>It&#8217;s ubiquitous</strong> - Combine the traffic of Facebook, Wikipedia, and the White House, and you&#8217;ll have a good chunk of the Web&#8217;s traffic, not to mention probably a good chunk of the web&#8217;s attacks as a result. Saying that makes PHP insecure would logically render Microsoft Windows, the target of most viruses, equally insecure and unusable. It&#8217;s just a matter of numbers.</li>\n\n<li><strong>It&#8217;s Forgiving</strong> – PHP is a very forgiving programming language, meaning it has a very gentle learning curve and is the first web language of choice for many budding developers. Naturally, inexperienced coders learning to code are going to write inexperienced and thus insecure code. Does that mean it&#8217;s insecure? No. Bad code is bad code in any language. Again, it&#8217;s a numbers game.</li>\n</ol>\n\n<p>It&#8217;s next to impossible to say a given language is &#8220;insecure.&#8221; That&#8217;d be like saying English, as a language, is less trustworthy. It just doesn&#8217;t make sense. In fact, most research supports the idea that the opposite is the case, that <a href='https://www.infoworld.com/d/open-source-software/report-open-source-tops-proprietary-code-in-quality-187169'>open-source produces better quality code than its closed-source counterparts</a>. Think about it <a href='http://www.commlawblog.com/2010/01/articles/unlicensed-operations-and-emer/fcc-changes-stance-on-opensource-security/'>this way</a>:</p>\n\n<blockquote>\n<p>Someone – let&#8217;s call him Bob – wants to secure a room. But in Bob&#8217;s universe, there are no locks. So Bob invents one, and installs it. And realizes he has a huge advantage over would-be intruders. Only Bob knows how the lock works. So no one else knows how to pick it. Bob sets about keeping his lock design a secret.</p>\n\n<p>Alice also needs to secure a room, and she also invents a lock. Unlike Bob, though, Alice publishes her design – not the set-up for a particular key, of course, but the details of the overall mechanism.</p>\n\n<p>Bob thinks Alice is nuts. Why tell people how your lock works? They&#8217;ll just pick it more easily.</p>\n\n<p>Fine, says Alice, good luck keeping your design a secret. It&#8217;s going to get out, no matter what you do. And frankly, Bob, your lock probably isn&#8217;t all that great. Okay, neither is mine. Not yet. But now that it&#8217;s published, people will suggest improvements. Students will do Ph.D. dissertations on making it better. Companies will compete to develop stronger versions. And long after your design has leaked, and instructions for picking it are all over the Internet, my vastly improved lock will be far more secure. Even though everybody will know how it works.</p>\n</blockquote>\n\n<p>Put another way, unlike many of its commercial counterparts for which obfuscation is a security staple, open source relies on inherently sound security practices to ensure that whatever you want to remain private, remains private.</p>\n\n<p>Last, because open-source projects like PHP are almost always monitored 24/7 by the prying eyes of countless developers scattered around the globe, if a vulnerability does arise, <a href='https://twitter.com/#!/nacin/status/9753986051604480'>it&#8217;s often addressed in hours</a>, and you&#8217;re not left waiting days or <a href='http://www.xconomy.com/boston/2008/03/07/delays-in-software-patch-pushed-security-firm-to-disclose-vmware-flaw/'>months as in some commercial products</a> for a patch from on high.</p>\n\n<p>Is there insecure PHP code out there? No doubt. I&#8217;ve seen it. Does that mean all PHP is insecure? Far from it. Next time someone you know says something to the contrary, subtly mention in passing that you&#8217;re really surprised to hear that the company behind their favorite piece of commercial software recently announced they were sunsetting the project, and see how they handle a taste of their own FUD.</p>\n\n<p>Notes:</p>\n\n<ol>\n<li>In simplified terms, if I have the variable $logged_in in my page to store whether a user is logged in or not, and I don&#8217;t first set it to false before checking, a visitor could go to mysite.com?logged_in=true, and the page would erroneously think I was logged in.</li>\n</ol>"}