{"author":"Benjamin J. Balter","title":"Twitter Mentions as Comments WordPress Plugin\n","excerpt":"Twiter Mentions as Comments does exactly what it promises to do -- scours Twitter for people talking about your blog posts and silently inserts their Tweets alongside your existing comments. ","layout":"post","category":["Technology"],"tags":["comments","open source","plugin","twitter","wordpress"],"post_format":[],"url":"/2010/11/29/twitter-mentions-as-comments/","date":"2010-11-29 00:00:00 -0500","id":"/2010/11/29/twitter-mentions-as-comments","categories":["posts"],"next":"[![][2]][2]The Internet backbone (big [tube][2]) provider, Level 3, which makes up much of the behind-the-scenes magic that delivers Netflix streaming movies, revealed that in recent negotiations, internet service (smaller tube) provider Comcast [demanded Level 3 pay an additional fee][3] in exchange for Comcast *continuing* to allow its customers access to Netflix videos, effectively erecting a series of tollgates on the information superhighway.\n\nIt's likely no coincidence that Comcast's decision comes just a week after Netflix began offering [streaming-only plans][4] (hinting at the firm's broader push toward streaming video in the near future) and Level 3′s subsequent announcement of a partnership with Netflix to be its [primary carrier of streaming video][5].\n\n\n\nIn Comcast's defense, their move makes *some* sense from a business standpoint. After all, during peak hours, just 2% of Netflix users (via Level 3) account for [20% of all bandwidth used][6] in North America. In Comcast's own words:\n\n> [W]hen one provider… push[es] the burden of massive traffic growth onto the other provider and its customers, we believe this is not fair.\n\nThe problem with the \"it's the customer's fault for using our service\" argument, the [same argument used by AT&T][7] not too long ago, is that,  if they haven't already, service providers need to realize the Internet is here to stay. We as consumers like browsing the net. We like images. We like YouTube videos. We like interactive content. We like streaming stuff, and tomorrow we may like holograms or virtual reality or whatever the next cool, shiny thing is. Consumers simply can't get enough rich, bandwidth-intensive content, and if you're an internet service provider, you can't complain when your customers use your service to do just that.\n\nTrue, this may simply be [another petty dispute][8] between service providers as [Comcast claims][9], but the bigger problem with Comcast's decision, however, is that Comcast is not simply a *service* provider (tubes), but with the [impending NBC merger][10], also a *content* provider (the stuff in those tubes). This decision marks this first practical case where a service provider is actually taking steps to single out and discriminate against their competitor's content. As Level 3′s Chief Legal Officer [put it][11]:\n\n> Comcast is putting up a tollbooth at the borders of its broadband internet-access network, enabling it to unilaterally decide how much to charge for content which competes with its own cable TV and Xfinity-delivered content.\n\nThe Level-3/Comcast arrangement spells bleak hope for any future in which the Internet's information democratization ethos continues – perhaps a commercialized future [not too dissimilar from today's tiered broadcast/cable TV system][12] — and a future unequivocally bad for consumers, regardless of what the FCC may or may not decide [later this month][13].\n\nConsider this: as Comcast's customers increasingly [look to their computers for video content][14] rather than their cable box, Comcast can either squeeze that lost revenue out of its customers by bringing an [end to all-you-can-eat Internet][15], in which case we'll see an increase in our cable bill, or they can make up that lost revenue on the other end, by charging contest providers (like Level 3) a surcharge, forcing those services to offset their increased overhead by passing along the cost in the form of monthly fees, in which case we'll see it on our Netflix/iTunes/Facebook bill instead. Either way, the decision forecasts an inevitable flow of money from our pockets to Comcast's.\n\nAny time the nation's [largest][16] anything makes a \"[take it or leave it][17]\" offer demanding a fee for an otherwise mutually beneficial relationship like [peering][18], the transaction deserves a certain degree of scrutiny, especially when it creates a catch-22 in that company's favor. Is Comcast *trying* to kill the Internet? Probably not. *Will* they? I guess we're going to have to wait and see.\n\n*Views represent [my own][19].*\n\n[photo: [gnackgnackgnack][20]]\n\n []: http://ben.balter.com/wp-content/uploads/2010/11/3592493739_6b0b0d3f45_b.jpg\n [2]: http://www.thedailyshow.com/watch/wed-july-12-2006/headlines---internet\n [3]: http://voices.washingtonpost.com/posttech/2010/11/comcast_hit_with_two_net_neutr.html\n [4]: http://blog.netflix.com/2010/11/new-plan-for-watching-instantly-plus.html\n [5]: http://www.wired.com/epicenter/2010/11/comcast-tollbooth/\n [6]: http://www.slate.com/id/2273314/\n [7]: http://www.nytimes.com/2009/09/03/technology/companies/03att.html?_r=1\n [8]: http://www.wired.com/threatlevel/2008/03/isp-quarrel-par/\n [9]: http://twitter.com/#!/ceciliakang/statuses/9730130310078464\n [10]: http://mediadecoder.blogs.nytimes.com/2010/11/29/netflix-partner-says-comcast-toll-threatens-online-video-delivery/\n [11]: http://www.marketwatch.com/story/level-3-communications-issues-statement-concerning-comcasts-actions-2010-11-29?reflink=MW_news_stmp\n [12]: http://io9.com/5610328/how-the-googleverizon-proposal-could-kill-the-internet-in-5-years\n [13]: http://voices.washingtonpost.com/posttech/2010/11/lawmakers_push_fcc_to_vote_on.html\n [14]: http://lifehacker.com/5667680/ditching-cable-for-the-web-how-much-can-you-save-buying-renting-or-streaming-tv\n [15]: http://www.businessinsider.com/comcast-internet-access-2010-11\n [16]: http://www.comcast.com/About/PressRelease/PressReleaseDetail.ashx?PRID=887\n [17]: http://www.comcast.net/articles/finance/20101130/US.Level.3.Comcast/\n [18]: http://en.wikipedia.org/wiki/Peering\n [19]: http://ben.balter.com/fine-print/\n [20]: http://www.flickr.com/photos/gnackgnackgnack/3592493739/","previous":"<p>In 593 A.D., the first printing press quietly spun into operation in China. Exactly 120 years later, the first paper, <em>Kaiyuan Za Bao</em>, began production in Beijing. <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> In 2010, however, China&#8217;s information landscape is best characterized not by innovation, but rather by tightly controlled government restriction, and no American corporation is more acutely aware of this austere reality than Internet giant Google. The company <a href='http://googlepublicpolicy.blogspot.com/2010/11/promoting-free-trade-for-internet.html'>recently released</a> a <a href='http://www.google.com/googleblogs/pdfs/trade_free_flow_of_information.pdf'>white paper</a> calling out China, among others for violating WTO commitments and urged law makers to break down barriers to free trade and global e-commerce.</p>\n\n<p><img alt='' src='http://cdn.benbalter.com/wp-content/uploads/2010/11/1194563275_664d6b15e2_b.jpg' /></p>\n\n<p>The argument is simple: As the internet is increasingly becoming the dominant instrument of industry, blocking access to information is tantamount to blocking access to trade.</p>\n\n<p>The white paper elaborates:</p>\n\n<blockquote>\n<p>The tremendous spread of the Internet – faster than the spread of any previous technology – has also created new, rapidly expanding markets. Online traffic has increased at a compound annual growth rate of 66 percent over the past five years. <sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> Today more than one-quarter of the world&#8217;s population (1.7 billion people) uses this technology to communicate, inform, create, and buy and sell across borders. <sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup> These 1.7 billion Internet users are a massive new consumer base for both Internet services like email and the hard goods and services that are increasingly advertised, marketed, or sold online…</p>\n\n<p>Annual internet-based commerce worldwide is expected to soon reach $1 trillion. <sup id='fnref:4'><a href='#fn:4' rel='footnote'>4</a></sup>In the United States alone, online retail sales were over $132 billion in 2008. <sup id='fnref:5'><a href='#fn:5' rel='footnote'>5</a></sup> Globally, Internet and telecom services contributed 3.3 percent of GDP in 2004, compared with 1.8 percent in 1990, with virtually every single economy enjoying growth in the sector. <sup id='fnref:6'><a href='#fn:6' rel='footnote'>6</a></sup></p>\n</blockquote>\n\n<p>The commercialization of the internet and subsequent clash with government restriction is nothing new. US-based information technology companies have been doing business in China with relative success for quite some time. Yahoo!, Inc. was the first to enter the fray in 1998, launching a Chinese-language version of its popular search engine to compete with China&#8217;s domestic Internet content providers, and not long after, Microsoft and Google followed suit. <sup id='fnref:7'><a href='#fn:7' rel='footnote'>7</a></sup> However, in 2000, China&#8217;s Ministry of Public Service began the Golden Shield Project with the goal of &#8220;adopt<span>ing</span>… advanced information and communication technology to strengthen central police control, responsiveness, and crime combating capacity to improve the efficiency and effectiveness of police work. <sup id='fnref:8'><a href='#fn:8' rel='footnote'>8</a></sup>&#8221;</p>\n\n<p><img alt='' src='http://cdn.benbalter.com/wp-content/uploads/2010/11/4273568581_3c4db9799d_z-300x238.jpg' />A prime example of such restriction came in Fall 2002, as Google employees were booting up their Mountain View, California computers to angry emails informing them that the search engine was entirely unavailable to Chinese citizens. <sup id='fnref:9'><a href='#fn:9' rel='footnote'>9</a></sup> Even when users could access Google.com, the Web site was slow, often cases, inoperably so when compared to Google&#8217;s censored competitors. <sup id='fnref:10'><a href='#fn:10' rel='footnote'>10</a></sup> As Google&#8217;s Senior Policy Council, Andrew McLaughlin, noted, &#8220;Google.com appears to be down around 10 percent of the time,&#8221; adding, &#8221;<span>e</span>ven when users can reach it, the website is slow, and sometimes produces results that… stall out the user&#8217;s browser. <sup id='fnref:11'><a href='#fn:11' rel='footnote'>11</a></sup>&#8221;</p>\n\n<p>So why do we care if a handful of countries do not enjoy unfettered access to American e-commerce? According to the China Internet Network Information Center, the Chinese market represents some 123 million Internet users. <sup id='fnref:12'><a href='#fn:12' rel='footnote'>12</a></sup> The Internet far surpassed television, newspapers, magazines, and radio as the primary source for information among the Chinese people. <sup id='fnref:13'><a href='#fn:13' rel='footnote'>13</a></sup> As a result, today, the People&#8217;s Republic represents the largest emerging Internet market in the world. Baidu.com, for example, the Chinese-based search engine, enjoyed only 2.5% of the search market in 2003, but boasted 46% by 2005, while during that same time, Google&#8217;s market share in China dropped some 30% and continued to fall. <sup id='fnref:14'><a href='#fn:14' rel='footnote'>14</a></sup></p>\n\n<p>The implications are clear. The fastest, most powerful commercial vehicle the world has ever seen is unavailable to its largest emerging market. To put it another way, countries that censor internet traffic are blocking the 21st century&#8217;s busiest trade ports. It would be as if merchant ships in the 1500′s, full of goods from the New World, made their way back to Europe only to be turned away. Even in a post-dot-com-bubble world, with nearly ubiquitous free shipping, cyber Mondays, and an app store for everything from your phone to your toaster, it is not hard to imagine that the internet will soon become the dominant mechanism of international trade, if it has not earned such a title already. Today, one thing is certain: As the domestic e-commerce market reaches saturation, American firms will continue to seek out opportunities abroad despite censorship and restrictions. <sup id='fnref:15'><a href='#fn:15' rel='footnote'>15</a></sup> Their level of success, however, and the level of access available to users in the countries cited in the white paper, if any, remains to be seen.</p>\n\n<p><span>Photos courtesy <a href='http://www.flickr.com/photos/stuckincustoms/1194563275/'>stuckincustoms</a> and <a href='http://www.flickr.com/photos/winterkanal/4273568581/'>winterkanal</a></span></p>\n\n<p>Notes:</p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>Gardels, Nathan, <em>Google vs. Confucius</em>, 27 New Perspective Quarterly 2 (May 2010), at 2. <span>22</span></p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p>Fed. Commc&#8217;ns Comm&#8217;n <span>FCC</span>, Connecting America: The National Broadband Plan ch. 4 (2010). <span>23</span></p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p>Miniwatts, <a href='http://www.internetworldstats.com/stats7.htm'>Internet World Stats,</a><em><a href='http://www.internetworldstats.com/stats7.htm'>Internet World Users by Language: Top Ten Languages</a></em>(chart) (Sept. 30, 2009); Int&#8217;l Telecomm. Union <span>ITU</span>, <a href='http://www.itu.int/ITU-D/ict/material/Telecom09_flyer.pdf'><em>The World in 2009: ICT Facts and Figures</em>1</a> (2009). The total number of fixed broadband subscribers reached nearly 500 million by the end of 2009. <em>Id.</em>at 5. <span>26</span></p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li><li id='fn:4'>\n<p>Brian Hindley &amp; Hosuk Lee-Makiyama, <em><a href='http://ecipe.org/publications/ecipe-working-papers/protectionism-online-'><em>Protectionism Online: Internet Censorship and International Trade Law</em></a></em>3 (ECIPE, Working Paper No. 12/2009). <span>28</span></p>\n<a href='#fnref:4' rev='footnote'>&#8617;</a></li><li id='fn:5'>\n<p>U.S. Census Bureau, <em><a href='http://www.census.gov/mrts/www/data/html/09Q1table3.html'>Estimated Quarterly U.S. Retail Sales (Adjusted): Total and E-commerce (chart)</a></em> (May 15, 2009). <span>30</span></p>\n<a href='#fnref:5' rev='footnote'>&#8617;</a></li><li id='fn:6'>\n<p>Int&#8217;l Telecomm. Union <span>ITU</span>, <a href='http://www.itu.int/osg/spu/publications/digitalife/docs/digital-life-web.pdf'><em>digital.life: ITU Internet Report 2006</em></a> 73 (2006). <span>32</span></p>\n<a href='#fnref:6' rev='footnote'>&#8617;</a></li><li id='fn:7'>\n<p>Marc D. Nawyn, <em>Code Red: Responding to the Moral Hazards Facing U.S. Information Technology Companies in China</em>, 2007 Colum. Bus. L. Rev. 505 (2007). <span>33</span></p>\n<a href='#fnref:7' rev='footnote'>&#8617;</a></li><li id='fn:8'>\n<p>Greg Walton, <em><a href='http://'>China&#8217;s Golden Shield: Corporations and the Development of Surveillance Technology in the People&#8217;s Republic of China</a></em>, Rights &amp; Democracy, 2001; <em>See</em> Jennifer Shyu, <em>Speak No Evil: Circumventing Chinese Censorship</em>, 45 San Diego L. Rev. 211, 249 (2008). <span>35</span></p>\n<a href='#fnref:8' rev='footnote'>&#8617;</a></li><li id='fn:9'>\n<p>Testimony of Google, Inc. before the Subcommittee on Asia and the Pacific, and the Subcommittee on Africa, Global Human Rights, and International Operations, Committee on International Relations, 207th Cong. (2006) (statement of Elliot Schrage, Vice President, Global Communications and Public Affairs, Google, Inc.). <span>36</span></p>\n<a href='#fnref:9' rev='footnote'>&#8617;</a></li><li id='fn:10'>\n<p><em>Id.</em> <span>37</span></p>\n<a href='#fnref:10' rev='footnote'>&#8617;</a></li><li id='fn:11'>\n<p><a href='http://Googleblog.blogspot.com/2006/01/Google-in-china.html'>Google in China</a>, Google Official Blog, January 27, 2006. <span>39</span></p>\n<a href='#fnref:11' rev='footnote'>&#8617;</a></li><li id='fn:12'>\n<p>Lindsay Eastwood, <em>&#8220;Don&#8217;t Be Evil&#8221;: Google Faces the Chinese Internet Market and the Global Online Freedom Act of 2007</em>, 9 Minn. J.L. Sci. &amp; Tech. 287, 288 (2008) (citing China Internet Network Info. Ctr., <a href='http://cnnic.cn/download/2006/18threport-en.pdf'>18th Statistical Survey Report on the Internet Development in China</a>, 3 (2006). <span>41</span></p>\n<a href='#fnref:12' rev='footnote'>&#8617;</a></li><li id='fn:13'>\n<p><em>Id.</em> at n. 30 (stating &#8220;the main channel that obtain information are the Internet (82.6%), television (64.5%), papers (57.9%), magazines (18.8%), books (18.7%), radio (14.4%), and other (6.9%)&#8221;) (internal quotations omitted). <span>42</span></p>\n<a href='#fnref:13' rev='footnote'>&#8617;</a></li><li id='fn:14'>\n<p><em>Id.</em> <span>43</span></p>\n<a href='#fnref:14' rev='footnote'>&#8617;</a></li><li id='fn:15'>\n<p><em>E.g.,</em> Google&#8217;s decision to enter China, and subsequently censor search results, was primarily based on the premise that it was the lesser of two evils. Google CEO Eric Schmidt commented, &#8220;although we weren&#8217;t wild about the restrictions, it was even worse to not try to serve those users at all,&#8221; elaborating, &#8220;we actually did an evil scale and decided not to serve at all was worse evil.&#8221; Shyu, <em>Supra</em> note 8 at 213 (citing Danny Sullivan, <em><a href='http://blog.searchenginewatch.com/blog/060130-154414'>Google Created EvilRank Scale To Decide On Chinese Censorship</a></em>, Search Engine Watch, January 30, 2006. Accordingly, Google launched Google.cn under the belief that the &#8220;benefits of increased access to information for people in China… outweighed <span>the</span> discomfort… <span>of</span> agreeing to censor some results,&#8221; (<a href='http://Googleblog.blogspot.com/2010/01/new-approach-to-china.html'><em>A New Approach to China</em></a>, Official Google Blog, January 12, 2010) calling their service a &#8220;a meaningful – though imperfect – contribution to the overall expansion of… information in China.&#8221; Press Release, Google, Inc., <a href='http://www.Google.com/press/pressrel/rd_china.html'><em>Google to Open Research Center in China</em></a> (July 19, 2005). <span>47</span></p>\n<a href='#fnref:15' rev='footnote'>&#8617;</a></li></ol></div>","content":"<p>Twitter Mentions as Comments does exactly what it promises to do – scours Twitter for people talking about your blog posts and silently inserts their Tweets alongside your existing comments. The plugin leverages the power of WordPress&#8217;s built-in commenting system – notification, comment moderation, author white/black listing – making Twitter an extension of your blog.</p>\n\n<p><strong>Features</strong></p>\n\n<ul>\n<li>Searches for Tweets linking to your blog posts, regardless of the URL shortener used (using Twitter&#8217;s Search API)</li>\n\n<li>Pushes Tweets into WordPress&#8217;s existing comment workflow – notifications, comment moderation, and author whitelists/blacklists work just like any other comment</li>\n\n<li>Fetches user&#8217;s real name and profile picture and links directly to the original Tweet</li>\n\n<li>Checks automatically – no need to do a thing</li>\n\n<li>Option to automatically exclude ReTweets</li>\n\n<li>Option to store tweets as trackbacks/B</li>\n\n<li>Option to specify which posts to check (e.g., 10 most recent posts, all posts, front page only)</li>\n\n<li>Smart Caching of Tweets and user data – retrieves only what it needs to save on API calls and server load</li>\n</ul>\n\n<p><strong>Planned Features</strong></p>\n\n<ul>\n<li>Dynamic resizing of Twitter profile images to fit WordPress theme</li>\n\n<li>Prioritization of newer posts</li>\n\n<li>Oauth Authentication to raise API limit (currently unlimited Tweets, but limited to 150 <em>new</em> comment authors per hour)</li>\n\n<li>Smarter API throttling</li>\n</ul>\n\n<p>The plugin is available in the <a href='http://wordpress.org/extend/plugins/twitter-mentions-as-comments/'>WordPress plugin repository</a>, and you can see it in action <a href='#comments'>below</a> or on the <a href='http://ben.balter.com/2010/09/12/wordpress-resume-plugin/#comment-168'>WP Resume plugin page</a>.</p>\n\n<p><strong>Looking to filter out a particular user or keyword?</strong> Because Tweets go through the normal comment filter, you can just <a href='http://ben.balter.com/2010/11/29/twitter-mentions-as-comments/#comment-246'>blacklist them as described below</a>.</p>\n\n<p><em>Enjoy using Twitter Mentions as Comments? Feel free to <a href='http://ben.balter.com/donate/' title='Donate'>make a small donation</a> to support the software&#8217;s continued development.</em></p>\n\n<p><strong>Update (7/8): Comments have been closed in favor of <a href='https://github.com/benbalter/Twitter-Mentions-as-Comments/wiki/Where-to-get-Support-or-Report-an-Issue'>expanded support and discussion options</a>. Additional documentation about the project can now be found in the <a href='https://github.com/benbalter/Twitter-Mentions-as-Comments/wiki'>Project Wiki</a>. If you are interested in joining the project at any level of technical expertise, please see <a href='https://github.com/benbalter/Twitter-Mentions-as-Comments/wiki/How-to-Contribute'>How to Contribute</a>.</strong></p>"}