{"author":"Benjamin J. Balter","title":"The Demise of the Personal Dashboard","excerpt":"When building consumer applications, favor simplicity over complex personalized dashboards which bombard customers with information.\n","layout":"post","categories":["Technology"],"tags":[".govs","analytics","dashboard","enterprise","gov 2.0","government","KPIs","start ups","ui","ui/ux","ux","wordpress"],"post_format":[],"related_posts":[{"url":"/2010/09/12/wordpress-resume-plugin/","id":"/2010/09/12/wordpress-resume-plugin","title":"WordPress Resume Plugin"},{"url":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party/","id":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party","title":"New Media Flak: Megaphone vs. Cocktail Party"},{"url":"/2010/10/10/does-every-cloud-have-a-silver-lining/","id":"/2010/10/10/does-every-cloud-have-a-silver-lining","title":"Does Every Cloud Have a Silver Lining?"},{"url":"/2010/11/06/removing-the-barriers-to-organizational-agility/","id":"/2010/11/06/removing-the-barriers-to-organizational-agility","title":"Removing the Barriers to Organizational Agility\n"},{"url":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing/","id":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing","title":"What Fourteen-Century Apple Pie Teaches Us About Sharing\n"},{"url":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds/","id":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds","title":"Will Federal Contracting Officers Soon Have Their Heads in the Clouds?\n"},{"url":"/2010/11/29/free-trade-in-china-just-google-it/","id":"/2010/11/29/free-trade-in-china-just-google-it","title":"Free Trade in China? Just Google it."},{"url":"/2010/11/29/twitter-mentions-as-comments/","id":"/2010/11/29/twitter-mentions-as-comments","title":"Twitter Mentions as Comments WordPress Plugin\n"},{"url":"/2010/12/01/the-internet-is-series-of-tubes/","id":"/2010/12/01/the-internet-is-series-of-tubes","title":"The Internet is Series of Tubes (oh, and Tollgates too)\n"},{"url":"/2010/12/20/late-night-infomercials/","id":"/2010/12/20/late-night-infomercials","title":"Late-Night Infomercials: Guaranteed to Extend the 4th Amendment or Your Money Back"}],"url":"/2012/07/10/the-demise-of-the-dashboard/","date":"2012-07-10 00:00:00 +0000","id":"/2012/07/10/the-demise-of-the-dashboard","next":"/2012/07/26/government-release-of-source-code-public-domain-or-open-source","previous":"/2012/06/26/why-you-should-always-write-software-as-open-source","content":"<p><a href='http://ben.balter.com/wp-content/uploads/2012/07/dashboard-all-the-things.jpeg'><img alt='Dashboard all the things' class='alignright' src='http://ben.balter.com/wp-content/uploads/2012/07/dashboard-all-the-things-300x225.jpeg' /></a></p>\n\n<p>I was recently asked how I would architect a personalized dashboard experience for visitors to a large, customer-facing website. My response? <em>I wouldn&#8217;t.</em></p>\n\n<p>A dashboard in a car or airplane makes sense. It&#8217;s not as if I could click &#8220;speedometer&#8221; while driving or press the &#8220;altimeter&#8221; button while flying. I simply need everything at all times. But virtual interfaces don&#8217;t have that same limitation. In fact they don&#8217;t have any limitations. A dashboard can have as much information as the most ambitious engineer can dream — and that&#8217;s exactly the problem.</p>\n\n<p>Put it in context: Google <a href='http://googleblog.blogspot.com/2012/07/spring-cleaning-in-summer.html'>recently announced the retirement of iGoogle</a>, it&#8217;s own personalized dashboard, and I second their nomination to induct dashboards into the #doingitwrong hall of fame, joining the likes of internet portals, splash pages, and well, basically anything involving ActiveX or Flash.</p>\n\n<p>Dashboard were a fun user interface experiment. They really were, especially compared to the static pages they evolved from. That was the whole point of Web 2.0, wasn&#8217;t it? Personalization? I mean, it was really cool to drag and drop widgets, and build a virtual command center to monitor my little corner of the internet, and that was fine when there wasn&#8217;t much internet out there to monitor. But the web collectively hit a tipping point a few years back. From push notifications to always-on e-mail, in more ways than we imagine, we now bombard ourselves with more information that we can physically process at any given moment. <a href='http://www.apple.com/iphone/features/retina-display.html'>Quite literally</a>.</p>\n\n<p>Think about it this way: when customers come to a website, they&#8217;re not looking to solve 10 problems. They&#8217;re looking to solve one. They don&#8217;t want all the potentially relevant information thrown at them all at once; they just want what they need. And they want computers to make that determination for them. But hey, this isn&#8217;t the first time those who predict our user experience needs have erred on the side of <a href='http://www.pocket-lint.com/images/dynamic/NEWS-32125-b3a8b509bc5e3a074f7f240f57d71aa9.jpg'>moar is better</a>.</p>\n\n<p>So that&#8217;s it? That&#8217;s the end of simultaneous streams? <a href='http://www.informationweek.com/news/software/productivity_apps/240003296'>Far from it</a>. This once-disruptive technology now has a long journey down the Technology S Curve as it becomes the go-to solution for all the business intelligence and project analyst types that stumble across it, in other words, the late adopters.</p>\n\n<p>Don&#8217;t get me wrong. I&#8217;m sure guilty of building <a href='http://my.fcc.gov/'>a dashboard</a> or <a href='http://codex.wordpress.org/Dashboard_Screen'>two</a> in my day. I&#8217;m not saying that they&#8217;ve never had a place. What I&#8217;m saying is that today, not even the most complex dashboard could give you an accurate snapshot of its genus&#8217;s future. If not dashes, then what? Beyond turning everything into a ubiquitous search box (<em>a la</em> <a href='http://gov.uk'>gov.uk</a>), I&#8217;m far from for a UI/UX expert, but I tend to think that startups generally have a pretty good sense of what&#8217;s next. They have to. If they don&#8217;t get it right the first time around, they tend not to have a second try. So what do we see?</p>\n\n<ul>\n<li>\n<p><strong>Activity -</strong> Social apps like Facebook, Twitter, Foursquare, even GitHub are all built around the concept of activity. Whether its a news feed, recent checkins, or even commit activity, the question I come with is &#8220;what&#8217;s going on?&#8221; and it gets answered as in depth as I care to scroll through, not as in depth as an engineer arbitrarily decided I needed a few years back. It&#8217;s linear. It&#8217;s <a href='http://en.wikipedia.org/wiki/Inverted_pyramid'>inverted pyramid</a>. It&#8217;s customized by whom or what I follow, not by what I add or (re)arrange.</p>\n</li>\n\n<li>\n<p><strong>Minimal</strong> – Productivity apps like Gmail, Google Reader, even dropbox don&#8217;t summarize for me how many e-mails, unread posts, or free MB I have as soon as I log in, and with the exception of a few labs features here or there, don&#8217;t even give me the option to have anything more than a bare-bones inbox, unread feed, or directory listing. In fact, GMail and Google Reader were recently criticized for <a href='http://jonoscript.wordpress.com/2012/04/26/gmail-designer-arrogance-and-the-cult-of-minimalism/'>going a bit too far</a> in this direction. But the lesson is the same: just give me my stuff and get out of the way.</p>\n</li>\n\n<li>\n<p><strong>Immediate</strong> - Transactional apps, like Uber or Square focus on action, not the past (or even the present). When I open the Uber or square apps, I&#8217;m immediately presented with the ability to request a vehicle or swipe a card, not my top tasks, not an arbitrary array of options or metrics, not with recent news about the product or popular add-ons. The app simply stands at attention, awaiting orders. I actually had to dig a bit to find my transaction history and related business analytics, and I&#8217;d argue that&#8217;s a really good thing.</p>\n</li>\n</ul>\n\n<p>Think about the last time you&#8217;ve used a drag-and-drop dashboard: If you&#8217;re like me, it&#8217;s going to be either Google Analytics or WordPress, and if that&#8217;s the case, it&#8217;s simply known as <em>the screen you see after you log in, but before you can do what you need to do</em>. It&#8217;s wasted pixels. It&#8217;s cruft from a bygone era when clicks were expensive and developers were left wondering &#8220;how can we fit more on a page&#8221;.</p>\n\n<p>Options are a crutch. It&#8217;s the natural tendency of any engineer to over engineer a system, and that tendency is even stronger in a risk-averse, top-down culture <a href='http://www.google.com/?q=dashboard+site:.gov'>like government</a>. But your job — as an engineer, as a product manager, as user — is to push back, to fight that urge, to make <a href='http://wordpress.org/about/philosophy/'>decisions, not options</a>. Not convinced? That feature you can&#8217;t <a href='https://github.com/blog/1091-spring-cleaning'>bring yourself to cut</a>? Expose it through your API and see how many users complain.</p>\n\n<p>It&#8217;s no longer a question of &#8220;is this possible technologically?&#8221;. It&#8217;s no longer a matter of &#8220;can you expose me to that information 24/7?&#8221;. Ever since the advent of <a href='http://html5zombo.com/'>Zombo com</a>, the only limit is our imagination. We&#8217;ve figured out the hard stuff. It&#8217;s not centralization and personalization. It&#8217;s decentralization and interoperability. Simplicity is the new black.</p>"}