{"title":"Presidential Innovation Fellow","organization":"Executive Office of the President","section":"Experience","from":"July 2012","to":"Present","location":"Washington, D.C.","category":"resume","robots":"noindex, nofollow","layout":"default","url":"/0001/10/10/presidential-innovation-fellow/","date":"0001-10-10 00:00:00 -0500","id":"/0001/10/10/presidential-innovation-fellow","categories":["resume"],"next":"As I began to set up my own site, I was not a huge fan of the options out there for adding a resume or CV to a WordPress blog. Many personal Web sites used lackluster TinyMCE formatting (bold, italic, bullets, nothing else) or simply stuffed pre-styled HTML into an existing page. I can't even begin to fathom the workflows some people must go through every time they want to update their resume.[^1] A few purpose-built plugins offered a slightly more streamlined approach, but cluttered the backend with unnecessary and unfamiliar menus, and spawned legions of database tables to store the data.\n\n*Enter WP Resume…*\n\nWP Resume is an out-of-the-box solution to get your resume online and keep it updated. Built on WordPress 3.0's custom post type functionality, it offers a uniquely familiar approach to publishing. If you've got a WordPress site, you already know how to use WP Resume.\n\n**Features include:**\n\n*   Support for sections (e.g., education, experience), organizations (e.g., somewhere state university, Cogs, Inc.), positions (e.g., bachelor of arts, chief widget specialist), and details (e.g., grew bottom line by 15%, president of the sustainability club)\n*   Follows best practices in resume layout and design\n*   One click install, just start adding content\n*   Drag and drop ordering of resume elements\n*   Built on existing WordPress code, utilizing a single custom post type and two custom taxonomies\n*   The WYSIWYG editing experience you know and love\n*   Revisioning\n*   Integrates with your theme like they were made for each other\n*   Custom URL\n*   Does not use pretentious accents on the word \"resume\"\n*   Extremely original title\n\n![][2]The hardest part of getting your resume online should be doing the work listed on it, not wrestling the publishing platform. Simply put, WP Resume steps aside and lets your experience shine.\n\nInterested? You can [see it in action][3], or if you're ready to take the plunge, [download it from the WordPress plugin repository][4], and [try it today][5]. There's even a [great walkthrough put together by the good folks at CUNY Graduate School of Journalism.][6] Bugs, questions, comments, feedback? I'd love to hear about your experience with WP Resume in the comments below.\n\n*Enjoy using WP Resume? Feel free to [make a small donation][7] to support the software's continued development.*\n\n*\\[Photo: [shawnmichael][8]\\]*\n\n [1]: #note-2020-1 \"I imagine it would resemble a highly digitized Rube Goldberg  Machine\"\n [2]: http://cdn.benbalter.com/wp-content/uploads/2010/09/wp_resume-300x223.png \"Screenshot of Example WP Resume\"\n [3]: http://ben.balter.com/resume/\n [4]: http://wordpress.org/extend/plugins/wp-resume/\n [5]: http://wordpress.org/extend/plugins/wp-resume/installation/\n [6]: http://tech.journalism.cuny.edu/documentation/wp-resume/\n [7]: http://ben.balter.com/donate/ \"Donate\"\n [8]: http://www.flickr.com/photos/shawnmichael/4246330043/\n [9]: http://www.youtube.com/watch?v=qybUFnY7Y8w\n \n \n [^1]: I imagine it would resemble a highly digitized [Rube Goldberg  Machine][9]","previous":"<ul>\n<li>Assisted with drafting, stakeholder outreach, and coordination of the release of <a href='http://www.whitehouse.gov/sites/default/files/omb/egov/digital-government/digital-government.html'>the President’s Digital Government Strategy</a>, a fundamental reimagination of the role of technology in the public sector</li>\n\n<li>In response to presidential mandate requiring the release of open source software, coordinated and led negotiation of contract for code-sharing services including creation of records management plans under both the Federal Records and Presidential Records Acts</li>\n\n<li>Briefed senior White House officials on legal implications and licensing consideration surrounding the creation of government-funded open-source software collaborations</li>\n\n<li>Prepared US Chief Information Officer for public appearances including speech writing, messaging, and creation of multiple HTML5-based presentations</li>\n\n<li>Developed technical roadmap, prototyped, and implemented <a href='https://github.com/GSA/digital-strategy'>first-of-its-kind mechanism</a> for agencies to report progress on the Digital Government Strategy</li>\n</ul>","tags":[],"content":"<p>Described by the US Chief Technology Officer as &#8220;the baddest of the badass innovators,&#8221; serve as entrepreneur in residence reimagining the role of technology in brokering the relationship between citizens and government.</p>"}