{"author":"Benjamin J. Balter","title":"Google Analytics Tracking of JetPack (Sharedaddy) Social Engagement\n","excerpt":"Google recently added social engagement tracking to its analytics suite. With a little bit of leg work, Google Analytics can track not only +1s, but also Facebook and Twitter shares via a simple _gaq.push call.\n","layout":"post","category":["Technology"],"tags":["analytics","facebook","google","open source","plugin","social media","twitter","wordpress"],"post_format":[],"url":"/2011/06/30/google-analytics-tracking-of-jetpack-sharedaddy-social-engagement/","date":"2011-06-30 00:00:00 -0400","id":"/2011/06/30/google-analytics-tracking-of-jetpack-sharedaddy-social-engagement","categories":["posts"],"next":"[WP Document Revisions][1] is a [document management][2] and [version control][3] plugin. Built for time-sensitive and mission-critical projects, teams can collaboratively edit files of any format — text documents, spreadsheets, images, sheet music… anything — all the while, seamlessly tracking the document's progress as it moves through your organization's existing workflow.\n\n[![WP Document Revisions Screenshot](http://ben.balter.com/wp-content/uploads/2011/07/wp-document-revisions-screen-shot-300x226.png\n){.alignright}][4]\n\n**WP Document Revisions is three things:**\n\n1.  A **document management system** (DMS), to track, store, and organize files of any format\n2.  A **collaboration tool** to empower teams to collaboratively draft, edit, and refine documents\n3.  A **file hosting solution** to publish and securely deliver files to a team, to clients, or to the public\n\n<iframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/VpsTNSiJKis\" frameborder=\"0\" allowfullscreen=\"true\">     </iframe>\n\n**Powerful Collaboration Tools** - *With great power does not have to come great complexity.* Based on a simple philosophy of putting powerful but intuitive tools in the hands of managers and content creators, WP Document Revisions leverages many of the essential WordPress features that, for more than eight years, have been tested and proven across countless industries — posts, attachments, revisions, taxonomies, authentication, and permalinks — to make collaborating on the creation and publication of documents a natural endeavor. Think of it as an [open-source and more intuitive version][5] of the popular Microsoft collaboration suite, [Sharepoint.][6]\n\n**Document History** - At each step of the authoring process, WP Document Revisions gives you an instant snapshot of your team's progress and the document's history. It even gives you the option to revert back to a previous revision — so don't fret if you make a mistake — or receive updates on changes to the document right in your favorite feed reader.\n\n**Access Control** - Each document is given a persistent URL (e.g., yourcompany.com/documents/2011/08/TPS-Report.doc) which can be private (securely delivered only to members of your organization), password protected (available only to those you select such as clients or contractors), or public (published and hosted for the world to see). If you catch a typo and upload a new version, that URL will continue to point to the latest version, regardless of how many changes you make.\n\n**Enterprise Security** - Worried about storing propriety or sensitive information? WP Document Revisions was built from the first line of code with government- and enterprise-grade security in mind. Each file is masked behind an anonymous 128-bit [MD5 hash][7] as soon as it touches the server, and requests for files are transparently routed through WordPress's time-tested URL rewriting, authentication, and permission systems (which can even [integrate with existing enterprise active directory][8] or [LDAP servers][9]). Need more security? WP Document Revisions allows you to store documents in a folder above the `htdocs` or `public_html` [web root][10], further ensuring that only those you authorize have access to your work.\n\n**Customization** - WP Document Revisions recognizes that no two teams are identical, and as a result, molds to your firm's needs, not the other way around. Need to track additional information associated with a document? Departments, editors, issues, sections, even arbitrary key-value pairs – whatever you can throw at it, it can handle. Development and customization costs are further minimized by its extensive plugin API, and the [WordPress Custom Taxonomy Generator][11] makes it easy for even the uninitiated to add custom taxonomies to documents. Need an audit trail to track check-ins and check-outs? User-level permissions based on the document's state or another custom taxonomy? Support for third-party encryption? Check out the [WP Document Revisions Code Cookbook][12] for sample code. Looking for even more advanced control of your workflow? WP Document Revisions will detect the popular workflow plugin [Edit Flow][13], if installed, and will automatically pull [Edit Flow's advanced workflow management tools][14] into WP Document Revisions. Simply put, virtually every aspect of the plugin's functionality from workflow states to user-level permissions can be fully customized to your team's unique needs.\n\n**Future Proof** - Switching costs a concern? WP Document Revisions is built with tomorrow's uncertainty in mind. Equally at home in an in-house server room as it is in the cloud, moving individual files or entire document repositories in and out of WP Document Revisions is a breeze (history and all). And since the software is open-source, you can easily add tools to automate the process of moving to or integrating with future third-party systems.\n\n**The Vitals:**\n\n*   Support for any file type (docs, spreadsheets, images, PDFs — anything!)\n*   Securely stores unlimited revisions of your business's essential files\n*   Provides a full file history in the form of a revision log, accessible via RSS\n*   Helps you track and organize documents as they move through your organization's existing workflow\n*   Each file gets a permanent, authenticated URL that always points to the latest version\n*   Each revision gets its own unique url (e.g.,TPS-Report-revision-3.doc) accessible only to those you deem\n*   Files are intuitively checked out and locked to prevent revisions from colliding\n*   Toggle documents between public, private, and password protected with a single mouse click\n*   Runs in-house or in the cloud\n*   Secure: filenames are hashed on upload and files are only accessible through WordPress's proven authentication system\n*   Can move document upload folder to location outside of web root to further ensure government- and enterprise-grade security\n*   Documents and Revisions shortcodes, Recently Revised Documents widget\n*   Multisite and Windows (XAMPP) support\n*   French and Spanish language support (easily translated to your language)\n*   Integration with [Edit Flow][13]\n\n**Features Available via the [Code Cookbook][12]:**\n\n*   **Audit Trail** - creates check in / check out audit trail for all documents\n*   **State Permissions** - allows setting user-level permissions based on a custom taxonomy such as workflow state or other document status\n*   **Third Party Encryption** - example of how to integrate at rest encryption using third-party tools\n*   **Rename Documents** - changes all references to \"Documents\" in the interface to any label of your choosing\n*   **State Change Notification** - how to use document api to allow users to receive notification whenever documents change workflow state\n*   **Bulk Import** - how to batch import a directory (or other list) of files as documents\n*   **Filetype Taxonomy** - Adds support to filter by filetype\n*   **Track Changes** - Auto-generates and appends revision summaries for changes to taxonomies, title, and visibility\n*   **Remove Workflow States** - Completely removes Workflow state taxonomy backend and UI\n*   **Change Tracker** - Auto-generates and appends revision summaries for changes to taxonomies, title, and visibility\n\n**Translations:**\n\n*   French - [Hubert CAMPAN][15]\n*   Spanish - [TradiArt][16]\n\n**Links**:\n\n*   [Source Code][17] (GitHub)\n*   [Development version][18] ([Build Status][19])\n*   [Code Cookbook][12]\n*   [Translations][20] (GlotPres)\n*   [User support forums][21]\n*   [Submit a bug/feature request][22][  \n    ][23]\n\nQuestions? Comments? Many may have already been addressed in [the WP Document Revisions FAQ][24], or feel free to simply leave a reply below.\n\n**Give it a try today.**  \n[Download WP Document Revisions][1] from the WordPress Plugin Repository\n\n*WP Document Revisions was developed by a [law student and a business student][25] with a [grant from Google][26], and in close coordination with and under the watchful eye of WordPress.org's lead developers.* [^1] *Special thanks to [Jon Cave][28], [Aaron Jorbin][29], [Mitcho Erlewine][30], and [Andrew Nacin][31] for their guidance.*\n\n**Update (6/12): Comments have been closed in favor of [expanded support and discussion options][32]. Additional documentation about the project can now be found in the [Project Wiki][33]. If you are interested in joining the project at any level of technical expertise, please see [How to Contribute][34].**\n\n[^1]:  Neither relationship should imply a formal endorsement. \n\n [1]: http://wordpress.org/extend/plugins/wp-document-revisions/\n [2]: http://en.wikipedia.org/wiki/Document_management_system\n [3]: http://en.wikipedia.org/wiki/Revision_control\n [4]: http://ben.balter.com/wp-content/uploads/2011/07/wp-document-revisions-screen-shot.png\n [5]: http://ben.balter.com/2011/04/04/when-all-you-have-is-a-pair-of-bolt-cutters/\n [6]: http://sharepoint.microsoft.com/en-us/Pages/default.aspx\n [7]: http://en.wikipedia.org/wiki/MD5\n [8]: http://wordpress.org/extend/plugins/active-directory-integration/\n [9]: http://wordpress.org/extend/plugins/simple-ldap-login/\n [10]: http://httpd.apache.org/docs/2.0/mod/core.html#documentroot\n [11]: http://themergency.com/generators/wordpress-custom-taxonomy/\n [12]: https://github.com/benbalter/WP-Document-Revisions-Code-Cookbook\n [13]: http://editflow.org/\n [14]: http://ben.balter.com/2011/10/24/advanced-workflow-management-tools-for-wp-document-revisions/\n [15]: http://omnimaki.com/\n [16]: http://www.tradiart.com/\n [17]: https://github.com/benbalter/WP-Document-Revisions/\n [18]: https://github.com/benbalter/WP-Document-Revisions/tree/develop\n [19]: http://travis-ci.org/#!/benbalter/WP-Document-Revisions\n [20]: http://translations.benbalter.com/projects/wp-document-revisions/\n [21]: http://wordpress.org/tags/wp-document-revisions\n [22]: https://github.com/benbalter/WP-Document-Revisions/issues\n [23]: http://ben.balter.com/wp-content/uploads/2011/08/wp-document-revisions.png\n [24]: http://wordpress.org/extend/plugins/wp-document-revisions/faq/\n [25]: http://ben.balter.com\n [26]: http://code.google.com/soc/\n [27]: #note-2020-1 \" Neither relationship should imply a formal endorsement.\"\n [28]: http://joncave.co.uk/\n [29]: http://aaron.jorb.in/\n [30]: http://mitcho.com/\n [31]: http://andrewnacin.com/\n [32]: https://github.com/benbalter/WP-Document-Revisions/wiki/Where-to-get-Support-or-Report-an-Issue\n [33]: https://github.com/benbalter/WP-Document-Revisions/wiki\n [34]: https://github.com/benbalter/WP-Document-Revisions/wiki/How-to-Contribute","previous":"<p><img alt='' src='http://ben.balter.com/wp-content/uploads/2011/06/5554901181_664eac93a6_b-300x200.jpg' />Despite the hype, daily deal sites like Groupon and LivingSocial are not the next wave of e-commerce. Not only are they bad for merchants, their business model simply isn&#8217;t sustainable as established firms begin to enter the already-crowded market.</p>\n\n<p>***<strong><em>Bad for Business</em></strong>***</p>\n\n<p>It&#8217;s hard for small businesses to profit from the deal. Sure, a daily deal will drive additional bodies through the door, but like many promotions, business often lose money on the deal itself, especially once Groupon or LivingSocial&#8217;s cut is factored in, a cut which can often be as high as 50%. The key, it seems, for small business, is <a href='http://news.ycombinator.com/item?id=2654788'>to be smart</a>, either upselling the customer, or convincing them that a second, non-discounted visit is well worth their while — not a simple task for the uninitiated.</p>\n\n<p>Although Groupon&#8217;s compulsory non-disclosure agreement renders the majority of the evidence anecdotal at best, part of the problem seems to stem from a misalignment between the deal sites&#8217; interests and businesses&#8217;, despite what seems like a standard revenue sharing model. Deals are <a href='http://techcrunch.com/2011/06/09/groupon-single-worst-decision/'>scheduled to optimize the deal site&#8217;s profit</a>, not the merchant&#8217;s and the unexpected influx of new customers <a href='http://gawker.com/5786492/the-groupon-backlash-its-the-business-model-stupid'>can prove disasterous</a> if not properly managed. For a local business, an injection of constantly-connected 20-somethings can be fatal to the business&#8217;s online reputation if experience does not live up to the deal site&#8217;s <a href='http://gawker.com/5785317/the-groupon-backlash-is-on'>well-crafted hipster-sweatshop hype</a>.</p>\n\n<p><strong>Legal Pitfalls</strong></p>\n\n<p>The economics of the situation are only half the threat. Daily deals live in murky legal waters, and the sites often push small business into the deep end, rather than provide the necessary guidance. Basic economies of scale dictate that it would be significantly more efficient for Groupon or LivingSocial to establish a firm policy around the relevant legal issues (<em>e.g.,</em> &#8220;we do not offer discounts on alcohol in Chicago&#8221;), rather than require each small business to incur what most likely amounts to a relatively large expense (not to mention legal risk), effort duplicated across merchants and states.</p>\n\n<p>As Benjamin Edelman and Paul Kominers <a href='http://www.benedelman.org/voucher-consumer-protection/#liability'>argue</a>:</p>\n\n<p><span>T</span>he legal and regulatory questions… are questions that arise distinctively in the context of discount vouchers: a merchant would never confront such questions were it not for discount vouchers. Having created the transactions giving rise to this regulatory complexity… discount voucher services should be expected to achieve compliance.</p>\n\n<p>Edelman and Kominers <a href='http://www.benedelman.org/voucher-consumer-protection/#liability'>continue</a>:</p>\n\n<p>Voucher services typically seek to cast themselves as mere marketing vendors that are not responsible for the conduct of the corresponding merchants. For example, <a href='http://www.groupon.com/terms'>Groupon&#8217;s Terms of Sale</a> claim that &#8220;The Merchant, not Groupon, is the seller of the Voucher and the goods and services and is solely responsible for redeeming any Voucher you purchase.&#8221;</p>\n\n<p>…But a voucher service is the merchant of record for the charge to the customer&#8217;s credit card. As the entity officially responsible for charging the consumer, the voucher service thus faces increased responsibility to see that the consumer receives what was promised.</p>\n\n<p>This, combined with the fact that <a href='http://www.businessinsider.com/teardown-of-the-groupon-merchant-agreement-2011-6'>Groupon claims the entirety of the purchase price as revenue</a> suggests that daily deal sites are the 10,000 lb guerilla unfairly shifting the legal burden to small businesses. Despite all this, Groupon&#8217;s largest shareholder simply <a href='http://blogs.forbes.com/luisakroll/2011/04/04/new-billionaire-eric-lefkofsky-talks-about-groupon-and-tech-investing/'>recommends</a> that business not &#8220;worry about the noise that the legal system creates.&#8221;</p>\n\n<p><strong>Gift Cards?</strong> First is the question of if a daily deal constitutes a <a href='http://www.ncsl.org/default.aspx?tabid=12474'>gift card</a>, a legal issue with which both <a href='http://www.jpml.uscourts.gov/Panel_Orders/MDL-2238-Initial_Transfer.pdf'>Groupon</a> and <a href='http://www.seattlepi.com/local/article/Seattle-class-action-LivingSocial-expiration-1015493.php'>LivingSocial</a> are intimately familiar with, defending at least <a href='http://www.benedelman.org/voucher-consumer-protection/#expiration'>12 distinct lawsuits</a>. Despite the expiration date listed online, in print, and often sent in reminder e-mails, in some states, customers may be eligible to redeem deals long after they expire, or at least have ground to reclaim their initial investment, often at the merchants&#8217; expense.</p>\n\n<p><strong>Sales Tax</strong> Second is the question of what the sales tax should be levied at the time the goods or services are actually tendered. As TechCrunch aptly <a href='http://techcrunch.com/2011/06/15/daily-deal-consumer-protection-laws/'>points out</a> there&#8217;s a great deal of leeway depending on how you crunch the numbers:</p>\n\n<p>What&#8217;s the correct sales tax on a $51 purchase with a $50 Groupon that someone bought for $25 in a state with a 5% tax rate? The possible answers are 5 cents, 68 cents, $1.30 and $2.55. That&#8217;s based on a taxable value of $1 (amount paid at point of sale), $13.50 (amount merchant actually gets), $26 (total amount consumer paid) and $51 (total face value of the transaction).</p>\n\n<p><strong>Alcohol</strong> Third, daily deals involving alcohol, may <a href='http://www.tabc.state.tx.us/education/pdfs/Happy-Hour-Laws.pdf'>run afoul of the law in certain states</a>. In Illinois, Groupon&#8217;s home state, for example, it is illegal to offer alcohol discounts to some patriots and not others. Researchers found <a href='http://www.benedelman.org/voucher-consumer-protection/beer-chicago-google-060811.png'>87 deals</a> in Chicago alone that advertised discounts on beer, and <a href='http://www.benedelman.org/voucher-consumer-protection/wine-chicago-google-060811.png'>another 252</a> that offered discounts on wine.</p>\n\n<p><strong>What&#8217;s Next for Groupon</strong></p>\n\n<p>Not much. Assuming Groupon scales back its cut and guides merchants through the industry&#8217;s legal pitfalls, as Groupon&#8217;s <a href='http://www.sec.gov/Archives/edgar/data/1490281/000104746911005613/a2203913zs-1.htm'>recent S-1</a> shows, they are still <a href='http://techcrunch.com/2011/06/13/why-groupon-is-poised-for-collapse/'>using the revenue from new deals to pay for previous ones</a>, generally repaying merchants over the course of two months. If Google&#8217;s Offers service gains traction, Groupon could face some serious operating cash flow issues, especially with the competition paying out <a href='http://www.google.com/support/offersbusiness/bin/answer.py?hl=en&amp;answer=1229917'>80% within four days</a>.</p>\n\n<p><strong>Limited Growth</strong>Daily deal sites&#8217; most successful contribution to the market are not the deals themselves, but rather the hype ecosystem they generate. Like any viral network, their model is dependent on friends continuously asking friends &#8220;oh, have you heard of this cool new thing the kids are doing.&#8221; With the early adopting Facebook generation arguably tapped, it&#8217;s only a matter of time before baby boomers become equally saturated.</p>\n\n<p>Sure it&#8217;s fun to get an e-mail in your inbox with a &#8220;super-exclusive&#8221; offer, but when everyone&#8217;s in on it, the artificial scarcity is no longer all that alluring. How many nearly identical offers for half off yoga can one person get before they get tired of misses and simply unsubscribe. Multiply that threat by the increasing number of daily deal sites that are springing up and the problem becomes readily apparent.</p>\n\n<p><strong>Data Blindspot</strong>Smart websites are driven by data — personal data — and they use it to fuel growth. Amazon leverages my buying history to make personalized recommendations and I buy more stuff. Facebook maps out my social graph and recommends people I know and I friend more people. Netflix tracks my viewing history, going so far as to put a up a <a href='http://bits.blogs.nytimes.com/2009/09/21/netflix-awards-1-million-prize-and-starts-a-new-contest/'>$1 million bounty</a> to perfect reading my mind. And daily deal sites know that&#8217;s their <a href='http://techcrunch.com/2011/01/11/why-we-invested-in-groupon-the-power-of-data/'>only shot at staying relevant</a>.</p>\n\n<p>Despite <a href='http://techcrunch.com/2010/12/07/groupon-everywhere-jiwire/'>Groupon&#8217;s efforts</a>, there&#8217;s just not enough data there. They may have my age, gender, rough location, and one or two datapoints of buying history, but compare that to the relative dossier that Google and Amazon both have to have on me, it&#8217;s always going to be a losing fight. Once first mover advantage begins to lose its shimmer, the big boys&#8217; synergies will begin to show their <a href='http://www.wired.com/epicenter/2011/04/facebook-deals/'>true</a> <a href='http://thenextweb.com/us/2011/06/02/amazon-enters-the-daily-deals-space-with-amazonlocal/'>potential</a>, and daily deal sites like Groupon and LivingSocial will expire as quickly as the deals they peddle.</p>\n\n<p><span>Photo courtesy <a href='http://www.flickr.com/photos/wovox/5554901181/'>wovox</a></span></p>","content":"<p>Google recently added <a href='http://mashable.com/2011/06/30/google-analytics-social-plugin/'>social engagement tracking</a> to its analytics suite. With a little bit of leg work, Google Analytics can track not only +1s, but also Facebook and Twitter shares via a simple <code>_gaq.push</code> call.</p>\n\n<p>If your site uses WordPress&#8217;s JetPack plugin with Sharedaddy, and you already have <a href='http://yoast.com/wordpress/google-analytics/'>Google Analytics</a> up and running, you can use jQuery to attach the virtual event to the share button.</p>\n\n<p>To add Google Analytics to Sharedaddy&#8217;s Twitter share button:</p>\n<div>{% highlight javascript %}\n$('a.share-twitter').click( function() {\n_gaq.push( ['_trackSocial', 'twitter', 'share',\n$(this).attr('href').substr(0, $(this).attr('href').indexOf('?'))]);\n});{% endhighlight %}</div>\n<p>…and for Facebook:</p>\n<div>{% highlight javascript %}\n$('a.share-facebook').click( function() {\n_gaq.push( ['_trackSocial', 'faceboook', 'share',\n$(this).attr('href').substr(0, $(this).attr('href').indexOf('?'))]);\n});{% endhighlight %}</div>\n<p>The above code simply listens for the share button to be clicked, and if so, passes the target URL back to Google, along with the service&#8217;s name. Putting it all together into a plugin with a hook to <del>`wp_head`</del> <code>wp_footer</code> you get:</p>\n<script src='https://gist.github.com/1058469.js'> </script>\n<p>The code should work out of the box with the standard share buttons (seen below), but can easily be adapted with a few minor modifications to apply to like and other iterations of the social media icons.</p>\n\n<p>More details on the tracking code can be found over in the <a href='http://code.google.com/apis/analytics/docs/tracking/gaTrackingSocial.html'>Google Analytics Social Engagement Documentation</a>. Improve the code to work with your site? Feel free to <a href='https://gist.github.com/1058469'>fork the gist</a> and contribute it back.</p>\n\n<p><strong>Update:</strong> Dedicated reader All-around rabble-rouser <a href='http://andrewnacin.com'>Andrew Nacin</a> points out that by default, jQuery is queued up into the footer. Updated the above code to hook into <code>wp_footer</code> with a priority of 20 (higher than jQuery&#8217;s 10 hook).</p>\n\n<p><strong>Update:</strong> Special thanks to <a href='http://twitter.com/Ramoonus'>@Ramoonus</a> for <a href='https://gist.github.com/1058469/db96b6836f279811205bddbf8be67bec6ca2159c'>didn&#8217;t queue up jQuery</a>.</p>"}