{"title":"We've Been Selling Open Source Wrong","excerpt":"We should work to remedy the underlying culture, not its symptoms.","author":"Ben Balter","layout":"post","comments":"true","category":"Technology","tags":["government,open","source,code,workflow"],"related_posts":[{"url":"/2010/09/12/wordpress-resume-plugin/","id":"/2010/09/12/wordpress-resume-plugin","title":"WordPress Resume Plugin"},{"url":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party/","id":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party","title":"New Media Flak: Megaphone vs. Cocktail Party"},{"url":"/2010/10/10/does-every-cloud-have-a-silver-lining/","id":"/2010/10/10/does-every-cloud-have-a-silver-lining","title":"Does Every Cloud Have a Silver Lining?"},{"url":"/2010/11/06/removing-the-barriers-to-organizational-agility/","id":"/2010/11/06/removing-the-barriers-to-organizational-agility","title":"Removing the Barriers to Organizational Agility\n"},{"url":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing/","id":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing","title":"What Fourteen-Century Apple Pie Teaches Us About Sharing\n"},{"url":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds/","id":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds","title":"Will Federal Contracting Officers Soon Have Their Heads in the Clouds?\n"},{"url":"/2010/11/29/free-trade-in-china-just-google-it/","id":"/2010/11/29/free-trade-in-china-just-google-it","title":"Free Trade in China? Just Google it."},{"url":"/2010/11/29/twitter-mentions-as-comments/","id":"/2010/11/29/twitter-mentions-as-comments","title":"Twitter Mentions as Comments WordPress Plugin\n"},{"url":"/2010/12/01/the-internet-is-series-of-tubes/","id":"/2010/12/01/the-internet-is-series-of-tubes","title":"The Internet is Series of Tubes (oh, and Tollgates too)\n"},{"url":"/2010/12/20/late-night-infomercials/","id":"/2010/12/20/late-night-infomercials","title":"Late-Night Infomercials: Guaranteed to Extend the 4th Amendment or Your Money Back"}],"url":"/2013/05/14/we-ve-been-selling-open-source-wrong/","date":"2013-05-14 00:00:00 -0400","id":"/2013/05/14/we-ve-been-selling-open-source-wrong","categories":["technology"],"next":"/2013/06/12/an-open-letter-to-government-cios","previous":"/2013/02/27/the-store-that-sells-only-one-thing","content":"<p>Imagine if tomorrow, 10 of the top open-source developers showed up outside the gates of the White House with pitch forks and battering rams, somehow (peacefully) got inside, and was able to convince the powers that be to release the code that runs say, The Situation Room. Do you think once public, the project would have much chance of sustainable success in the wild?</p>\n\n<h2 id='code_born_in_captivity'>Code born in captivity</h2>\n\n<p>Even with the code out in the open and a small team of committed developers, the White House will still have its own, probably Waterfall-ish workflow, its own, private issue tracker, and most importantly, it&#8217;s own goals, priorities, and chain of command that the rest of the world wouldn&#8217;t be privy to. I doubt the software would be very well documented to begin with, so have fun reverse-engineering half the functionality, not to mention, you&#8217;d likely be hard pressed to find a wider use case for such purpose-built code which I can only imagine is written in Cold Fusion or some other unfortunate (proprietary) language last seen when Palm Pilots were in vogue. It&#8217;s still a closed-source project, governed by a closed-source mentality and closed-source tools. The code just happens to be available online.</p>\n\n<p>Making code public is the last thing we should be worrying about. Lining up at the gate and demanding to see code (with or without the torches), asking that an agency open source project X, or release an API for the data behind service Y implicitly treats open source as an ends, not as a means. And it&#8217;s no wonder that we&#8217;re struggling to gain traction in certain circles or are frustrated that people simply don&#8217;t &#8220;get it.&#8221; If we have to ask, it&#8217;s too late. The damage has already been done.</p>\n<!-- more -->\n<h2 id='open_source__public'>Open source ≠ public</h2>\n\n<p>We can make all the arguments we want for why open source produces better, more secure software, how it&#8217;s already paid for by the tax payers, how it reduces duplication of efforts, or prevents vendor lock in. But none of that matters if the workflow on the other side of the (fire)wall is predicated on a culture of distrust. We need to make the plea further up the value chain. It&#8217;s time to <a href='http://en.wikipedia.org/wiki/Vertical_integration'>backwards integrate</a>.</p>\n\n<p>We should focus our efforts on the 99% of the process that happens before the code makes it out the door, the bulk of the iceberg that&#8217;s hiding below the water&#8217;s surface. <a href='http://ben.balter.com/2012/10/15/open-source-is-not-a-verb/'>Open source was never intended to be a verb</a>, and we shouldn&#8217;t treat it that way. Open source has little to do with code being public. Hitting a publish button does nothing to change the underlying worldview that technology has long since deprecated.</p>\n\n<h2 id='empowering_internal_stakeholders'>Empowering internal stakeholders</h2>\n\n<p>We should be opening the eyes of public servants. Let them realize that their workflow may as well involve a typewriter and a fax machine (if it doesn&#8217;t already). To inspire people on the inside - the people coding the software, collecting the data, and writing the policies - that there are much, much easier ways to do things, and then to <a href='http://ben.balter.com/open-sourcing-government/'>show them how</a>. To break the bad habits sub-par software has unfortunately ingrained.</p>\n\n<p>Whether public or within an organization, at its core, open source is about open collaboration. It&#8217;s about realizing that creating stuff is a team sport. That it&#8217;s not a zero-sum game. That erecting technical and administrative constraints to hinder the free flow of information simply serves to introduce friction and decrease the overall efficiency of the system. That for every dollar spent locking things down or defining rigid procedures, you also spend a dollar shooting yourself in the foot. It&#8217;s almost as if government employees haven&#8217;t heard the story of Encyclopedia Britannica v. the entire Internet.</p>\n\n<h2 id='the_technologys_the_easy_part'>The technology&#8217;s the easy part</h2>\n\n<p>We should work to remedy the underlying culture, not its symptoms. We need to focus on making the entire process <a href='http://ben.balter.com/2012/06/26/why-you-should-always-write-software-as-open-source/'>open from the start</a>, even if the code never leaves the firewall. We need to counterbalance <a href='http://ben.balter.com/2012/03/02/php-is-insecure-and-other-enterprise-open-source-fud/'>the FUD</a> that is leaving government agencies stranded in the pre-Internet age. Yes, getting access to government source code can have value in and of itself, but if the process isn&#8217;t open, if it&#8217;s just a one-way code dump, what&#8217;s the point? The technology&#8217;s the easy part. Buy a developer a six pack and a weekend later you&#8217;ll have something comparable, if not better.</p>\n\n<p>It&#8217;s about creating communities around shared problems. About recognizing that we&#8217;re on the same team. It&#8217;s about creating a culture within government - a realization that it&#8217;s easier to work together - so that next time, we don&#8217;t even have to ask, let alone break down the front gate.</p>","path":"_posts/2013-05-14-we-ve-been-selling-open-source-wrong.md"}