{"author":"Benjamin J. Balter","title":"Using WordPress to Craft Your Personal Brand\n","excerpt":"Recording and slides from my brief talk at March's joint WordCampDC and Hacks/Hackers DC MeetUp on leveraging WordPress to craft your personal brand.","layout":"post","category":["Technology"],"tags":["journalism","online reputation","personal branding","presentation","Resume","wordpress"],"post_format":[],"url":"/2011/03/09/craft-your-personal-brand/","date":"2011-03-09 00:00:00 -0500","id":"/2011/03/09/craft-your-personal-brand","categories":["posts"],"next":"I needed a quick-and-easy way to parse Microsoft Word's footnote format into a more web-friendly format for a recent project. After a bit of regular expression hacking, I was able to build a WordPress plugin to automatically convert content pasted from Word into a format readable by [Andrew Nacin's][1] popular [Simple Footnotes][2] plugin.  \r\n  \r\nThe process is surprisingly simple given [WordPress's extensive filter API][3]. First, to grab the footnotes from Word's `ftnref` format:\r\n\r\n<div>{% highlight php %}<?php\r\n\r\n//grab all the Word-style footnotes into an array\r\n$pattern = '#<a href\\=\"\\#_ftnref([0-9]+)\">\\[([0-9]+)\\]</a> (.*)#';\r\npreg_match_all( $pattern, $content, $footnotes, PREG_SET_ORDER);\r\n\r\n?>{% endhighlight %}</div>\r\n\r\nThis creates an array (`$footnotes`) with the both the footnote number and the text of the footnote. We then need a way to replace the in-text reference with the parsed footnotes so that Simple Footnotes can understand them. I did this by creating two arrays, a find array and a replace array with each Word-style footnote reference and its Simple Footnote formatted counterpart:\r\n\r\n<div>{% highlight php %}<?php\r\n\r\n//build find and replace arrays\r\nforeach ($footnotes as $footnote) {\r\n  $find[] = '#<a href\\=\"\\#_ftn'.$footnote[1].'\">\\['.$footnote[1].'\\]</a>#';\r\n  $replace[] = '[ref]' . str_replace( array(\"\\r\\n\", \"\\r\", \"\\n\"), \"\",   $footnote[3]) . '[/ref]';\r\n}   \r\n\r\n?>{% endhighlight %}</div>\r\n\r\nFinally, so that the entire replacement can be done in a single pass, push a final find/replace pair into the end of the array, to remove the original footnotes:\r\n\r\n<div>{% highlight php %}<?php\r\n\r\n    //remove all the original footnotes when done\r\n    $find[] = '#<div>\\s*<a href\\=\"\\#_ftnref([0-9]+)\">\\[([0-9]+)\\]</a> (.*)\\s*</div>\\s+#';\r\n    $replace[] = '';\r\n\r\n?>{% endhighlight %}</div>\r\n\r\nBecause PHP's `preg_replace` function can handle arrays, all we have to do is run a single function:\r\n\r\n<div>{% highlight php %}<?php\r\n\r\n$content = preg_replace( $find, $replace, $content );\r\n\r\n?>{% endhighlight %}</div>\r\n    \r\nPutting it all together, including a filter hook to call our function and a `meta_value` flag to prevent parsing on subsequent saves, the result is:\r\n\r\n<script src=\"http://gist-it.appspot.com/github/benbalter/Convert-Microsoft-Word-Footnotes-to-WordPress-Simple-Footnotes/raw/master/parse-footnotes.php\">     </script>\r\n\r\nTo use, you can [download the plugin file][5][^1] and activate (be sure you already have [Simple Footnotes][2] installed). Copy the content from Word, and Paste into the \"*Paste from Word*\" box (may need to toggle the \"[*Kitchen Sink*][6]\".[^2]\r\n\r\nThoughts? Improvements? The above code solved a rather stubborn workflow problem in a project I was working on, and hopefully it can do the same for you. Feel free to use/improve the above code.\r\n\r\n[^1]: Licensed under [GPLv2][10]\r\n[^2]: You can even [Fork the plugin over on Github][8]\r\n\r\n [1]: http://andrewnacin.com\r\n [2]: http://andrewnacin.com/2010/07/24/simple-footnotes-0-3/\r\n [3]: http://codex.wordpress.org/Plugin_API/Filter_Reference\r\n [4]: #note-2020-1 \"' . str_replace( array(\"\\r\\n\", \"\\r\", \"\\n\"), \"\", $footnote[4]) . '\"\r\n [5]: https://github.com/benbalter/Convert-Microsoft-Word-Footnotes-to-WordPress-Simple-Footnotes\r\n [6]: http://www.bloggingteacher.com/writing-posts-with-the-wordpress-visual-editor-the-kitchen-sink\r\n [7]: #note-2020-2 \"Licensed under GPLv2\"\r\n [8]: http://ben.balter.com/2011/03/20/regular-expression-to-parse-word-style-footnotes/\r\n \r\n [10]: http://wordpress.org/about/gpl/","previous":"<p><img alt='' src='http://ben.balter.com/wp-content/uploads/2011/02/IPRC_Seized_2010_11-300x225.gif' />Violating due process is one thing, but violating web standards… well that&#8217;s another story.</p>\n\n<p>The Department of Homeland Security (DHS) recently began protecting America&#8217;s shores from threats of a different kind: online copyright infringement. In the days before the Superbowl, the agency set out to enforce the &#8220;express written consent of the NFL&#8221; provision attached to most broadcasts by slamming the iron fist of the law down on <a href='http://itwel.com/atdhe-live-sports-streaming-website-seized-by-us-authorities.php'>six sports-streaming websites</a>. This is troubling on multiple levels. As the Vololkh Conspiracy&#8217;s David Post <a href='http://volokh.com/2011/02/02/more-outrageous-domain-name-seizures-by-our-vigilant-dept-of-homeland-security/'>put it</a>:</p>\n\n<blockquote>\n<p>There&#8217;s a good reason we don&#8217;t generally allow agents of the State to march into judge&#8217;s chambers and deprive people of their property without an adversary hearing, viz., they&#8217;re likely to make errors that can be difficult to correct ex post.</p>\n</blockquote>\n\n<p>And that&#8217;s exactly what happened when the Feds <a href='http://www.huffingtonpost.com/2011/02/02/rojadirecta-org-seized_n_817458.html'>seized riojadirecta.org</a>.However, the law in the area is a bit more nuanced than a single form can satisfy. Riojadirecta did not actually host any infringing content — it merely aggregated links to such content — potentially invoking the safe harbor provisions of the copyright act. <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> Compounding the issue, Spanish Courts had found the Spanish-based site to be <a href='http://torrentfreak.com/sports-streaming-torrent-links-site-victorious-in-court-100510/'>perfectly legal</a>, just a few months prior.</p>\n\n<p>Seizures of this type are nothing new. Back in November, DHS <a href='http://torrentfreak.com/u-s-government-seizes-bittorrent-search-engine-domain-and-more-101126/'>commandeered</a> some <a href='http://www.ice.gov/doclib/news/releases/2010/domain_names.pdf'>80 bit torrent domains</a> (PDF) as part of the broader &#8221;<a href='http://www.ice.gov/news/releases/1006/100630losangeles.htm'>Operation In Our Sites</a>&#8221;. One such site, dajaz1.com, a music blog dedicated to hip-hop, was claimed to have infringed on music copyrights, however it was later revealed that the <a href='http://www.nytimes.com/2010/12/20/business/media/20music.html?_r=1&amp;ref=todayspaper'>music in question was provided to the site by music industry executives</a>. Despite this revelation, DHS made no apparent move to look into the case or restore the domain, and <a href='http://dajaz1.com/'>the site remains down</a> to this day.</p>\n\n<p>Part of the problem may stem from law enforcement being out of touch with today&#8217;s trends. Even the agent in charge of the investigation <a href='http://arstechnica.com/tech-policy/news/2010/12/busting-bittorrent.ars'>referred to the infringing material as &#8220;a bit torrent,&#8221;</a> suggesting a sophomoric understand of just what exactly was being seized.</p>\n\n<p>More worrisome, however, is the fact that the statute cited to authorize such seizures, 18 U.S.C. § 2323, provides no safeguard to prevent such errors from occurring <sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> nor does it <a href='http://www.copyhype.com/2011/02/can-google-be-seized-by-ice/'>prohibit its expanded use</a>. <sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup> As Sen. Ron Wyden (D-OR) <a href='http://arstechnica.com/tech-policy/news/2011/02/senator-us-domain-name-seizures-alarmingly-unprecedented.ars?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=rss'>argued</a>:</p>\n\n<blockquote>\n<p>In contrast to ordinary copyright litigation, the domain name seizure process does not appear to give targeted websites an opportunity to defend themselves before sanctions are imposed… I worry that domain name seizures could function as a means for end-running the normal legal process in order to target websites that may prevail in full court. The new enforcement approach used by Operation In Our Sites is alarmingly unprecedented in the breadth of its potential reach.</p>\n</blockquote>\n\n<p>Even looking beyond the due process issues and to the underlying copyright infringement, simply put, the government&#8217;s efforts fail to solve the problem. In Riojadirecta&#8217;s case, for example, the site <a href='http://twitter.com/#!/rojadirecta/status/32348722188779520'>used Twitter</a> to <a href='http://www.huffingtonpost.com/2011/02/02/rojadirecta-org-seized_n_817458.html'>direct users to one of its five other domains</a> rending the seizure a moot point. The problem is that the government is not seizing the infringing material, but rather, an <a href='http://en.wikipedia.org/wiki/Domain_name'>alias for the network address</a> of a site that in many cases, only contains links to infringing material. It would be as if DHS seized my cell phone number because my friends could use it to call and find out the location of a weekly poker game — the game would still take place, I would just get a new phone number.</p>\n\n<p>The most upsetting part, at least for the web developer in me, has to be <a href='http://dajaz1.com/IPRC_Seized_2010_11.gif'>the seizure notice</a> itself. Putting text in images like that has to be up there with <a href='http://bancomicsans.com/'>using Comic Sans</a>. While I do not expect DHS to hire a legion of designers and developers to make an HTML5 seizure notice (although that would be awesome), some in-document text would go a long way to making the web a whole lot less ugly. <sup id='fnref:4'><a href='#fn:4' rel='footnote'>4</a></sup> Additionally, it looks like their policy has changed since the initial seizures, however, at least as late as November, DHS was <a href='http://qbit.cc/homeland-security-tracking-visits-to-seized-domains-using-google-analytics-and-piwik/'>placing Google Analytics and Piwik tracking codes on its seized domains</a>, arguably in violation of <a href='http://www.whitehouse.gov/sites/default/files/omb/assets/memoranda_2010/m10-22.pdf'>OMB memorandum M-10-22</a> (PDF).</p>\n\n<p>As seen in the recent <a href='http://gawker.com/#!5704966/wikileaks-loses-its-domain'>Wikileaks domain shell game</a>, its clear that domain servers are the weak link in the online content-delivery chain. When the state can no longer seize something that represent the forefront of our ability to communicate with one another (decentralized information sharing) and replace it with a technology the web collectively deprecated with the rise of CSS1 (sites which rely on .GIFs to render text), legality and politics aside, the internet will undoubtedly be a better place.</p>\n\n<p>Notes:</p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>17 U.S.C. § 512(d). <span>25</span></p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p>The relevant provisions of § 2323 allow for the forfeiture of &#8220;(A) Any article, the making or trafficking of which is, prohibited under section 506 of title 17″ prohibiting &#8220;willful copyright infringement&#8221; and &#8220;(B) Any property used, or intended to be used, in any manner or part to commit or facilitate the commission of an offense referred to in subparagraph (A).&#8221; <span>26</span></p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p>As <a href='http://volokh.com/2010/12/01/copyright-enforcement-tail-wags-internet-dog-contd-or-what-the-hell-ever-happened-to-due-process/'>Post noted back then</a>, and even more relevant now in light of Egypt&#8217;s recent flipping of its internet kill switch, &#8220;our ability to defend the principle of the single global Internet – the Internet where all of humanity has equal access to knowledge and ideas, the Internet that looks the same to, and allows free and unfettered communication between, users located in Shanghai and Seattle and Santiago, free of locally imposed censorship regimes – will be deeply compromised by <span>seizures of this kind</span>, which would enshrine in U.S. law for the first time the contrary principle: that all countries have a right to insist on the removal of content, wherever located, from the global Internet in service of the exigencies of local law.&#8221; (Quoting a <a href='http://volokh.com/2010/12/01/copyright-enforcement-tail-wags-internet-dog-contd-or-what-the-hell-ever-happened-to-due-process/'>letter he authored</a> criticizing the Senate&#8217;s Combating Online Infringements and Counterfeits Act). <span>28</span></p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li><li id='fn:4'>\n<p>Beyond being reminiscent of Geocities (and most of the 90s), text in images is not machine readable, a requirement of section 508 (codified at 29 U.S.C. § 794(d)) . That means that neither screen readers nor search engines can accurately parse the site&#8217;s content. <span>29</span></p>\n<a href='#fnref:4' rev='footnote'>&#8617;</a></li></ol></div>","content":"<p>I gave a brief talk at March&#8217;s joint <a href='http://www.meetup.com/wordpressdc/events/16178194/'>WordPressDC and Hacks/Hackers DC MeetUp</a> on leveraging WordPress to craft your personal brand. Below are slides and a recording of the livestream.</p>\n\n<p><strong>I invite you to watch, but in short, the main takeaways were:</strong></p>\n\n<ul>\n<li><img alt='Why Brand?' src='http://ben.balter.com/wp-content/uploads/2011/03/branding-300x224.png' />In the olden days, people used to be scared to put personal information online; they felt the need to be pseudonymous (<em>see</em> handles like SparklePrincess87); life online was distinct from life offline.</li>\n\n<li>As more of our analog lives became digital, the need for a second identity diminished; we no longer represent ourselves with anonymous screen names, but rather as ourselves.</li>\n\n<li>Social networking and mobile computing contributed to this shift by interfacing the online and offline worlds. Today&#8217;s radical transparency (<em>e.g.,</em> lifecasters posting pictures of their lunch) shows we have come a full 180.</li>\n\n<li>We shift from corporate brand associations in the 50s (<em>e.g.,</em> &#8220;I work for IBM&#8221;) to personal brands today (<em>e.g.,</em> &#8221;I&#8217;m an independent contractor&#8221;).</li>\n\n<li>Today we all have a unique opportunity to plant a flag on our corner of the internet, take control of our online identity, and declare to the world who we are by crafting a thought-out narrative.</li>\n\n<li>Unlike in the real world where you are the only one in control of what you say, online, content has a life of its own — you must be proactive.</li>\n\n<li>WordPress makes it dumb simple to tell the world your story.</li>\n</ul>\n\n<p><strong>My five big steps to launching your brand:</strong></p>\n\n<ol>\n<li>Grab a domain</li>\n\n<li>Define your personal brand</li>\n\n<li>Start a blog</li>\n\n<li>Socialize your content</li>\n\n<li>Upgrade your resume</li>\n</ol>\n\n<p><strong>Recording of the livestream:</strong></p>\n\n<p><em><a href='http://www.greglinch.com/'>Greg Linch</a> opens by discussing WordPress and Journalism, I begin at 30m 10s</em></p>\n\n<p><strong>Accompanying slides if you wish to follow along:</strong></p>\n\n<p><strong>For those interested in the plugins mentioned:</strong></p>\n\n<ul>\n<li><a href='http://ben.balter.com/2010/09/12/wordpress-resume-plugin/' title='WordPress Resume Plugin'>Resume Plugin for WordPress</a></li>\n\n<li><a href='http://ben.balter.com/2011/01/11/wordpress-emphasis-plugin/' title='WordPress Emphasis Plugin: Highlight and Permalink Text'>Emphasis Plugin for WordPress</a></li>\n\n<li><a href='http://wordpress.org/extend/plugins/all-in-one-seo-pack/'>All in One SEO</a></li>\n\n<li><a href='http://yoast.com/wordpress/google-analytics/'>Google Analytics for WordPress</a></li>\n\n<li><a href='http://wordpress.org/extend/plugins/simple-facebook-connect/'>Simple Facebook Connect</a></li>\n\n<li><a href='http://wordpress.org/extend/plugins/simple-twitter-connect/'>Simple Twitter Connect</a></li>\n\n<li><a href='http://wordpress.org/extend/plugins/subscribe-to-comments/'>Subscribe to Comments</a></li>\n\n<li><a href='http://wordpress.org/extend/plugins/syntaxhighlighter/'>Syntax Highlighter Evolved</a></li>\n</ul>\n\n<p><strong>Additional Resources:</strong></p>\n\n<ul>\n<li><a href='http://rapportive.com/'>Rapportive</a></li>\n\n<li><a href='http://thenextweb.com/socialmedia/2010/10/13/bit-ly-now-lets-you-add-qr-codes-to-links-in-seconds/'>How to generate a QR code</a></li>\n</ul>\n\n<p>A special thanks to everyone who was able to come out or follow along on the livestream.</p>\n\n<p>Comments? I&#8217;d love to hear your thoughts below.</p>"}