{"author":"Benjamin J. Balter","title":"Will Federal Contracting Officers Soon Have Their Heads in the Clouds?\n","excerpt":"As one Hewlett Package Chief executive recently put it, cloud computing \"is the next generation of the internet.\" Whether you realize it or not, if you use services like Facebook or Gmail, your personal data already lives in \"the cloud,\" and the same transformative power that connects long-lost classmates at the click of a mouse can be harnessed by federal agencies to approach modern governance in incredibly powerful ways.\n","layout":"post","categories":["Law","Technology"],"tags":["cloud computing","contracting","federal","government","procurement"],"post_format":[],"related_posts":[{"url":"/2010/09/12/wordpress-resume-plugin/","id":"/2010/09/12/wordpress-resume-plugin","title":"WordPress Resume Plugin"},{"url":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party/","id":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party","title":"New Media Flak: Megaphone vs. Cocktail Party"},{"url":"/2010/10/10/does-every-cloud-have-a-silver-lining/","id":"/2010/10/10/does-every-cloud-have-a-silver-lining","title":"Does Every Cloud Have a Silver Lining?"},{"url":"/2010/11/06/removing-the-barriers-to-organizational-agility/","id":"/2010/11/06/removing-the-barriers-to-organizational-agility","title":"Removing the Barriers to Organizational Agility\n"},{"url":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing/","id":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing","title":"What Fourteen-Century Apple Pie Teaches Us About Sharing\n"},{"url":"/2010/11/29/free-trade-in-china-just-google-it/","id":"/2010/11/29/free-trade-in-china-just-google-it","title":"Free Trade in China? Just Google it."},{"url":"/2010/11/29/twitter-mentions-as-comments/","id":"/2010/11/29/twitter-mentions-as-comments","title":"Twitter Mentions as Comments WordPress Plugin\n"},{"url":"/2010/12/01/the-internet-is-series-of-tubes/","id":"/2010/12/01/the-internet-is-series-of-tubes","title":"The Internet is Series of Tubes (oh, and Tollgates too)\n"},{"url":"/2010/12/20/late-night-infomercials/","id":"/2010/12/20/late-night-infomercials","title":"Late-Night Infomercials: Guaranteed to Extend the 4th Amendment or Your Money Back"},{"url":"/2011/01/04/the-files-in-the-computer/","id":"/2011/01/04/the-files-in-the-computer","title":"The Files \"in\" the Computer -- Zoolander and the California Supreme Court"}],"url":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds/","date":"2010-11-15 00:00:00 +0000","id":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds","next":"/2010/11/29/free-trade-in-china-just-google-it","previous":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing","content":"<h2 id='a_brief_look_at_the_imminent_cloudcomputing_storm_front'>A Brief Look at the Imminent Cloud-Computing Storm Front</h2>\n\n<p>As one Hewlett-Packard chief executive recently put it, cloud computing &#8220;is the next generation of the internet.&#8221; <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> Whether you realize it or not, if you use services like Facebook or Gmail, your personal data already lives in &#8220;the cloud,&#8221; and the same transformative power that connects long-lost classmates at the click of a mouse can be harnessed by federal agencies to approach modern governance in incredibly powerful ways.</p>\n\n<p><strong>What is Cloud Computing?</strong></p>\n\n<p>Traditionally, when one thinks of computing power, he or she thinks of an on-site datacenter — a room filled with blinking lights and whirling fans — hardware, software, and data storage all within feet of the users they serve. <sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> The traditional approach to computing generally entails complicated and expensive upgrade procedures scheduled on a semi-regular basis, as well as accommodating the increasing demand for backup and recovery redundancy necessary to reduce downtime should these system fails. <sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup> Such datacenters are often managed by their own departments, staffed with the specialized, technical administrators needed to maintain and ensure the day-to-day operation of these increasingly complex and increasingly mission-critical business resources. <sup id='fnref:4'><a href='#fn:4' rel='footnote'>4</a></sup></p>\n\n<p>Seen as a virtually unlimited hardware and communications infrastructure managed by a third party-provider, cloud computing, on the other hand, allows for rapid increases in capacity without the need to invest in additional hardware, personnel, or software licensing. <sup id='fnref:5'><a href='#fn:5' rel='footnote'>5</a></sup> &#8220;As a customer, you don&#8217;t know where the resources are, and for the most part, you don&#8217;t care. What&#8217;s really important is the capability to access your application anywhere, move it freely and easily, and inexpensively add resources.&#8221; <sup id='fnref:6'><a href='#fn:6' rel='footnote'>6</a></sup> In simplest terms, the cloud uses an off-site service to store, transmit, and process information, and employs the Internet as the means to access that service. <sup id='fnref:7'><a href='#fn:7' rel='footnote'>7</a></sup></p>\n\n<p><strong>How Cloud Computing Came About</strong></p>\n\n<p>Several innovations fueled the shift toward computing in the cloud. First, the rise and adoption of both broadband Internet access, which allowed for reduced load times, and a programming technique known as AJAX, which allowed Web sites to look and feel more like desktop programs through a constant push-and-pull of information, combined to usher in a greater reliance on remote applications. <sup id='fnref:8'><a href='#fn:8' rel='footnote'>8</a></sup> At the same time the growth of enterprise data centers, and the public&#8217;s increasing comfort with Web 2.0 services like GMail and Facebook provided a technical and social infrastructure to support such a push. <sup id='fnref:9'><a href='#fn:9' rel='footnote'>9</a></sup></p>\n\n<p>The biggest breakthrough, however, the core and true power behind cloud computing, came from the consolidation of physical servers through system virtualization. Through virtualization, one physical server can become the host to many virtual servers. <sup id='fnref:10'><a href='#fn:10' rel='footnote'>10</a></sup> Because the resources are dynamically allocated across physical servers as the virtual servers require them, the physical resources are used more efficiently. <sup id='fnref:11'><a href='#fn:11' rel='footnote'>11</a></sup> If server <em>A</em>, say an e-mail server like one may see in most corporate or government offices sees a sudden spike in activity, rather than slowing, it can borrow resources from server <em>B</em>, a Web site hosted on the same physical server. The user, unaware that this shift has even occurred, sees the two servers as discrete and unconnected despite their physical location.</p>\n\n<p>The biggest implication however, is that computing resources can be provisioned and released on demand and as needed. <sup id='fnref:12'><a href='#fn:12' rel='footnote'>12</a></sup> If agency <em>X</em> is a government agency that requires a great deal of information to be processed at the close of the stock market each day, it can pay for five servers up until 3:59 each day, be charged solely for the increased processing power and storage it requires from 4:00 to 4:05, and can return to five server for the remainder of the day. Under a traditional approach, all 100 servers, for example, it required at its peak, would have to be operational 24 hours a day, with the necessary personnel and infrastructure to support it.</p>\n\n<p><strong>Types of Cloud Computing</strong></p>\n\n<p>Cloud computing exists in several forms today. The most basic, &#8220;infrastructure as a service&#8221; (IAAS), uses shared facilities, hardware, and networks to hold and move data. Customers, given virtual servers, may then install, configure, and utilize their own software freely. <sup id='fnref:13'><a href='#fn:13' rel='footnote'>13</a></sup> As indicated above, however, customers do not rent the physical servers (merely their equivalent processing power), and providers may move virtual servers between physical servers as necessary. <sup id='fnref:14'><a href='#fn:14' rel='footnote'>14</a></sup> Amazon&#8217;s EC2, S3, and CloudFront are prime examples of cloud computing, storage, and delivery respectively.</p>\n\n<p>Second, and slightly more advanced, &#8220;platform as a service&#8221; (PAAS) allows providers to serve customers with a shared computing platform and software environment. The customer can upload software code in a predetermined programming language (such as Java or PHP) and the provider executes that code and returns the result. <sup id='fnref:15'><a href='#fn:15' rel='footnote'>15</a></sup> Google Apps Engine is a prime example of such an arrangement.</p>\n\n<p>Finally, &#8220;software as a service&#8221; (SAAS) is most associated with Web-based consumer services such as Facebook or Flickr but can find application in business and government environments as well. The provider hosts software designed to perform a specific function, such as social networking or photo sharing, and the user interacts with that application being run on the provider&#8217;s server. <sup id='fnref:16'><a href='#fn:16' rel='footnote'>16</a></sup></p>\n\n<p>One additional distinction among cloud services can be made. Each of the three approaches listed above can be hosted in either a public cloud, meaning one customer&#8217;s virtual servers may be freely intermingled with another customer&#8217;s among physical servers, or in a private cloud in which the physical servers, infrastructure, or datacenter may be entirely segregated from those used to provide services to other clients. <sup id='fnref:17'><a href='#fn:17' rel='footnote'>17</a></sup></p>\n\n<p><strong>Implications of Cloud Computing</strong></p>\n\n<p>Cloud computing has several implication for members of the government contracting community. First, inherent in the nature of cloud computing is the fact that one organization must trust a third party with its data, something which may have far-reaching ethical and legal implication depending on the type of data stored and the parties involved.</p>\n\n<p>More broadly, when contracting for cloud services, organizations have several technical aspects to take into account. From a security standpoint, customers should evaluate data encryption (can others access my data?), physical security (can others access the datacenter?), and provider viability (will the service be around in ten years?). From a data integrity standpoint, those looking to enter the cloud should inquire as to data locality (is my data being hosted outside the United States?), data portability (what happens if I want to leave the service?), and redundancy (what happens if there is a natural disaster near their data center?). Finally, from a legal perspective, customers should evaluate terms of service, privacy policies, and service level (uptime) agreements. <sup id='fnref:18'><a href='#fn:18' rel='footnote'>18</a></sup></p>\n\n<p><strong>How to Get Into the Cloud</strong></p>\n\n<p>Several avenues exist for organizations looking to experiment with the cloud. For federal agencies, the General Service Administration, through Apps.gov, will soon be rolling out a Federal private cloud. While the specifics have not yet been announced, this service is expected to provide federal agencies with storage, virtual machine, and Web hosting services at a relatively low cost. <sup id='fnref:19'><a href='#fn:19' rel='footnote'>19</a></sup> Some of this service&#8217;s potential has already been hinted at by the recent launch of Apps.Gov NOW, a hosted service that provides federal agencies with out-of-the-box blogs (Web site publishing platforms), Wikis (Web sites editable by members of a community), and online bulletin boards (Web sites to facilitate online discussions), all at no cost. <sup id='fnref:20'><a href='#fn:20' rel='footnote'>20</a></sup></p>\n\n<p>Second, many federal Web sites such as the Federal Communications Commission and Recovery.Gov are in the process of seeking or have already sought third-party cloud hosting services likes Amazon Web Services (AWS) as mentioned above. <sup id='fnref:21'><a href='#fn:21' rel='footnote'>21</a></sup> Federal agencies opting for such a route must be sure to work closely with the appropriate parties to ensure, federal IT security standards are met, such as FISMA <sup id='fnref:22'><a href='#fn:22' rel='footnote'>22</a></sup> requirements, or that record retention standards are met, for example, where data stored in the cloud constitutes a system of records under the privacy act. <sup id='fnref:23'><a href='#fn:23' rel='footnote'>23</a></sup></p>\n\n<p>Finally, earlier this summer, Google announced FISMA moderate certification of its Google Apps for Government data centers, providing mail, calendar, document, video, and Web hosting services to Federal agencies in a private cloud hosted entirely within the United States. <sup id='fnref:24'><a href='#fn:24' rel='footnote'>24</a></sup> Agencies wishing to contract their traditional IT infrastructure out to Google can do so for as low as $50 per user per year, however, such savings may come at a cost. Special attention must be paid to the risks associated with trusting a third-party with what may potentially be an agency&#8217;s most sensitive data.</p>\n\n<p>Whether a federal contracting officer or a provider of IT services, just as the Internet has revolutionized countless aspects of every day life, it is clear that so too will the emerging cloud computing front forever shape the contours of Federal IT procurement in the years to come.</p>\n\n<p><em>This article originally published in the <a href='http://www.fedbar.org/Sections/Government-Contracts-Section/Newsletters.aspx'>Federal Bar Association Government Contracts Section</a> <a href='http://www.fedbar.org/Sections/Government-Contracts-Section/Newsletters/Fall-2010.aspx?FT=.pdf'>Fall 2010 Newsletter</a> (PDF, p. 6).</em></p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>Stephen Lawson, <em>Cloud is Internet&#8217;s Next Generation, HP Executive Says</em>, InfoWorld, June 25, 2009, http://www.infoworld.com/d/cloud-computing/cloud-internets-next-generation-hp-executive-says-120 (quoting HP CTO Russ Daniels).</p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p><em>See Generally</em>Jack Newton, <em>Putting Your Practice in the Cloud a Pre-Flight Checklist</em>, 73 Tex. B.J. 632 (2010).</p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p><em>See</em> Mark H. Wittow, Daniel J. Buller, <em>Cloud Computing: Emerging Legal Issues for Access to Data, Anywhere, Anytime,</em> 14 J. Internet L. 1 (2010).</p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li><li id='fn:4'>\n<p><em>Id.</em></p>\n<a href='#fnref:4' rev='footnote'>&#8617;</a></li><li id='fn:5'>\n<p>Wittow, 14 J. Internet L. 1 (2010).</p>\n<a href='#fnref:5' rev='footnote'>&#8617;</a></li><li id='fn:6'>\n<p>J. Nicholas Hoover, <em>Interop: Oracle Predicts Cloud Confusion to Continue</em>, InformationWeek, Sept. 17, 2008, http:// www.informationweek.com/news/services/hosted_apps/showArticle.jhtml? articlelD=210602225.</p>\n<a href='#fnref:6' rev='footnote'>&#8617;</a></li><li id='fn:7'>\n<p>Peter M. Lefkowitz, <em>Contracting in the Cloud: A Primer,</em> Boston B.J., Summer 2010, at 9.</p>\n<a href='#fnref:7' rev='footnote'>&#8617;</a></li><li id='fn:8'>\n<p>Dennis Kennedy, <em>Working in the Cloud Tips on Success with Online Software Services</em>, ABA J., August 2009, at 31.</p>\n<a href='#fnref:8' rev='footnote'>&#8617;</a></li><li id='fn:9'>\n<p><em>Id.</em></p>\n<a href='#fnref:9' rev='footnote'>&#8617;</a></li><li id='fn:10'>\n<p>Wittow, 14 J. Internet L. 1 (2010).</p>\n<a href='#fnref:10' rev='footnote'>&#8617;</a></li><li id='fn:11'>\n<p><em>Id.</em></p>\n<a href='#fnref:11' rev='footnote'>&#8617;</a></li><li id='fn:12'>\n<p>Peter Mell and Tim Grance, <em>Definition of Cloud Computing</em>, National Institute of Standards and Technology, Information Technology Laboratory, October 7, 2009, http://csrc.nist.gov/groups/SNS/cloud-computing/cloud-def-v15.doc.</p>\n<a href='#fnref:12' rev='footnote'>&#8617;</a></li><li id='fn:13'>\n<p>Lefkowitz, Boston B.J., Summer 2010, at 9.</p>\n<a href='#fnref:13' rev='footnote'>&#8617;</a></li><li id='fn:14'>\n<p><em>Id.</em></p>\n<a href='#fnref:14' rev='footnote'>&#8617;</a></li><li id='fn:15'>\n<p><em>Id.</em></p>\n<a href='#fnref:15' rev='footnote'>&#8617;</a></li><li id='fn:16'>\n<p><em>Id.</em></p>\n<a href='#fnref:16' rev='footnote'>&#8617;</a></li><li id='fn:17'>\n<p><em>Id.</em></p>\n<a href='#fnref:17' rev='footnote'>&#8617;</a></li><li id='fn:18'>\n<p>Newton, 73 Tex. B.J. 632.</p>\n<a href='#fnref:18' rev='footnote'>&#8617;</a></li><li id='fn:19'>\n<p>Cloud IT Services, Apps.Gov, https://www.apps.gov/cloud/advantage/cloud/category_home.do (last visited October 5, 2010).</p>\n<a href='#fnref:19' rev='footnote'>&#8617;</a></li><li id='fn:20'>\n<p>Apps.Gov Now, General Services Administration, <a href='http://citizen.apps.gov/'>http://citizen.apps.gov/</a> (last visited October 12, 2015).</p>\n<a href='#fnref:20' rev='footnote'>&#8617;</a></li><li id='fn:21'>\n<p>Cloud Services, Federal Business Opportunities, https://www.fbo.gov/index?s=opportunity&amp;mode=form&amp;id=d63c725d5a3006919289698350e3d4b3&amp;tab=core&amp;_cview=1 (last visited October 5, 2010); J. Nicholas Hoover, <em>Recovert.Gov Moved to Amazon Cloud</em>, Information Week, May 12, 2010, http://www.informationweek.com/news/government/cloud-saas/showArticle.jhtml?articleID=224701861.</p>\n<a href='#fnref:21' rev='footnote'>&#8617;</a></li><li id='fn:22'>\n<p>Federal Information Security Management Act of 2002.</p>\n<a href='#fnref:22' rev='footnote'>&#8617;</a></li><li id='fn:23'>\n<p>5 U.S.C.A. § 552a (West).</p>\n<a href='#fnref:23' rev='footnote'>&#8617;</a></li><li id='fn:24'>\n<p>Google Apps for Government, Official Google Enterprise Blog, July 26, 2010, http://googleenterprise.blogspot.com/2010/07/google-apps-for-government.html.</p>\n<a href='#fnref:24' rev='footnote'>&#8617;</a></li></ol></div>"}