{"author":"Benjamin J. Balter","title":"Will Federal Contracting Officers Soon Have Their Heads in the Clouds?\n","excerpt":"As one Hewlett Package Chief executive recently put it, cloud computing \"is the next generation of the internet.\" Whether you realize it or not, if you use services like Facebook or Gmail, your personal data already lives in \"the cloud,\" and the same transformative power that connects long-lost classmates at the click of a mouse can be harnessed by federal agencies to approach modern governance in incredibly powerful ways.\n","layout":"post","category":["Law","Technology"],"tags":["cloud computing","contracting","federal","government","procurement"],"post_format":[],"url":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds/","date":"2010-11-15 00:00:00 -0500","id":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds","categories":["posts"],"next":"In 593 A.D., the first printing press quietly spun into operation in China. Exactly 120 years later, the first paper, *Kaiyuan Za Bao*, began production in Beijing. [^1] In 2010, however, China's information landscape is best characterized not by innovation, but rather by tightly controlled government restriction, and no American corporation is more acutely aware of this austere reality than Internet giant Google. The company [recently released][2] a [white paper][3] calling out China, among others for violating WTO commitments and urged law makers to break down barriers to free trade and global e-commerce.\n\n![][4]\n\nThe argument is simple: As the internet is increasingly becoming the dominant instrument of industry, blocking access to information is tantamount to blocking access to trade.\n\nThe white paper elaborates:\n\n> The tremendous spread of the Internet – faster than the spread of any previous technology – has also created new, rapidly expanding markets. Online traffic has increased at a compound annual growth rate of 66 percent over the past five years. [^2] Today more than one-quarter of the world's population (1.7 billion people) uses this technology to communicate, inform, create, and buy and sell across borders. [^3] These 1.7 billion Internet users are a massive new consumer base for both Internet services like email and the hard goods and services that are increasingly advertised, marketed, or sold online…\n> \n> Annual internet-based commerce worldwide is expected to soon reach $1 trillion. [^4]In the United States alone, online retail sales were over $132 billion in 2008. [^5] Globally, Internet and telecom services contributed 3.3 percent of GDP in 2004, compared with 1.8 percent in 1990, with virtually every single economy enjoying growth in the sector. [^6]\n\nThe commercialization of the internet and subsequent clash with government restriction is nothing new. US-based information technology companies have been doing business in China with relative success for quite some time. Yahoo!, Inc. was the first to enter the fray in 1998, launching a Chinese-language version of its popular search engine to compete with China's domestic Internet content providers, and not long after, Microsoft and Google followed suit. [^7] However, in 2000, China's Ministry of Public Service began the Golden Shield Project with the goal of \"adopt[ing]… advanced information and communication technology to strengthen central police control, responsiveness, and crime combating capacity to improve the efficiency and effectiveness of police work. [^8]\"\n\n![][12]A prime example of such restriction came in Fall 2002, as Google employees were booting up their Mountain View, California computers to angry emails informing them that the search engine was entirely unavailable to Chinese citizens. [^9] Even when users could access Google.com, the Web site was slow, often cases, inoperably so when compared to Google's censored competitors. [^10] As Google's Senior Policy Council, Andrew McLaughlin, noted, \"Google.com appears to be down around 10 percent of the time,\" adding, \"[e]ven when users can reach it, the website is slow, and sometimes produces results that… stall out the user's browser. [^11]\"\n\nSo why do we care if a handful of countries do not enjoy unfettered access to American e-commerce? According to the China Internet Network Information Center, the Chinese market represents some 123 million Internet users. [^12] The Internet far surpassed television, newspapers, magazines, and radio as the primary source for information among the Chinese people. [^13] As a result, today, the People's Republic represents the largest emerging Internet market in the world. Baidu.com, for example, the Chinese-based search engine, enjoyed only 2.5% of the search market in 2003, but boasted 46% by 2005, while during that same time, Google's market share in China dropped some 30% and continued to fall. [^14]\n\nThe implications are clear. The fastest, most powerful commercial vehicle the world has ever seen is unavailable to its largest emerging market. To put it another way, countries that censor internet traffic are blocking the 21st century's busiest trade ports. It would be as if merchant ships in the 1500′s, full of goods from the New World, made their way back to Europe only to be turned away. Even in a post-dot-com-bubble world, with nearly ubiquitous free shipping, cyber Mondays, and an app store for everything from your phone to your toaster, it is not hard to imagine that the internet will soon become the dominant mechanism of international trade, if it has not earned such a title already. Today, one thing is certain: As the domestic e-commerce market reaches saturation, American firms will continue to seek out opportunities abroad despite censorship and restrictions. [^15] Their level of success, however, and the level of access available to users in the countries cited in the white paper, if any, remains to be seen.\n\n[Photos courtesy [stuckincustoms][20] and [winterkanal][21]]\n\nNotes:\n\n[^1]: Gardels, Nathan, *Google vs. Confucius*, 27 New Perspective Quarterly 2 (May 2010), at 2. [22]\n[^2]: Fed. Commc'ns Comm'n [FCC], Connecting America: The National Broadband Plan ch. 4 (2010). [23]\n[^3]: Miniwatts, [Internet World Stats, ][24]*[Internet World Users by Language: Top Ten Languages][24] *(chart) (Sept. 30, 2009); Int'l Telecomm. Union [ITU], [*The World in 2009: ICT Facts and Figures *1][25] (2009). The total number of fixed broadband subscribers reached nearly 500 million by the end of 2009. *Id. *at 5. [26]\n[^4]: Brian Hindley & Hosuk Lee-Makiyama, *[*Protectionism Online: Internet Censorship and International Trade Law*][27] *3 (ECIPE, Working Paper No. 12/2009). [28]\n[^5]: U.S. Census Bureau, *[Estimated Quarterly U.S. Retail Sales (Adjusted): Total and E-commerce (chart)][29]* (May 15, 2009). [30]\n[^6]: Int'l Telecomm. Union [ITU], [*digital.life: ITU Internet Report 2006*][31] 73 (2006). [32]\n[^7]: Marc D. Nawyn, *Code Red: Responding to the Moral Hazards Facing U.S. Information Technology Companies in China*, 2007 Colum. Bus. L. Rev. 505 (2007). [33]\n[^8]: Greg Walton, *[China's Golden Shield: Corporations and the Development of Surveillance Technology in the People's Republic of China][34]*, Rights & Democracy, 2001; *See* Jennifer Shyu, *Speak No Evil: Circumventing Chinese Censorship*, 45 San Diego L. Rev. 211, 249 (2008). [35]\n[^9]: Testimony of Google, Inc. before the Subcommittee on Asia and the Pacific, and the Subcommittee on Africa, Global Human Rights, and International Operations, Committee on International Relations, 207th Cong. (2006) (statement of Elliot Schrage, Vice President, Global Communications and Public Affairs, Google, Inc.). [36]\n[^10]: *Id.* [37]\n[^11]: [Google in China][38], Google Official Blog, January 27, 2006. [39]\n[^12]: Lindsay Eastwood, *\"Don't Be Evil\": Google Faces the Chinese Internet Market and the Global Online Freedom Act of 2007*, 9 Minn. J.L. Sci. & Tech. 287, 288 (2008) (citing China Internet Network Info. Ctr., [18th Statistical Survey Report on the Internet Development in China][40], 3 (2006). [41]\n[^13]: *Id.* at n. 30 (stating \"the main channel that obtain information are the Internet (82.6%), television (64.5%), papers (57.9%), magazines (18.8%), books (18.7%), radio (14.4%), and other (6.9%)\") (internal quotations omitted). [42]\n[^14]: *Id.* [43]\n[^15]: *E.g.,* Google's decision to enter China, and subsequently censor search results, was primarily based on the premise that it was the lesser of two evils. Google CEO Eric Schmidt commented, \"although we weren't wild about the restrictions, it was even worse to not try to serve those users at all,\" elaborating, \"we actually did an evil scale and decided not to serve at all was worse evil.\" Shyu, *Supra* note 8 at 213 (citing Danny Sullivan, *[Google Created EvilRank Scale To Decide On Chinese Censorship][44]*, Search Engine Watch, January 30, 2006. Accordingly, Google launched Google.cn under the belief that the \"benefits of increased access to information for people in China… outweighed [the] discomfort… [of] agreeing to censor some results,\" ([*A New Approach to China*][45], Official Google Blog, January 12, 2010) calling their service a \"a meaningful – though imperfect – contribution to the overall expansion of… information in China.\" Press Release, Google, Inc., [*Google to Open Research Center in China*][46] (July 19, 2005). [47]\n\n [1]: #note-2020-1 \"Gardels, Nathan, Google vs. Confucius, 27 New Perspective Quarterly 2 (May 2010), at 2.\"\n [2]: http://googlepublicpolicy.blogspot.com/2010/11/promoting-free-trade-for-internet.html\n [3]: http://www.google.com/googleblogs/pdfs/trade_free_flow_of_information.pdf\n [4]: http://cdn.benbalter.com/wp-content/uploads/2010/11/1194563275_664d6b15e2_b.jpg \"Great Wall of China\"\n [5]: #note-2020-2 \"Fed. Commc'ns Comm'n [FCC], Connecting America: The National Broadband Plan ch. 4 (2010).\"\n [6]: #note-2020-3 \"Miniwatts, Internet World Stats, Internet World Users by Language: Top Ten Languages (chart) (Sept. 30, 2009); Int'l Telecomm. Union [ITU], The World in 2009: ICT Facts and Figures 1 (2009). The total number of fixed broadband subscribers reached nearly 500 million by the end of 2009. Id. at 5.\"\n [7]: #note-2020-4 \"Brian Hindley & Hosuk Lee-Makiyama, Protectionism Online: Internet Censorship and International Trade Law 3 (ECIPE, Working Paper No. 12/2009).\"\n [8]: #note-2020-5 \"U.S. Census Bureau, Estimated Quarterly U.S. Retail Sales (Adjusted): Total and E-commerce (chart) (May 15, 2009).\"\n [9]: #note-2020-6 \"Int'l Telecomm. Union [ITU], digital.life: ITU Internet Report 2006 73 (2006).\"\n [10]: #note-2020-7 \"Marc D. Nawyn, Code Red: Responding to the Moral Hazards Facing U.S. Information Technology Companies in China, 2007 Colum. Bus. L. Rev. 505 (2007).\"\n [11]: #note-2020-8 \"Greg Walton, China's Golden Shield: Corporations and the Development of Surveillance Technology in the People's Republic of China, Rights & Democracy, 2001; See Jennifer Shyu, Speak No Evil: Circumventing Chinese Censorship, 45 San Diego L. Rev. 211, 249 (2008).\"\n [12]: http://cdn.benbalter.com/wp-content/uploads/2010/11/4273568581_3c4db9799d_z-300x238.jpg \"Google.cn by Candlelight\"\n [13]: #note-2020-9 \"Testimony of Google, Inc. before the Subcommittee on Asia and the Pacific, and the Subcommittee on Africa, Global Human Rights, and International Operations, Committee on International Relations, 207th Cong. (2006) (statement of Elliot Schrage, Vice President, Global Communications and Public Affairs, Google, Inc.).\"\n [14]: #note-2020-10 \"Id.\"\n [15]: #note-2020-11 \"Google in China, Google Official Blog, January 27, 2006.\"\n [16]: #note-2020-12 \"Lindsay Eastwood, \"Don't Be Evil\": Google Faces the Chinese Internet Market and the Global Online Freedom Act of 2007, 9 Minn. J.L. Sci. & Tech. 287, 288 (2008) (citing China Internet Network Info. Ctr., 18th Statistical Survey Report on the Internet Development in China, 3 (2006).\"\n [17]: #note-2020-13 \"Id. at n. 30 (stating \"the main channel that obtain information are the Internet (82.6%), television (64.5%), papers (57.9%), magazines (18.8%), books (18.7%), radio (14.4%), and other (6.9%)\") (internal quotations omitted).\"\n [18]: #note-2020-14 \"Id.\"\n [19]: #note-2020-15 \"E.g., Google's decision to enter China, and subsequently censor search results, was primarily based on the premise that it was the lesser of two evils. Google CEO Eric Schmidt commented, \"although we weren't wild about the restrictions, it was even worse to not try to serve those users at all,\" elaborating, \"we actually did an evil scale and decided not to serve at all was worse evil.\" Shyu, Supra note 8 at 213 (citing Danny Sullivan, Google Created EvilRank Scale To Decide On Chinese Censorship, Search Engine Watch, January 30, 2006. Accordingly, Google launched Google.cn under the belief that the \"benefits of increased access to information for people in China… outweighed [the] discomfort… [of] agreeing to censor some results,\" (A New Approach to China, Official Google Blog, January 12, 2010)  calling their service a \"a meaningful – though imperfect – contribution to the overall expansion of… information in China.\" Press Release, Google, Inc., Google to Open Research Center in China (July 19, 2005).\"\n [20]: http://www.flickr.com/photos/stuckincustoms/1194563275/\n [21]: http://www.flickr.com/photos/winterkanal/4273568581/\n \n \n [24]: http://www.internetworldstats.com/stats7.htm\n [25]: http://www.itu.int/ITU-D/ict/material/Telecom09_flyer.pdf\n \n [27]: http://ecipe.org/publications/ecipe-working-papers/protectionism-online- internet-censorship-and-international-trade-law\n \n [29]: http://www.census.gov/mrts/www/data/html/09Q1table3.html\n \n [31]: http://www.itu.int/osg/spu/publications/digitalife/docs/digital-life-web.pdf\n \n \n [34]: http:// www.ichrdd.ca/english/commdoc/publications/globalization/goldenShieldEng.html\n \n \n \n [38]: http://Googleblog.blogspot.com/2006/01/Google-in-china.html\n \n [40]: http://cnnic.cn/download/2006/18threport-en.pdf\n \n \n \n [44]: http://blog.searchenginewatch.com/blog/060130-154414\n [45]: http://Googleblog.blogspot.com/2010/01/new-approach-to-china.html\n [46]: http://www.Google.com/press/pressrel/rd_china.html","previous":"<p><img alt='Apple Pie Courtesy belochkavita' src='http://cdn.benbalter.com/wp-content/uploads/2010/11/244921874_44ec1cbfa9-292x300.jpg' />Last week writer Monica Gaudio <a href='http://illadore.livejournal.com/30674.html'>received an e-mail from a friend</a> congratulating her on getting an article published in the Northeast-regional cooking magazine <a href='http://cookssource.com'>Cooks Source</a>. There was only one problem — she didn&#8217;t. The article, a recipe for fourteen-century apple pie, was lifted, word-for-word, from <a href='http://godecookery.com/twotarts/twotarts.html'>Gaudio&#8217;s Web site</a>. After an e-mail back-and-forth in which Gaudio asked for an apology, a copy of the magazine, and a $130 donation to the Columbia Journalism School, Cooks <a href='http://illadore.livejournal.com/30674.html'>Source Editor Judith Griggs noted</a>:</p>\n\n<blockquote>\n<p>&#8220;…the web is considered &#8220;public domain&#8221; and you should be happy we just didn&#8217;t &#8220;lift&#8221; your whole article and put someone else&#8217;s name on it! It happens a lot, clearly more than you are aware of, especially on college campuses, and the workplace.&#8221;</p>\n</blockquote>\n\n<p>A quick search on WestLaw reveals that the &#8221;<a href='http://www.edrants.com/the-cooks-source-scandal-how-a-magazine-profits-on-theft/'>[w]ell, it was on the Internet</a>&#8221; defense is not recognized as a valid defense to copyright infringement in any American court of jurisprudence. It turns out, anything on the internet has the same copyright protections as its physical analog.<sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> So long as the work is fixed, original, and creative, it is subject to copyright protections.<sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> This remains true whether or not a conspicuous copyright notice is present or the work is registered with the copyright office <sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup>.</p>\n\n<p>After several <a href='http://gawker.com/5681770/magazine-editor-steals-article-tells-writer-you-should-compensate-me?skyline=true&amp;s=i'>major</a> <a href='http://gizmodo.com/5681714/attention-the-web-is-not-public-domain'>blogs</a> got whiff of the story, and not long after, <a href='http://newsfeed.time.com/2010/11/05/exclusive-cooks-source-writer-marvels-at-the-nerd-rage-keeps-waiting-for-that-apology/'>Time</a>, <a href='http://articles.cnn.com/2010-11-05/tech/cooks.source.plagiarism_1_internet-twitter-web?_s=PM:TECH'>CNN</a>, <a href='http://mediadecoder.blogs.nytimes.com/2010/11/04/a-social-media-firestorm-about-apple-pies/'>The New York Times</a>, <a href='http://voices.washingtonpost.com/blog-post/2010/11/cooks_source_magazine_an_onlin.html'>The Washington Post</a>, <a href='http://www.wired.com/threatlevel/2010/11/web-decries-infringement/'>Wired</a>, <a href='http://mashable.com/2010/11/06/cooks-source/'>Mashable</a> and <a href='http://technolog.msnbc.msn.com/_news/2010/11/05/5416008-exclusive-cooks-source-kicks-hornets-nest-wronged-writer-responds'>MSNBC</a>, faceless internet millions began scouring the Web for proof supporting the <a href='http://www.facebook.com/topic.php?uid=196994196748&amp;topic=23238'>accusations</a> that Cooks Source had previously done the same – <a href='https://spreadsheets.google.com/ccc?key=0AmTaIPHPnkSedGFhbHo1d1FIR2oxNWJLaDZLeXhEVEE&amp;hl=en#gid=0'>160 recipes, pictures, and stories</a> so far to be exact. The July 2010 issue alone, for example, had <a href='http://www.foodnetwork.com/recipes/chicken-chopped-mediterranean-salad-with-feta-vinaigrette-recipe/index.html'>Chicken Chopped Mediterranean Salad with Feta Vinaigrette</a>, <a href='http://www.foodnetwork.com/recipes/blackberry-lemonade-recipe/index.html'>Blackberry Lemonade</a>, <a href='http://www.foodnetwork.com/recipes/giada-de-laurentiis/mixed-berry-soup-with-gelato-recipe/index.html'>Mixed Berry Soup</a>, <a href='http://www.foodnetwork.com/recipes/tyler-florence/fresh-mozzarella-blt-with-pesto-recipe/index.html'>Fresh Mozzarella BLT with Pesto</a>, <a href='http://www.foodnetwork.com/recipes/alton-brown/best-burger-ever-recipe/index.html'>Alton Brown&#8217;s Best Burger</a>, <a href='http://www.foodnetwork.com/recipes/napa-valley-basil-smoked-burgers-recipe/index.html'>Napa Valley Basil-Smoked Burgers</a>, and <a href='http://www.foodnetwork.com/recipes/food-network-challenge/feta-sun-dried-tomato-stuffed-prosciutto-burgers-recipe/index.html'>Jairs Burgers</a>, all lifted with limited modification from the Food Network Web site.<sup id='fnref:4'><a href='#fn:4' rel='footnote'>4</a></sup></p>\n\n<p>While it may be true that in a world where CTRL-C and CTRL-V (or Command for Mac users and &#8221;<a href='http://en.wikipedia.org/wiki/Command_key'>Open Apple</a>&#8221; for really old Mac users) are literally right in front of us, attribution and proper citation may not be at the forefront of content producers (or copiers) minds, the Cooks Source blowback shows unequivocally that the Internet takes care of its own.</p>\n\n<p>The unfortunate incident spawned the ever-venerable <a href='http://en.wikipedia.org/wiki/Meme'>meme</a>. Cooks Source has become the brunt of every <a href='http://twitter.com/search?q=%23ButHonestlyMonica'>#ButHonestlyMonica</a> joke on Twitter, and they have even joined the exclusive ranks of those with satirical Twitter handles, @CooksSource and @JudithGriggs. Every few minutes yet another heckler chimes in on <a href='http://www.facebook.com/pages/Cooks-Source-Magazine/196994196748'>the Cooks Source Facebook Page</a> and as inevitably is the case, one malcontent even went so far as to produce a YouTube video <a href='http://www.youtube.com/watch?v=YC-tVHLM99w'>comparing Cooks Source to Nazis</a>.<sup id='fnref:5'><a href='#fn:5' rel='footnote'>5</a></sup></p>\n\n<p>The story, illustrating the true mob-power of the Internet, might be even more interesting if it turns out Cooks Source <a href='http://www.copyright.gov/fls/fl122.html'>isn&#8217;t in the wrong</a> after all or that the e-mails were actually <a href='http://www.psychologytoday.com/blog/you-20/201011/are-cooks-source-magazine-and-judith-griggs-innocent'>made up</a>. So what if Cooks Source has <a href='http://www.masslive.com/news/index.ssf/2010/11/sunderland-based_magazine_cook.html'>lost advertisers</a> and so what if Cooks Source Editor Judith Griggs name has been <a href='http://www.google.com/search?q=Judith+Griggs+Cooks+Source'>forever digi-tarnished</a>. The important thing is that internet justice has been served.<sup id='fnref:6'><a href='#fn:6' rel='footnote'>6</a></sup> It is all too easy to forget that despite its incredible power to democratize and decentralize knowledge, the Web, at it&#8217;s 3:00 am core, is an echo chamber in which rumors reverberate louder than they would in even the most gossip-centric high school cafeteria — and the worst part is, here, the AV club kids are the bullies. So foodies, aspiring journalists, and internet memesters, copy judiciously, cite liberally,<sup id='fnref:7'><a href='#fn:7' rel='footnote'>7</a></sup> and <a href='http://ben.balter.com/contact/'>hire a good lawyer</a>.</p>\n\n<p><em>Ed. Note: Journalism students, please make sure to pay attention in your media law class. Miss one lecture and this is what happens. On second thought, don&#8217;t go. The legal economy <a href='http://online.wsj.com/article/SB10001424052748704866204575224350917718446.html'>is</a> <a href='http://www.washingtonpost.com/wp-dyn/content/article/2010/10/30/AR2010103004638.html?nav=hcmoduletmv'>bad</a> <a href='http://www.nytimes.com/2009/08/26/business/26lawyers.html?_r=1'>enough</a> as it is — we need all the lawsuits we can get.</em></p>\n\n<p><strong>Update (11/11):</strong> Final score: Internet, 1, Cooks Source, 0. It appears the Internet has beaten Cooks Source into submission. Cooks Source has sworn to never &#8220;be on Facebook again,&#8221; canceling its Facebook account and <a href='http://www.cookssource.com/'>taking down its Web site</a>, after <a href='http://www.facebook.com/photo.php?fbid=159332990768717&amp;set=a.159072834128066.23501.159072764128073'>hackers gained access</a>.<sup id='fnref:8'><a href='#fn:8' rel='footnote'>8</a></sup> Ironically, Cooks Source claims that their intellectual property rights were violated when <a href='http://www.facebook.com/album.php?aid=23582&amp;id=159072764128073'>copies of their most-recent issue</a> were posted online.<sup id='fnref:9'><a href='#fn:9' rel='footnote'>9</a></sup> They have made the donation Gaudio requested to the Columbia School of Journalism, as well as a contribution to a local food bank, also in her name <span>11</span>. Moral of the story? Whatever you do, <a href='http://www.facebook.com/photo.php?fbid=159300057438677&amp;set=a.159072834128066.23501.159072764128073&amp;pid=241073&amp;id=159072764128073'>don&#8217;t post statements in Comic Sans.</a></p>\n\n<p><em>[Photo used under Creative Commons License courtesy</em><em><a href='http://www.flickr.com/photos/belochkavita/244921874/'>belochkavita</a></em><em>]</em></p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>17 USC § 102 (allowing for communication of works &#8220;with the aid of a machine or device&#8221;).</p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p><em>Feist Publications, Inc. vs. Rural Telephone Service Co.</em>, 499 U.S. 340 (1991) (establishing a three-part test for copyright protection).</p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p><a href='http://www.copyright.gov/circs/circ1.pdf'><em>Copyright Basics</em></a>. U.S. Copyright Office (July 2008) (noting that for works created after the 1988 ratification of the <a href='http://en.wikipedia.org/wiki/Berne_Convention_for_the_Protection_of_Literary_and_Artistic_Works'>Berne Convention</a>, copyright is assumed, thus neither notice nor registration is required to invoke protections).</p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li><li id='fn:4'>\n<p>Edward Champion, <a href='http://www.edrants.com/the-cooks-source-scandal-how-a-magazine-profits-on-theft/'>The Cooks Source Scandal: How a Magazine Profits on Theft</a>.</p>\n<a href='#fnref:4' rev='footnote'>&#8617;</a></li><li id='fn:5'>\n<p><em>See generally</em><a href='http://en.wikipedia.org/wiki/Godwin&apos;s_law'>Goodwin&#8217;s Law</a>.</p>\n<a href='#fnref:5' rev='footnote'>&#8617;</a></li><li id='fn:6'>\n<p>Internet Justice (<em>n.</em>) – a form of justice only slightly less barbaric than the <a href='http://www.youtube.com/watch?v=3hQC3nkftrk'>Thunderdome</a>.</p>\n<a href='#fnref:6' rev='footnote'>&#8617;</a></li><li id='fn:7'>\n<p><em>See generally supra notes</em> 1-7.</p>\n<a href='#fnref:7' rev='footnote'>&#8617;</a></li><li id='fn:8'>\n<p><a href='http://www.cookssource.com/'>Cooks Source Web site</a> (<em>Last accessed:</em>November 11, 2010).</p>\n<a href='#fnref:8' rev='footnote'>&#8617;</a></li><li id='fn:9'>\n<p><em>Id.</em></p>\n<a href='#fnref:9' rev='footnote'>&#8617;</a></li></ol></div>","content":"<h2 id='a_brief_look_at_the_imminent_cloudcomputing_storm_front'>A Brief Look at the Imminent Cloud-Computing Storm Front</h2>\n\n<p>As one Hewlett-Packard chief executive recently put it, cloud computing &#8220;is the next generation of the internet.&#8221; <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> Whether you realize it or not, if you use services like Facebook or Gmail, your personal data already lives in &#8220;the cloud,&#8221; and the same transformative power that connects long-lost classmates at the click of a mouse can be harnessed by federal agencies to approach modern governance in incredibly powerful ways.</p>\n\n<p><strong>What is Cloud Computing?</strong></p>\n\n<p>Traditionally, when one thinks of computing power, he or she thinks of an on-site datacenter — a room filled with blinking lights and whirling fans — hardware, software, and data storage all within feet of the users they serve. <sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> The traditional approach to computing generally entails complicated and expensive upgrade procedures scheduled on a semi-regular basis, as well as accommodating the increasing demand for backup and recovery redundancy necessary to reduce downtime should these system fails. <sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup> Such datacenters are often managed by their own departments, staffed with the specialized, technical administrators needed to maintain and ensure the day-to-day operation of these increasingly complex and increasingly mission-critical business resources. <sup id='fnref:4'><a href='#fn:4' rel='footnote'>4</a></sup></p>\n\n<p>Seen as a virtually unlimited hardware and communications infrastructure managed by a third party-provider, cloud computing, on the other hand, allows for rapid increases in capacity without the need to invest in additional hardware, personnel, or software licensing. <sup id='fnref:5'><a href='#fn:5' rel='footnote'>5</a></sup> &#8220;As a customer, you don&#8217;t know where the resources are, and for the most part, you don&#8217;t care. What&#8217;s really important is the capability to access your application anywhere, move it freely and easily, and inexpensively add resources.&#8221; <sup id='fnref:6'><a href='#fn:6' rel='footnote'>6</a></sup> In simplest terms, the cloud uses an off-site service to store, transmit, and process information, and employs the Internet as the means to access that service. <sup id='fnref:7'><a href='#fn:7' rel='footnote'>7</a></sup></p>\n\n<p><strong>How Cloud Computing Came About</strong></p>\n\n<p>Several innovations fueled the shift toward computing in the cloud. First, the rise and adoption of both broadband Internet access, which allowed for reduced load times, and a programming technique known as AJAX, which allowed Web sites to look and feel more like desktop programs through a constant push-and-pull of information, combined to usher in a greater reliance on remote applications. <sup id='fnref:8'><a href='#fn:8' rel='footnote'>8</a></sup> At the same time the growth of enterprise data centers, and the public&#8217;s increasing comfort with Web 2.0 services like GMail and Facebook provided a technical and social infrastructure to support such a push. <sup id='fnref:9'><a href='#fn:9' rel='footnote'>9</a></sup></p>\n\n<p>The biggest breakthrough, however, the core and true power behind cloud computing, came from the consolidation of physical servers through system virtualization. Through virtualization, one physical server can become the host to many virtual servers. <sup id='fnref:10'><a href='#fn:10' rel='footnote'>10</a></sup> Because the resources are dynamically allocated across physical servers as the virtual servers require them, the physical resources are used more efficiently. <sup id='fnref:11'><a href='#fn:11' rel='footnote'>11</a></sup> If server <em>A</em>, say an e-mail server like one may see in most corporate or government offices sees a sudden spike in activity, rather than slowing, it can borrow resources from server <em>B</em>, a Web site hosted on the same physical server. The user, unaware that this shift has even occurred, sees the two servers as discrete and unconnected despite their physical location.</p>\n\n<p>The biggest implication however, is that computing resources can be provisioned and released on demand and as needed. <sup id='fnref:12'><a href='#fn:12' rel='footnote'>12</a></sup> If agency <em>X</em> is a government agency that requires a great deal of information to be processed at the close of the stock market each day, it can pay for five servers up until 3:59 each day, be charged solely for the increased processing power and storage it requires from 4:00 to 4:05, and can return to five server for the remainder of the day. Under a traditional approach, all 100 servers, for example, it required at its peak, would have to be operational 24 hours a day, with the necessary personnel and infrastructure to support it.</p>\n\n<p><strong>Types of Cloud Computing</strong></p>\n\n<p>Cloud computing exists in several forms today. The most basic, &#8220;infrastructure as a service&#8221; (IAAS), uses shared facilities, hardware, and networks to hold and move data. Customers, given virtual servers, may then install, configure, and utilize their own software freely. <sup id='fnref:13'><a href='#fn:13' rel='footnote'>13</a></sup> As indicated above, however, customers do not rent the physical servers (merely their equivalent processing power), and providers may move virtual servers between physical servers as necessary. <sup id='fnref:14'><a href='#fn:14' rel='footnote'>14</a></sup> Amazon&#8217;s EC2, S3, and CloudFront are prime examples of cloud computing, storage, and delivery respectively.</p>\n\n<p>Second, and slightly more advanced, &#8220;platform as a service&#8221; (PAAS) allows providers to serve customers with a shared computing platform and software environment. The customer can upload software code in a predetermined programming language (such as Java or PHP) and the provider executes that code and returns the result. <sup id='fnref:15'><a href='#fn:15' rel='footnote'>15</a></sup> Google Apps Engine is a prime example of such an arrangement.</p>\n\n<p>Finally, &#8220;software as a service&#8221; (SAAS) is most associated with Web-based consumer services such as Facebook or Flickr but can find application in business and government environments as well. The provider hosts software designed to perform a specific function, such as social networking or photo sharing, and the user interacts with that application being run on the provider&#8217;s server. <sup id='fnref:16'><a href='#fn:16' rel='footnote'>16</a></sup></p>\n\n<p>One additional distinction among cloud services can be made. Each of the three approaches listed above can be hosted in either a public cloud, meaning one customer&#8217;s virtual servers may be freely intermingled with another customer&#8217;s among physical servers, or in a private cloud in which the physical servers, infrastructure, or datacenter may be entirely segregated from those used to provide services to other clients. <sup id='fnref:17'><a href='#fn:17' rel='footnote'>17</a></sup></p>\n\n<p><strong>Implications of Cloud Computing</strong></p>\n\n<p>Cloud computing has several implication for members of the government contracting community. First, inherent in the nature of cloud computing is the fact that one organization must trust a third party with its data, something which may have far-reaching ethical and legal implication depending on the type of data stored and the parties involved.</p>\n\n<p>More broadly, when contracting for cloud services, organizations have several technical aspects to take into account. From a security standpoint, customers should evaluate data encryption (can others access my data?), physical security (can others access the datacenter?), and provider viability (will the service be around in ten years?). From a data integrity standpoint, those looking to enter the cloud should inquire as to data locality (is my data being hosted outside the United States?), data portability (what happens if I want to leave the service?), and redundancy (what happens if there is a natural disaster near their data center?). Finally, from a legal perspective, customers should evaluate terms of service, privacy policies, and service level (uptime) agreements. <sup id='fnref:18'><a href='#fn:18' rel='footnote'>18</a></sup></p>\n\n<p><strong>How to Get Into the Cloud</strong></p>\n\n<p>Several avenues exist for organizations looking to experiment with the cloud. For federal agencies, the General Service Administration, through Apps.gov, will soon be rolling out a Federal private cloud. While the specifics have not yet been announced, this service is expected to provide federal agencies with storage, virtual machine, and Web hosting services at a relatively low cost. <sup id='fnref:19'><a href='#fn:19' rel='footnote'>19</a></sup> Some of this service&#8217;s potential has already been hinted at by the recent launch of Apps.Gov NOW, a hosted service that provides federal agencies with out-of-the-box blogs (Web site publishing platforms), Wikis (Web sites editable by members of a community), and online bulletin boards (Web sites to facilitate online discussions), all at no cost. <sup id='fnref:20'><a href='#fn:20' rel='footnote'>20</a></sup></p>\n\n<p>Second, many federal Web sites such as the Federal Communications Commission and Recovery.Gov are in the process of seeking or have already sought third-party cloud hosting services likes Amazon Web Services (AWS) as mentioned above. <sup id='fnref:21'><a href='#fn:21' rel='footnote'>21</a></sup> Federal agencies opting for such a route must be sure to work closely with the appropriate parties to ensure, federal IT security standards are met, such as FISMA <sup id='fnref:22'><a href='#fn:22' rel='footnote'>22</a></sup> requirements, or that record retention standards are met, for example, where data stored in the cloud constitutes a system of records under the privacy act. <sup id='fnref:23'><a href='#fn:23' rel='footnote'>23</a></sup></p>\n\n<p>Finally, earlier this summer, Google announced FISMA moderate certification of its Google Apps for Government data centers, providing mail, calendar, document, video, and Web hosting services to Federal agencies in a private cloud hosted entirely within the United States. <sup id='fnref:24'><a href='#fn:24' rel='footnote'>24</a></sup> Agencies wishing to contract their traditional IT infrastructure out to Google can do so for as low as $50 per user per year, however, such savings may come at a cost. Special attention must be paid to the risks associated with trusting a third-party with what may potentially be an agency&#8217;s most sensitive data.</p>\n\n<p>Whether a federal contracting officer or a provider of IT services, just as the Internet has revolutionized countless aspects of every day life, it is clear that so too will the emerging cloud computing front forever shape the contours of Federal IT procurement in the years to come.</p>\n\n<p><em>This article originally published in the <a href='http://www.fedbar.org/Sections/Government-Contracts-Section/Newsletters.aspx'>Federal Bar Association Government Contracts Section</a> <a href='http://www.fedbar.org/Sections/Government-Contracts-Section/Newsletters/Fall-2010.aspx?FT=.pdf'>Fall 2010 Newsletter</a> (PDF, p. 6).&lt;/p&gt; Notes:</em></p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>Stephen Lawson, <em>Cloud is Internet&#8217;s Next Generation, HP Executive Says</em>, InfoWorld, June 25, 2009, http://www.infoworld.com/d/cloud-computing/cloud-internets-next-generation-hp-executive-says-120 (quoting HP CTO Russ Daniels). <span>27</span></p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p><em>See Generally</em>Jack Newton, <em>Putting Your Practice in the Cloud a Pre-Flight Checklist</em>, 73 Tex. B.J. 632 (2010). <span>28</span></p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p><em>See</em> Mark H. Wittow, Daniel J. Buller, <em>Cloud Computing: Emerging Legal Issues for Access to Data, Anywhere, Anytime,</em> 14 J. Internet L. 1 (2010). <span>29</span></p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li><li id='fn:4'>\n<p><em>Id.</em> <span>30</span></p>\n<a href='#fnref:4' rev='footnote'>&#8617;</a></li><li id='fn:5'>\n<p>Wittow, 14 J. Internet L. 1 (2010). <span>31</span></p>\n<a href='#fnref:5' rev='footnote'>&#8617;</a></li><li id='fn:6'>\n<p>J. Nicholas Hoover, <em>Interop: Oracle Predicts Cloud Confusion to Continue</em>, InformationWeek, Sept. 17, 2008, http:// www.informationweek.com/news/services/hosted_apps/showArticle.jhtml? articlelD=210602225. <span>32</span></p>\n<a href='#fnref:6' rev='footnote'>&#8617;</a></li><li id='fn:7'>\n<p>Peter M. Lefkowitz, <em>Contracting in the Cloud: A Primer,</em> Boston B.J., Summer 2010, at 9. <span>33</span></p>\n<a href='#fnref:7' rev='footnote'>&#8617;</a></li><li id='fn:8'>\n<p>Dennis Kennedy, <em>Working in the Cloud Tips on Success with Online Software Services</em>, ABA J., August 2009, at 31. <span>34</span></p>\n<a href='#fnref:8' rev='footnote'>&#8617;</a></li><li id='fn:9'>\n<p><em>Id.</em> <span>35</span></p>\n<a href='#fnref:9' rev='footnote'>&#8617;</a></li><li id='fn:10'>\n<p>Wittow, 14 J. Internet L. 1 (2010). <span>36</span></p>\n<a href='#fnref:10' rev='footnote'>&#8617;</a></li><li id='fn:11'>\n<p><em>Id.</em> <span>37</span></p>\n<a href='#fnref:11' rev='footnote'>&#8617;</a></li><li id='fn:12'>\n<p>Peter Mell and Tim Grance, <em>Definition of Cloud Computing</em>, National Institute of Standards and Technology, Information Technology Laboratory, October 7, 2009, http://csrc.nist.gov/groups/SNS/cloud-computing/cloud-def-v15.doc. <span>38</span></p>\n<a href='#fnref:12' rev='footnote'>&#8617;</a></li><li id='fn:13'>\n<p>Lefkowitz, Boston B.J., Summer 2010, at 9. <span>39</span></p>\n<a href='#fnref:13' rev='footnote'>&#8617;</a></li><li id='fn:14'>\n<p><em>Id.</em> <span>40</span></p>\n<a href='#fnref:14' rev='footnote'>&#8617;</a></li><li id='fn:15'>\n<p><em>Id.</em> <span>41</span></p>\n<a href='#fnref:15' rev='footnote'>&#8617;</a></li><li id='fn:16'>\n<p><em>Id.</em> <span>42</span></p>\n<a href='#fnref:16' rev='footnote'>&#8617;</a></li><li id='fn:17'>\n<p><em>Id.</em> <span>43</span></p>\n<a href='#fnref:17' rev='footnote'>&#8617;</a></li><li id='fn:18'>\n<p>Newton, 73 Tex. B.J. 632. <span>44</span></p>\n<a href='#fnref:18' rev='footnote'>&#8617;</a></li><li id='fn:19'>\n<p>Cloud IT Services, Apps.Gov, https://www.apps.gov/cloud/advantage/cloud/category_home.do (last visited* <em>October 5, 2010). <span>45</span></em></p>\n<a href='#fnref:19' rev='footnote'>&#8617;</a></li><li id='fn:20'>\n<p>Apps.Gov Now, General Services Administration, <a href='http://citizen.apps.gov/'>http://citizen.apps.gov/</a> (last visited October 12, 2015). <span>46</span></p>\n<a href='#fnref:20' rev='footnote'>&#8617;</a></li><li id='fn:21'>\n<p>Cloud Services, Federal Business Opportunities, https://www.fbo.gov/index?s=opportunity&amp;mode=form&amp;id=d63c725d5a3006919289698350e3d4b3&amp;tab=core&amp;_cview=1 (last visited October 5, 2010); J. Nicholas Hoover, <em>Recovert.Gov Moved to Amazon Cloud</em>, Information Week, May 12, 2010, http://www.informationweek.com/news/government/cloud-saas/showArticle.jhtml?articleID=224701861. <span>47</span></p>\n<a href='#fnref:21' rev='footnote'>&#8617;</a></li><li id='fn:22'>\n<p>Federal Information Security Management Act of 2002. <span>48</span></p>\n<a href='#fnref:22' rev='footnote'>&#8617;</a></li><li id='fn:23'>\n<p>5 U.S.C.A. § 552a (West). <span>49</span></p>\n<a href='#fnref:23' rev='footnote'>&#8617;</a></li><li id='fn:24'>\n<p>Google Apps for Government, Official Google Enterprise Blog, July 26, 2010, http://googleenterprise.blogspot.com/2010/07/google-apps-for-government.html. <span>50</span></p>\n<a href='#fnref:24' rev='footnote'>&#8617;</a></li></ol></div>"}