{"title":"About","excerpt":"Ben Balter is a gov 2.0 evangelist working to hack federal government from the inside out, an open-source developer passionate about the disruptive power of technology, and a J.D./M.B.A. candidate at the George Washington University.","layout":"page","permalink":"/about/","published":true,"id":"/about","related_posts":[],"url":"/about/","content":"<p><img alt='Ben Balter' class='alignright' src='http://cdn.benbalter.com/wp-content/uploads/2010/09/fb1-272x300.jpg' /></p>\n\n<p>Ben Balter is a gov 2.0 evangelist working to hack federal government from the inside out, a <a href='http://github.com/home'>GitHubber</a> making government better, one repo at a time, and an aspiring attorney passionate about the disruptive potential of technology.</p>\n\n<p>Described by the US Chief Technology Officer as &#8220;the baddest of the badass innovators,&#8221; and by the White House Director of Digital Strategy as &#8221;<a href='http://www.youtube.com/watch?v=uhtlOYOhE8w#t=51m12s'>lightning in a bottle</a>,&#8221; Ben was a member of the inaugural class of Presidential Innovation Fellows where he served as entrepreneur in residence reimagining the role of technology in brokering the relationship between citizens and government.</p>\n\n<p>Before that he was a Fellow in the Office of the US Chief Information Officer within the Executive Office of the President where he was instrumental in drafting the President&#8217;s Digital Strategy, on the SoftWare Automation and Technology (SWAT) Team, the White House’s first and only agile development team, and as a <a href='http://reboot.fcc.gov/blog/?authorId=593709'>New Media Fellow</a>, in the Federal Communications Commission&#8217;s Office of the Managing Director where he played a central role in shaping the agency&#8217;s reimagined web presence. His paper, <a href='http://ben.balter.com/2011/11/29/towards-a-more-agile-government/'>Towards a More Agile Government</a> was published in the Public Contract Law Journal, arguing that Federal IT Procurement should be more amenable to modern, agile development methods.</p>\n\n<p>When not working or in class, he enjoys tackling otherwise-impossible challenges to sharing information using nothing more than duct tape and occasionally a pack of bubblegum.</p>\n\n<p>Feel free to e-mail me at <a href='mailto:ben@balter.com'>Ben@Balter.com</a> or you can find me on these social networks:</p>\n<ul id='contact-links'>\n  <li><a href='http://twitter.com/BenBalter' rel='me' target='_blank'><img alt='Twitter Icon' src='http://cdn.benbalter.com/wp-content/uploads/2010/09/twitter.png' /><br />\n  Twitter</a></li>\n  <li><a href='http://facebook.com/BenBalter' rel='me' target='_blank'><img alt='Facebook Icon' src='http://cdn.benbalter.com/wp-content/uploads/2010/09/facebook.png' /><br />\n  Facebook</a></li>\n  <li><a href='http://linkedin.com/in/BenBalter' rel='me' target='_blank'><img alt='LinkedIn Icon' src='http://cdn.benbalter.com/wp-content/uploads/2010/09/linkedin.png' /><br />\n  LinkedIn</a></li>\n  <li><a href='https://plus.google.com/107848665104278257250?rel=author' rel='me' target='_blank'><img alt='Google' src='http://cdn.benbalter.com/images/32px/google.png' /><br />\n  Google</a></li>\n</ul>"}