{"title":"About","excerpt":null,"layout":"page","permalink":"/about/","url":"/about/","date":"0001-01-01 00:00:00 -0500","id":"/about","categories":["pages"],"next":"Feel free to e-mail me at [Ben@Balter.com][1] or you can find me on these social networks:\n\n{% include contact-links.html %}\n\n [1]: mailto:ben@balter.com","previous":null,"tags":[],"content":"<p><img alt='Ben Balter' class='alignright' src='http://cdn.benbalter.com/wp-content/uploads/2010/09/fb1-272x300.jpg' /></p>\n\n<p>Ben Balter is a gov 2.0 evangelist working to hack federal government from the inside out, an open-source developer passionate about the disruptive power of technology, and a J.D./M.B.A. candidate at the George Washington University.</p>\n\n<p>Described by the US Chief Technology Officer as &#8220;the baddest of the badass innovators,&#8221; and by the White House Director of Digital Strategy as &#8221;<a href='http://www.youtube.com/watch?v=uhtlOYOhE8w#t=51m12s'>lightening in a bottle</a>,&#8221; Ben is currently a Presidential Innovation Fellow where he serves as entrepreneur in residence reimagining the role of technology in brokering the relationship between citizens and government. Before that he was a Fellow in the Office of the US Chief Information Officer within the Executive Office of the President where he was instrumental in drafting the President&#8217;s Digital Strategy, on the SoftWare Automation and Technology (SWAT) Team, the White House’s first and only agile development team, and as a <a href='http://reboot.fcc.gov/blog/?authorId=593709'>New Media Fellow</a>, in the Federal Communications Commission’s Office of the Managing Director. His paper, <a href='http://ben.balter.com/2011/11/29/towards-a-more-agile-government/'>Towards a More Agile Government</a> was published in the Public Contract Law Journal, arguing that Federal IT Procurement should be more amenable to modern, agile development methods.</p>\n\n<p>An aspiring attorney, a coder, and an all around geek, Ben’s triple-threat skill set bridges three distinct disciplines: a formal <a href='http://ben.balter.com/category/law/'>legal</a> education and commitment to advocating on behalf of others, a deep-seeded understanding of the intricacies of today’s <a href='http://ben.balter.com/category/business/'>business</a> decisions, and a life-long passion for <a href='http://ben.balter.com/category/technology/'>technology</a>‘s ability to shape how we interact with one another. When not working or in class, he enjoys tackling otherwise-impossible challenges to sharing information using nothing more than duct tape and occasionally a pack of bubblegum.</p>\n\n<p>After graduation, Ben hopes to find an avenue to explore his dual passion for law and technology in the nation’s capital.</p>\n\n<p>Feel free to e-mail me at <a href='mailto:ben@balter.com'>Ben@Balter.com</a> or you can find me on these social networks:</p>\n\n<p>{% include contact-links.html %}</p>"}