{"author":"Benjamin J. Balter","title":"Resume","excerpt":"Ben Balter is a gov 2.0 evangelist working to hack federal government from the inside out, an open-source developer passionate about the disruptive power of technology, and a J.D./M.B.A. candidate at the George Washington University.","layout":"page","permalink":"/resume/","id":"/resume","related_posts":[],"url":"/resume/","content":"<h1 id='benjamin_j_balter'>Benjamin J. Balter</h1>\n<div class='bar span2'>&nbsp;</div>\n<h2 id='experience'>Experience</h2>\n\n<h3 id='github'>GitHub</h3>\n\n<p class='location'>Washington, D.C.</p>\n\n<h4 id='government_bureaucat'>Government Bureaucat</h4>\n\n<p class='date'>March 2013 — Present</p>\n\n<h3 id='executive_office_of_the_president'>Executive Office of the President</h3>\n\n<p class='location'>Washington, D.C.</p>\n\n<h4 id='presidential_innovation_fellow'>Presidential Innovation Fellow</h4>\n\n<p class='date'>July 2012 — January 2013</p>\n\n<ul>\n<li>As member of inaugural class of high-profile White House initiative, served as entrepreneur in residence reimagining the role of technology in brokering the relationship between citizens and government while injecting a more startup-like culture within government.</li>\n\n<li>Described by the US Chief Technology Officer as &#8220;the baddest of the badass innovators,&#8221; and by the White House Director of Digital Strategy as &#8221;<a href='http://www.youtube.com/watch?v=uhtlOYOhE8w#t=51m12s'>lightning in a bottle</a>.&#8221;</li>\n\n<li>Within six months, saw four distinct open-source products from conception to production, including research, prototyping, usability, development, testing, and stakeholder outreach using then-atypical api-first architecture.</li>\n\n<li>Ensured compliance with Privacy Act, Paperwork Reduction Act, and Federal Information Security Mangagement Act including drafting of multiple formal notices on behalf of the government for publication in the Federal Register.</li>\n</ul>\n\n<h4 id='fellow_office_of_the_us_chief_information_officer'>Fellow, Office of the US Chief Information Officer</h4>\n\n<p class='date'>January 2012 — August 2012</p>\n\n<ul>\n<li>Assisted with drafting, stakeholder outreach, and coordination of the release of <a href='http://www.whitehouse.gov/sites/default/files/omb/egov/digital-government/digital-government.html'>the President’s Digital Government Strategy</a>, a fundamental reimagination of the role of technology in the public sector</li>\n\n<li>In response to presidential mandate requiring the release of open source software, coordinated and led negotiation of contract for code-sharing services including creation of records management plans under both the Federal Records and Presidential Records Acts</li>\n\n<li>Briefed senior White House officials on legal implications and licensing consideration surrounding the creation of government-funded open-source software collaborations</li>\n\n<li>Prepared US Chief Information Officer for public appearances including speech writing, messaging, and creation of multiple HTML5-based presentations</li>\n\n<li>Developed technical roadmap, prototyped, and implemented <a href='https://github.com/GSA/digital-strategy'>first-of-its-kind mechanism</a> for agencies to report progress on the Digital Government Strategy</li>\n</ul>\n\n<h4 id='software_automation__technology_swat_team_office_of_administration'>SoftWare Automation &#38; Technology (SWAT) Team, Office of Administration</h4>\n\n<p class='date'>September 2011 — January 2012</p>\n\n<ul>\n<li>Created enterprise business solutions to automate and streamline business processes in support of the President of the United States as part of the White House’s first-ever agile software development team.</li>\n\n<li>In close coordination with the Office of Federal Financial Management, lead development of <a href='https://max.gov/unclesamslist/'>prototypical government-wide, open-source classifieds system</a> for sharing of federal real and other properties among executive agencies.</li>\n\n<li>Regularly met with and presented to C-level executives and key stakeholders to develop and support mission-critical applications including public data collection, White House comment line, goods and services tracking, and employee on-boarding and off-boarding.</li>\n\n<li>Developed application to catalog blackberry SMS and PIN messages to aid E-Discovery team and assure compliance with Federal Records Act, Presidential Records Act, and Freedom of Information Act.</li>\n\n<li>Assisted information assurance teams with application certification and accreditation.</li>\n</ul>\n\n<h3 id='federal_communications_commission'>Federal Communications Commission</h3>\n\n<p class='location'>Washington, D.C.</p>\n\n<h4 id='new_media_fellow_office_of_the_managing_director'>New Media Fellow, Office of the Managing Director</h4>\n\n<p class='date'>May 2010 — January 2012</p>\n\n<ul>\n<li>Negotiated agency-wide, federal service agreements with the web&#8217;s top service providers including FISMA-compliant cloud hosting, social media, data manipulation, source code collaboration, and geospacial firms.</li>\n\n<li>Drafted website privacy policy, comment moderation policy, third-party privacy notices, and API terms of service for agency’s reimagined web presence.</li>\n\n<li>Created legal and technical roadmaps to ensure compliance of new media platforms with White House Office of Management and Budget memorandums M-10-22 and M-10-23 governing federal agencies&#8217; use of website tracking technologies and third-party services.</li>\n\n<li>Supported New Media Team’s procurement efforts, including scope of work, impact statement, and limited source justification drafting.</li>\n\n<li>Received Superior Achievement Award for customer service, quality performance, and overall contribution to the agency mission.</li>\n\n<li>Led adoption, implementation, and analysis of Google Analytics website visitor tracking statistics.</li>\n\n<li>Developed more than 30 in-house software tools including <a href='http://github.com/fcc'>open-source website auditing and site-mapping software</a> instrumental to evaluation of online presence spanning more than 1.2 million pages.</li>\n</ul>\n\n<h2 id='education'>Education</h2>\n\n<h3 id='the_george_washington_university_law_school'>The George Washington University Law School</h3>\n\n<p class='location'>Washington, D.C.</p>\n\n<h4 id='juris_doctorate_candidate'>Juris Doctorate Candidate</h4>\n\n<p class='date'>May 2013</p>\n\n<ul>\n<li>Technology Editor, <a href='http://pclj.org/'>The Public Contract Law Journal</a>, authored published note arguing that <a href='http://ben.balter.com/2011/11/29/towards-a-more-agile-government/' title='Towards a More Agile Government'>federal IT procurement practices should be made more amenable to agile software development methodologies</a>.</li>\n\n<li>President, Jay Chapter, <a href='http://phialphadeltagw.com'>Phi Alpha Delta</a> Legal Fraternity</li>\n\n<li>Member, <a href='http://fcba.org/'>Federal Communications Bar Association</a></li>\n\n<li>Member, <a href='http://www.ncmahq.org/'>National Contract Management Association</a></li>\n</ul>\n\n<h3 id='the_george_washington_university_school_of_business'>The George Washington University School of Business</h3>\n\n<p class='location'>Washington, D.C.</p>\n\n<h4 id='master_of_business_administration__strategic_management_and_public_policy'>Master of Business Administration — Strategic Management and Public Policy</h4>\n\n<p class='date'>May 2013</p>\n\n<ul>\n<li>International residency, Stockholm, Sweden — consultancy for Swedish green-technology firm seeking to bring environmentally friendly biofuel pumps to US market; created market-entry plan, including analysis of regulatory framework and licensing considerations.</li>\n</ul>\n\n<h3 id='the_george_washington_university'>The George Washington University</h3>\n\n<p class='location'>Washington, D.C.</p>\n\n<h4 id='bachelor_of_arts_political_science'>Bachelor of Arts, Political Science</h4>\n\n<p class='date'>May 2009</p>\n\n<h2 id='technical_skills'>Technical Skills</h2>\n\n<h4 id='web_development_and_management'>Web Development and Management</h4>\n\n<ul>\n<li>Expertise in modern web development methods — HTML5, CSS, CoffeeScript (Javascript), Rails (Ruby), relational databases (MySQL), PHP, verson control (Git) — enterprise system architecture; application programing interfaces (APIs); WordPress management, development, and integration; and Unix system administration.</li>\n\n<li>Lead development of six active open-source projects with more than 60,000 downloads to date.</li>\n</ul>\n\n<h4 id='speaking_experience'>Speaking Experience</h4>\n\n<ul>\n<li><a href='http://sxsw.com'>South by Southwest</a> Interactive, panelist, <a href='http://panelpicker.sxsw.com/ideas/view/10270'>Content and Coding are not Commodities</a></li>\n\n<li>Guest lecturer, American University, <a href='http://ben.balter.com/2011/03/09/craft-your-personal-brand/'>Personal Branding and Social Media</a></li>\n\n<li>Present regularly within federal government including <a href='http://ben.balter.com/digital-strategy-reporting/#/title'>implementation of the Digital Strategy</a> within GSA&#8217;s <a href='https://github.com/benbalter/apis-you-didnt-know-already-existed'>Digital Services Innovation Center</a> and at <a href='http://ben.balter.com/2011/04/12/love-the-code/'>local technology</a> meetups including Hacks/Hackers DC, <a href='http://ben.balter.com/digital-strategy-reporting/'>Drupal4Gov</a>, and WordPress DC</li>\n</ul>"}