{"author":"Benjamin J. Balter","title":"Groupon and LivingSocial: a Limited-Time Offer","excerpt":"Despite the hype, daily deal sites like Groupon and LivingSocial are not the next wave of e-commerce. Not only are they bad for merchants, their business model simply isn't sustainable as established firms begin to enter the already-crowded market.","layout":"post","category":["Business","Law","Technology"],"tags":["daily deals","e-commerce","facebook","google","groupon","ipo","livingsocial"],"post_format":[],"url":"/2011/06/16/groupon-and-livingsocial/","date":"2011-06-16 00:00:00 -0400","id":"/2011/06/16/groupon-and-livingsocial","categories":["posts"],"next":"Google recently added [social engagement tracking][1] to its analytics suite. With a little bit of leg work, Google Analytics can track not only +1s, but also Facebook and Twitter shares via a simple `_gaq.push` call.\n\nIf your site uses WordPress's JetPack plugin with Sharedaddy, and you already have [Google Analytics][2] up and running, you can use jQuery to attach the virtual event to the share button.\n\nTo add Google Analytics to Sharedaddy's Twitter share button:\n\n<div>{% highlight javascript %}\n$('a.share-twitter').click( function() {\n_gaq.push( ['_trackSocial', 'twitter', 'share',\n$(this).attr('href').substr(0, $(this).attr('href').indexOf('?'))]);\n});{% endhighlight %}</div>\n\n…and for Facebook:\n\n<div>{% highlight javascript %}\n$('a.share-facebook').click( function() {\n_gaq.push( ['_trackSocial', 'faceboook', 'share',\n$(this).attr('href').substr(0, $(this).attr('href').indexOf('?'))]);\n});{% endhighlight %}</div>\n\nThe above code simply listens for the share button to be clicked, and if so, passes the target URL back to Google, along with the service's name. Putting it all together into a plugin with a hook to <del>`wp_head`</del> `wp_footer` you get:\n\n<script src=\"https://gist.github.com/1058469.js\"> </script>\n\nThe code should work out of the box with the standard share buttons (seen below), but can easily be adapted with a few minor modifications to apply to like and other iterations of the social media icons.\n\nMore details on the tracking code can be found over in the [Google Analytics Social Engagement Documentation][3]. Improve the code to work with your site? Feel free to [fork the gist][4] and contribute it back.\n\n**Update:** Dedicated reader All-around rabble-rouser [Andrew Nacin][5] points out that by default, jQuery is queued up into the footer. Updated the above code to hook into `wp_footer` with a priority of 20 (higher than jQuery's 10 hook).\n\n**Update:** Special thanks to [@Ramoonus][6] for [didn't queue up jQuery][7].\n\n [1]: http://mashable.com/2011/06/30/google-analytics-social-plugin/\n [2]: http://yoast.com/wordpress/google-analytics/\n [3]: http://code.google.com/apis/analytics/docs/tracking/gaTrackingSocial.html\n [4]: https://gist.github.com/1058469\n [5]: http://andrewnacin.com\n [6]: http://twitter.com/Ramoonus\n [7]: https://gist.github.com/1058469/db96b6836f279811205bddbf8be67bec6ca2159c","previous":"<p><a href='http://www.flickr.com/photos/timsamoff/391427627/'><img alt='Subpoena' class='alignright' src='http://farm1.staticflickr.com/157/391427627_62f2a23df4_n.jpg' /></a>Bluehost, the <a href='http://en.wikipedia.org/wiki/Web_hosting_service'>web hosting service</a> which powers more than <a href='http://en.wikipedia.org/wiki/Bluehost'>1.9 million</a> websites globally, making it one of the <a href='http://en.wikipedia.org/wiki/Bluehost'>top 20</a> largest hosting companies in the world and approximately <a href='http://www.necn.com/01/05/11/Koch-Industries-sues-over-bogus-website-/landing_scitech.html?&amp;blockID=3&amp;apID=b76a38541f994e489206850f0db50d02'>2% of the internet&#8217;s traffic</a>, recently came under fire for its decision to depart from well-established <a href='http://pubcit.typepad.com/clpblog/2010/07/two-new-cases-on-internet-anonymity.html'>internet standards</a> and reveal the identity of one of its subscribers, over what <a href='http://www.sltrib.com/sltrib/money/51780456-79/koch-company-judge-federal.html.csp'>later proved</a> to be an <a href='http://pubcit.typepad.com/files/kochindustries.pdf'>unfounded suit</a>.</p>\n\n<p>From a technical standpoint, Bluehost is one of the good guys. I&#8217;ve hosted sites with them since 2005 and looking back at the past six months, I&#8217;ve enjoyed a 99.79% uptime, with an average response time just under a second. But that&#8217;s half the equation. Web hosting is not simply a cost-benefit analysis of price to uptime and responsiveness. There&#8217;s a third factor there: trust.</p>\n\n<p>Why does a hosting company require trust? In December, a <a href='http://www.scribd.com/doc/45044630/Koch-Industries-on-Climate-Science'>fake news release</a> was <a href='http://www.nytimes.com/2011/02/14/business/media/14link.html?_r=1'>published</a> on a Bluehost powered site by an anonymous satirical group, stating that after &#8220;a recent internal and thorough company review,&#8221; Koch Industries, an oil processing company, would be &#8220;restructuring its support of climate change research and advocacy initiatives.&#8221;</p>\n\n<p>The problem occurred, however, when Bluehost was over eager to comply with Koch&#8217;s subpoena demanding the identity of the anonymous poster, <a href='http://www.necn.com/01/05/11/Koch-Industries-sues-over-bogus-website-/landing_scitech.html?&amp;blockID=3&amp;apID=b76a38541f994e489206850f0db50d02'>arguing</a>, &#8221;<span>w</span>e are not in the business of harboring, you know, felons and crooks. We are not about that. This isn&#8217;t WikiLeaks… <span>w</span>e comply with the law here.&#8221;</p>\n\n<p>Bluehost knew that the customer wanted to be anonymous (they had opted into Bluehost&#8217;s domain protection program), however, the law here depends on Bluehost providing their client with knowledge of the subpoena, so that a timely objection can be heard by the issuing judge. In the <a href='http://pubcit.typepad.com/clpblog/2011/05/federal-court-dismisses-koch-brothers-trademark-suit-over-climate-change-prank.html'>words of the site&#8217;s own counsel</a>:</p>\n\n<p>The judge ruled that <span>Bluehost&#8217;s customer,</span> Youth for Climate Truth had a First Amendment right to issue a satirical press release and website – in which the group impersonated Koch and announced that the company had reversed its position on climate change – in an effort to call attention to Koch&#8217;s <a href='http://www.greenpeace.org/usa/en/campaigns/global-warming-and-energy/polluterwatch/koch-industries/'>notorious bankrolling of efforts to deny climate change</a>.</p>\n\n<p>The U.S. District Court for the District of Utah rejected all of Koch&#8217;s legal claims, which alleged trademark infringement, unfair competition, cybersquatting, computer hacking and breach of the company website&#8217;s terms of use. The judge also issued an order barring Koch from using any identifying information it had already obtained about our clients via subpoena.</p>\n\n<p>The problem here arises not from Koch trying to use its legal muscle to silence political satire, but from Bluehost&#8217;s over willingness to comply with a request to identify the anonymous satirist.</p>\n\n<p>In Bluehost&#8217;s defense, the suit came at the height of the WIkileaks debacle, a time when the industry&#8217;s top names were <a href='http://ben.balter.com/2011/01/11/twitter-goes-to-bat-for-wikileaks/'>identifying otherwise anonymous customers</a>, but at the same time, as political interactions move increasingly online, our marketplace of ideas relies increasingly on hosting companies and internet services providers to remain good political citizens (not simply corporate ones).</p>\n\n<p>While technology may lend voice to otherwise marginalized political groups, it does not come without risk. In a shared hosting environment like Bluehost, &#8220;your&#8221; website, is not necessarily &#8220;your&#8221; website. Will we begin to see subpoena response times along the list of benchmarks and features when evaluating hosting companies? Probably not. But if you are planning on leveraging shared servers — be they Bluehost, Twitter, or YouTube — to blog about anything more than say, <a href='http://dcinterns.blogspot.com/'>DC Summer Interns</a>, perhaps you should take a look at your hosting company&#8217;s legal record before you click submit.</p>","content":"<p><img alt='' src='http://ben.balter.com/wp-content/uploads/2011/06/5554901181_664eac93a6_b-300x200.jpg' />Despite the hype, daily deal sites like Groupon and LivingSocial are not the next wave of e-commerce. Not only are they bad for merchants, their business model simply isn&#8217;t sustainable as established firms begin to enter the already-crowded market.</p>\n\n<p>***<strong><em>Bad for Business</em></strong>***</p>\n\n<p>It&#8217;s hard for small businesses to profit from the deal. Sure, a daily deal will drive additional bodies through the door, but like many promotions, business often lose money on the deal itself, especially once Groupon or LivingSocial&#8217;s cut is factored in, a cut which can often be as high as 50%. The key, it seems, for small business, is <a href='http://news.ycombinator.com/item?id=2654788'>to be smart</a>, either upselling the customer, or convincing them that a second, non-discounted visit is well worth their while — not a simple task for the uninitiated.</p>\n\n<p>Although Groupon&#8217;s compulsory non-disclosure agreement renders the majority of the evidence anecdotal at best, part of the problem seems to stem from a misalignment between the deal sites&#8217; interests and businesses&#8217;, despite what seems like a standard revenue sharing model. Deals are <a href='http://techcrunch.com/2011/06/09/groupon-single-worst-decision/'>scheduled to optimize the deal site&#8217;s profit</a>, not the merchant&#8217;s and the unexpected influx of new customers <a href='http://gawker.com/5786492/the-groupon-backlash-its-the-business-model-stupid'>can prove disasterous</a> if not properly managed. For a local business, an injection of constantly-connected 20-somethings can be fatal to the business&#8217;s online reputation if experience does not live up to the deal site&#8217;s <a href='http://gawker.com/5785317/the-groupon-backlash-is-on'>well-crafted hipster-sweatshop hype</a>.</p>\n\n<p><strong>Legal Pitfalls</strong></p>\n\n<p>The economics of the situation are only half the threat. Daily deals live in murky legal waters, and the sites often push small business into the deep end, rather than provide the necessary guidance. Basic economies of scale dictate that it would be significantly more efficient for Groupon or LivingSocial to establish a firm policy around the relevant legal issues (<em>e.g.,</em> &#8220;we do not offer discounts on alcohol in Chicago&#8221;), rather than require each small business to incur what most likely amounts to a relatively large expense (not to mention legal risk), effort duplicated across merchants and states.</p>\n\n<p>As Benjamin Edelman and Paul Kominers <a href='http://www.benedelman.org/voucher-consumer-protection/#liability'>argue</a>:</p>\n\n<p><span>T</span>he legal and regulatory questions… are questions that arise distinctively in the context of discount vouchers: a merchant would never confront such questions were it not for discount vouchers. Having created the transactions giving rise to this regulatory complexity… discount voucher services should be expected to achieve compliance.</p>\n\n<p>Edelman and Kominers <a href='http://www.benedelman.org/voucher-consumer-protection/#liability'>continue</a>:</p>\n\n<p>Voucher services typically seek to cast themselves as mere marketing vendors that are not responsible for the conduct of the corresponding merchants. For example, <a href='http://www.groupon.com/terms'>Groupon&#8217;s Terms of Sale</a> claim that &#8220;The Merchant, not Groupon, is the seller of the Voucher and the goods and services and is solely responsible for redeeming any Voucher you purchase.&#8221;</p>\n\n<p>…But a voucher service is the merchant of record for the charge to the customer&#8217;s credit card. As the entity officially responsible for charging the consumer, the voucher service thus faces increased responsibility to see that the consumer receives what was promised.</p>\n\n<p>This, combined with the fact that <a href='http://www.businessinsider.com/teardown-of-the-groupon-merchant-agreement-2011-6'>Groupon claims the entirety of the purchase price as revenue</a> suggests that daily deal sites are the 10,000 lb guerilla unfairly shifting the legal burden to small businesses. Despite all this, Groupon&#8217;s largest shareholder simply <a href='http://blogs.forbes.com/luisakroll/2011/04/04/new-billionaire-eric-lefkofsky-talks-about-groupon-and-tech-investing/'>recommends</a> that business not &#8220;worry about the noise that the legal system creates.&#8221;</p>\n\n<p><strong>Gift Cards?</strong> First is the question of if a daily deal constitutes a <a href='http://www.ncsl.org/default.aspx?tabid=12474'>gift card</a>, a legal issue with which both <a href='http://www.jpml.uscourts.gov/Panel_Orders/MDL-2238-Initial_Transfer.pdf'>Groupon</a> and <a href='http://www.seattlepi.com/local/article/Seattle-class-action-LivingSocial-expiration-1015493.php'>LivingSocial</a> are intimately familiar with, defending at least <a href='http://www.benedelman.org/voucher-consumer-protection/#expiration'>12 distinct lawsuits</a>. Despite the expiration date listed online, in print, and often sent in reminder e-mails, in some states, customers may be eligible to redeem deals long after they expire, or at least have ground to reclaim their initial investment, often at the merchants&#8217; expense.</p>\n\n<p><strong>Sales Tax</strong> Second is the question of what the sales tax should be levied at the time the goods or services are actually tendered. As TechCrunch aptly <a href='http://techcrunch.com/2011/06/15/daily-deal-consumer-protection-laws/'>points out</a> there&#8217;s a great deal of leeway depending on how you crunch the numbers:</p>\n\n<p>What&#8217;s the correct sales tax on a $51 purchase with a $50 Groupon that someone bought for $25 in a state with a 5% tax rate? The possible answers are 5 cents, 68 cents, $1.30 and $2.55. That&#8217;s based on a taxable value of $1 (amount paid at point of sale), $13.50 (amount merchant actually gets), $26 (total amount consumer paid) and $51 (total face value of the transaction).</p>\n\n<p><strong>Alcohol</strong> Third, daily deals involving alcohol, may <a href='http://www.tabc.state.tx.us/education/pdfs/Happy-Hour-Laws.pdf'>run afoul of the law in certain states</a>. In Illinois, Groupon&#8217;s home state, for example, it is illegal to offer alcohol discounts to some patriots and not others. Researchers found <a href='http://www.benedelman.org/voucher-consumer-protection/beer-chicago-google-060811.png'>87 deals</a> in Chicago alone that advertised discounts on beer, and <a href='http://www.benedelman.org/voucher-consumer-protection/wine-chicago-google-060811.png'>another 252</a> that offered discounts on wine.</p>\n\n<p><strong>What&#8217;s Next for Groupon</strong></p>\n\n<p>Not much. Assuming Groupon scales back its cut and guides merchants through the industry&#8217;s legal pitfalls, as Groupon&#8217;s <a href='http://www.sec.gov/Archives/edgar/data/1490281/000104746911005613/a2203913zs-1.htm'>recent S-1</a> shows, they are still <a href='http://techcrunch.com/2011/06/13/why-groupon-is-poised-for-collapse/'>using the revenue from new deals to pay for previous ones</a>, generally repaying merchants over the course of two months. If Google&#8217;s Offers service gains traction, Groupon could face some serious operating cash flow issues, especially with the competition paying out <a href='http://www.google.com/support/offersbusiness/bin/answer.py?hl=en&amp;answer=1229917'>80% within four days</a>.</p>\n\n<p><strong>Limited Growth</strong>Daily deal sites&#8217; most successful contribution to the market are not the deals themselves, but rather the hype ecosystem they generate. Like any viral network, their model is dependent on friends continuously asking friends &#8220;oh, have you heard of this cool new thing the kids are doing.&#8221; With the early adopting Facebook generation arguably tapped, it&#8217;s only a matter of time before baby boomers become equally saturated.</p>\n\n<p>Sure it&#8217;s fun to get an e-mail in your inbox with a &#8220;super-exclusive&#8221; offer, but when everyone&#8217;s in on it, the artificial scarcity is no longer all that alluring. How many nearly identical offers for half off yoga can one person get before they get tired of misses and simply unsubscribe. Multiply that threat by the increasing number of daily deal sites that are springing up and the problem becomes readily apparent.</p>\n\n<p><strong>Data Blindspot</strong>Smart websites are driven by data — personal data — and they use it to fuel growth. Amazon leverages my buying history to make personalized recommendations and I buy more stuff. Facebook maps out my social graph and recommends people I know and I friend more people. Netflix tracks my viewing history, going so far as to put a up a <a href='http://bits.blogs.nytimes.com/2009/09/21/netflix-awards-1-million-prize-and-starts-a-new-contest/'>$1 million bounty</a> to perfect reading my mind. And daily deal sites know that&#8217;s their <a href='http://techcrunch.com/2011/01/11/why-we-invested-in-groupon-the-power-of-data/'>only shot at staying relevant</a>.</p>\n\n<p>Despite <a href='http://techcrunch.com/2010/12/07/groupon-everywhere-jiwire/'>Groupon&#8217;s efforts</a>, there&#8217;s just not enough data there. They may have my age, gender, rough location, and one or two datapoints of buying history, but compare that to the relative dossier that Google and Amazon both have to have on me, it&#8217;s always going to be a losing fight. Once first mover advantage begins to lose its shimmer, the big boys&#8217; synergies will begin to show their <a href='http://www.wired.com/epicenter/2011/04/facebook-deals/'>true</a> <a href='http://thenextweb.com/us/2011/06/02/amazon-enters-the-daily-deals-space-with-amazonlocal/'>potential</a>, and daily deal sites like Groupon and LivingSocial will expire as quickly as the deals they peddle.</p>\n\n<p><span>Photo courtesy <a href='http://www.flickr.com/photos/wovox/5554901181/'>wovox</a></span></p>"}