{"author":"Benjamin J. Balter","title":"Groupon and LivingSocial: a Limited-Time Offer","excerpt":"Despite the hype, daily deal sites like Groupon and LivingSocial are not the next wave of e-commerce. Not only are they bad for merchants, their business model simply isn't sustainable as established firms begin to enter the already-crowded market.","layout":"post","categories":["Business","Law","Technology"],"tags":["daily deals","e-commerce","facebook","google","groupon","ipo","livingsocial"],"post_format":[],"related_posts":[{"url":"/2010/09/12/wordpress-resume-plugin/","id":"/2010/09/12/wordpress-resume-plugin","title":"WordPress Resume Plugin"},{"url":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party/","id":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party","title":"New Media Flak: Megaphone vs. Cocktail Party"},{"url":"/2010/10/10/does-every-cloud-have-a-silver-lining/","id":"/2010/10/10/does-every-cloud-have-a-silver-lining","title":"Does Every Cloud Have a Silver Lining?"},{"url":"/2010/11/06/removing-the-barriers-to-organizational-agility/","id":"/2010/11/06/removing-the-barriers-to-organizational-agility","title":"Removing the Barriers to Organizational Agility\n"},{"url":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing/","id":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing","title":"What Fourteen-Century Apple Pie Teaches Us About Sharing\n"},{"url":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds/","id":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds","title":"Will Federal Contracting Officers Soon Have Their Heads in the Clouds?\n"},{"url":"/2010/11/29/free-trade-in-china-just-google-it/","id":"/2010/11/29/free-trade-in-china-just-google-it","title":"Free Trade in China? Just Google it."},{"url":"/2010/11/29/twitter-mentions-as-comments/","id":"/2010/11/29/twitter-mentions-as-comments","title":"Twitter Mentions as Comments WordPress Plugin\n"},{"url":"/2010/12/01/the-internet-is-series-of-tubes/","id":"/2010/12/01/the-internet-is-series-of-tubes","title":"The Internet is Series of Tubes (oh, and Tollgates too)\n"},{"url":"/2010/12/20/late-night-infomercials/","id":"/2010/12/20/late-night-infomercials","title":"Late-Night Infomercials: Guaranteed to Extend the 4th Amendment or Your Money Back"}],"url":"/2011/06/16/groupon-and-livingsocial/","date":"2011-06-16 00:00:00 +0000","id":"/2011/06/16/groupon-and-livingsocial","next":"/2011/06/30/google-analytics-tracking-of-jetpack-sharedaddy-social-engagement","previous":"/2011/05/10/whats-your-hosting-companys-average-subpoena-response-time","content":"<p><img alt='' src='http://ben.balter.com/wp-content/uploads/2011/06/5554901181_664eac93a6_b-300x200.jpg' />Despite the hype, daily deal sites like Groupon and LivingSocial are not the next wave of e-commerce. Not only are they bad for merchants, their business model simply isn&#8217;t sustainable as established firms begin to enter the already-crowded market.</p>\n\n<p><strong>Bad for Business</strong></p>\n\n<p>It&#8217;s hard for small businesses to profit from the deal. Sure, a daily deal will drive additional bodies through the door, but like many promotions, business often lose money on the deal itself, especially once Groupon or LivingSocial&#8217;s cut is factored in, a cut which can often be as high as 50%. The key, it seems, for small business, is <a href='http://news.ycombinator.com/item?id=2654788'>to be smart</a>, either upselling the customer, or convincing them that a second, non-discounted visit is well worth their while — not a simple task for the uninitiated.</p>\n\n<p>Although Groupon&#8217;s compulsory non-disclosure agreement renders the majority of the evidence anecdotal at best, part of the problem seems to stem from a misalignment between the deal sites&#8217; interests and businesses&#8217;, despite what seems like a standard revenue sharing model. Deals are <a href='http://techcrunch.com/2011/06/09/groupon-single-worst-decision/'>scheduled to optimize the deal site&#8217;s profit</a>, not the merchant&#8217;s and the unexpected influx of new customers <a href='http://gawker.com/5786492/the-groupon-backlash-its-the-business-model-stupid'>can prove disasterous</a> if not properly managed. For a local business, an injection of constantly-connected 20-somethings can be fatal to the business&#8217;s online reputation if experience does not live up to the deal site&#8217;s <a href='http://gawker.com/5785317/the-groupon-backlash-is-on'>well-crafted hipster-sweatshop hype</a>.</p>\n\n<p><strong>Legal Pitfalls</strong></p>\n\n<p>The economics of the situation are only half the threat. Daily deals live in murky legal waters, and the sites often push small business into the deep end, rather than provide the necessary guidance. Basic economies of scale dictate that it would be significantly more efficient for Groupon or LivingSocial to establish a firm policy around the relevant legal issues (<em>e.g.,</em> &#8220;we do not offer discounts on alcohol in Chicago&#8221;), rather than require each small business to incur what most likely amounts to a relatively large expense (not to mention legal risk), effort duplicated across merchants and states.</p>\n\n<p>As Benjamin Edelman and Paul Kominers <a href='http://www.benedelman.org/voucher-consumer-protection/#liability'>argue</a>:</p>\n\n<p>[T]he legal and regulatory questions… are questions that arise distinctively in the context of discount vouchers: a merchant would never confront such questions were it not for discount vouchers. Having created the transactions giving rise to this regulatory complexity… discount voucher services should be expected to achieve compliance.</p>\n\n<p>Edelman and Kominers <a href='http://www.benedelman.org/voucher-consumer-protection/#liability'>continue</a>:</p>\n\n<p>Voucher services typically seek to cast themselves as mere marketing vendors that are not responsible for the conduct of the corresponding merchants. For example, <a href='http://www.groupon.com/terms'>Groupon&#8217;s Terms of Sale</a> claim that &#8220;The Merchant, not Groupon, is the seller of the Voucher and the goods and services and is solely responsible for redeeming any Voucher you purchase.&#8221;</p>\n\n<p>…But a voucher service is the merchant of record for the charge to the customer&#8217;s credit card. As the entity officially responsible for charging the consumer, the voucher service thus faces increased responsibility to see that the consumer receives what was promised.</p>\n\n<p>This, combined with the fact that <a href='http://www.businessinsider.com/teardown-of-the-groupon-merchant-agreement-2011-6'>Groupon claims the entirety of the purchase price as revenue</a> suggests that daily deal sites are the 10,000 lb guerilla unfairly shifting the legal burden to small businesses. Despite all this, Groupon&#8217;s largest shareholder simply <a href='http://blogs.forbes.com/luisakroll/2011/04/04/new-billionaire-eric-lefkofsky-talks-about-groupon-and-tech-investing/'>recommends</a> that business not &#8220;worry about the noise that the legal system creates.&#8221;</p>\n\n<p><strong>Gift Cards?</strong> First is the question of if a daily deal constitutes a <a href='http://www.ncsl.org/default.aspx?tabid=12474'>gift card</a>, a legal issue with which both <a href='http://www.jpml.uscourts.gov/Panel_Orders/MDL-2238-Initial_Transfer.pdf'>Groupon</a> and <a href='http://www.seattlepi.com/local/article/Seattle-class-action-LivingSocial-expiration-1015493.php'>LivingSocial</a> are intimately familiar with, defending at least <a href='http://www.benedelman.org/voucher-consumer-protection/#expiration'>12 distinct lawsuits</a>. Despite the expiration date listed online, in print, and often sent in reminder e-mails, in some states, customers may be eligible to redeem deals long after they expire, or at least have ground to reclaim their initial investment, often at the merchants&#8217; expense.</p>\n\n<p><strong>Sales Tax</strong> Second is the question of what the sales tax should be levied at the time the goods or services are actually tendered. As TechCrunch aptly <a href='http://techcrunch.com/2011/06/15/daily-deal-consumer-protection-laws/'>points out</a> there&#8217;s a great deal of leeway depending on how you crunch the numbers:</p>\n\n<p>What&#8217;s the correct sales tax on a $51 purchase with a $50 Groupon that someone bought for $25 in a state with a 5% tax rate? The possible answers are 5 cents, 68 cents, $1.30 and $2.55. That&#8217;s based on a taxable value of $1 (amount paid at point of sale), $13.50 (amount merchant actually gets), $26 (total amount consumer paid) and $51 (total face value of the transaction).</p>\n\n<p><strong>Alcohol</strong> Third, daily deals involving alcohol, may <a href='http://www.tabc.state.tx.us/education/pdfs/Happy-Hour-Laws.pdf'>run afoul of the law in certain states</a>. In Illinois, Groupon&#8217;s home state, for example, it is illegal to offer alcohol discounts to some patriots and not others. Researchers found <a href='http://www.benedelman.org/voucher-consumer-protection/beer-chicago-google-060811.png'>87 deals</a> in Chicago alone that advertised discounts on beer, and <a href='http://www.benedelman.org/voucher-consumer-protection/wine-chicago-google-060811.png'>another 252</a> that offered discounts on wine.</p>\n\n<p><strong>What&#8217;s Next for Groupon</strong></p>\n\n<p>Not much. Assuming Groupon scales back its cut and guides merchants through the industry&#8217;s legal pitfalls, as Groupon&#8217;s <a href='http://www.sec.gov/Archives/edgar/data/1490281/000104746911005613/a2203913zs-1.htm'>recent S-1</a> shows, they are still <a href='http://techcrunch.com/2011/06/13/why-groupon-is-poised-for-collapse/'>using the revenue from new deals to pay for previous ones</a>, generally repaying merchants over the course of two months. If Google&#8217;s Offers service gains traction, Groupon could face some serious operating cash flow issues, especially with the competition paying out <a href='http://www.google.com/support/offersbusiness/bin/answer.py?hl=en&amp;answer=1229917'>80% within four days</a>.</p>\n\n<p><strong>Limited Growth</strong>Daily deal sites&#8217; most successful contribution to the market are not the deals themselves, but rather the hype ecosystem they generate. Like any viral network, their model is dependent on friends continuously asking friends &#8220;oh, have you heard of this cool new thing the kids are doing.&#8221; With the early adopting Facebook generation arguably tapped, it&#8217;s only a matter of time before baby boomers become equally saturated.</p>\n\n<p>Sure it&#8217;s fun to get an e-mail in your inbox with a &#8220;super-exclusive&#8221; offer, but when everyone&#8217;s in on it, the artificial scarcity is no longer all that alluring. How many nearly identical offers for half off yoga can one person get before they get tired of misses and simply unsubscribe. Multiply that threat by the increasing number of daily deal sites that are springing up and the problem becomes readily apparent.</p>\n\n<p><strong>Data Blindspot</strong>Smart websites are driven by data — personal data — and they use it to fuel growth. Amazon leverages my buying history to make personalized recommendations and I buy more stuff. Facebook maps out my social graph and recommends people I know and I friend more people. Netflix tracks my viewing history, going so far as to put a up a <a href='http://bits.blogs.nytimes.com/2009/09/21/netflix-awards-1-million-prize-and-starts-a-new-contest/'>$1 million bounty</a> to perfect reading my mind. And daily deal sites know that&#8217;s their <a href='http://techcrunch.com/2011/01/11/why-we-invested-in-groupon-the-power-of-data/'>only shot at staying relevant</a>.</p>\n\n<p>Despite <a href='http://techcrunch.com/2010/12/07/groupon-everywhere-jiwire/'>Groupon&#8217;s efforts</a>, there&#8217;s just not enough data there. They may have my age, gender, rough location, and one or two datapoints of buying history, but compare that to the relative dossier that Google and Amazon both have to have on me, it&#8217;s always going to be a losing fight. Once first mover advantage begins to lose its shimmer, the big boys&#8217; synergies will begin to show their <a href='http://www.wired.com/epicenter/2011/04/facebook-deals/'>true</a> <a href='http://thenextweb.com/us/2011/06/02/amazon-enters-the-daily-deals-space-with-amazonlocal/'>potential</a>, and daily deal sites like Groupon and LivingSocial will expire as quickly as the deals they peddle.</p>\n\n<p>[Photo courtesy <a href='http://www.flickr.com/photos/wovox/5554901181/'>wovox</a>]</p>"}