{"author":"Benjamin J. Balter","title":"WP Document Revisions — Document Management & Version Control for WordPress","excerpt":"WP Document Revisions is a document management and version control plugin for the popular content management system, WordPress. Think of it as an open-source and more intuitive version of the popular Microsoft collaboration suite, Sharepoint.\n","layout":"post","category":["Business","Law","Technology"],"tags":["code","collaboration","document management","enterprise","file hosting","government","gsoc","open source","plugin","sharepoint","version control","wordpress","workflow"],"post_format":[],"url":"/2011/08/29/wp-document-revisions-document-management-version-control-wordpress/","date":"2011-08-29 00:00:00 -0400","id":"/2011/08/29/wp-document-revisions-document-management-version-control-wordpress","categories":["posts"],"next":"> \"In 1876, the president of Western Union brushed off Alexander Graham Bell's telephone as little more than an \"*electric toy*,\" and the company called Bell's proposal to put one in every home \"*utterly out of the question*.\" Oxford University professor Erasmus Wilson predicted that when the 1878 Paris Exhibition closed, the electric light would \"*close with it and no more will be heard of it*.\" A Michigan banker advised his client not to invest in Henry Ford's company in 1903 because \"*the horse is here to stay, but the automobile is only a novelty*.\" …If there is one constant through out time, it's that conventional wisdom often misses the mark, especially in the early days of technological transformation.\" [^1]\n\nI've never heard any individual, upon being asked what they thought of a recent automobile purchase respond, \"*well, it's got this weird ‘new car' smell, so it's going to take some getting used to*.\" [^2] Yet for many, such is the typical reaction to experiencing a new technology. [^3]\n\nWhat is it about technological progress that sends many running for their digital security blankets? [^4] For some reason, much of the resistance appears to be [uniformed doubt][5] (*e.g.*, \"It's different\"), rather than [calculated avoidance][6] (*e.g.*, \"It's less secure because you can't prevent X\"). To be fair, the business world, and even more so CIO's, see avoiding uncertainty and minimizing risk as a core competency, but I don't think that's the whole story.\n\nThe rapid pace of innovation has rendered many stakeholders and decision makers out of the loop when it comes to where a given technology stands in relation to their current practices, and for good reason: disruptive technology poses a risk not only on a organization level, but on a personal level as well.\n\n*   **From a practical standpoint**, all other things remaining constant, a firm's move to the cloud, for example, [brings into question the security of the sysadmin][7] that has spent years building up a fiefdom of server farms.\n*   **From a skills standpoint**, there's a whole generation out there that grew up on the Internet, and many of those in a position to make purchasing decisions or recommendation are simply not part of it. A young upstart consultant coming in and showing up the veteran can potentially be a recurring (and realistic) [nightmare for many baby boomers][8].\n*   **From a professional standpoint**, at its most basic level, risk is taken by individuals (who propose a new system, procedure, etc.), which in many organizations may have an incentive to adopt a \"don't rock the boat\" mentality for their own career's sake, rather than [risk being wrong][9].\n\nIf technological innovation were simply a matter of calculated risk and switching costs, one would expect firms to be *equally* as unlikely to upgrade an existing technology as they would be to switch to a new one. Mathematically, upgrading in-house servers to the next version of Microsoft Exchange may[ far outweigh][10] a move to the cloud. Yet, large firms have been [slow to make the change][11].\n\nThere's a whole world out there of distributed, open innovation that, with the exception of a few startups, [^5] has been widely ignored by IT departments, and as Yochai Benkler argues in *[The Wealth of Networks][13],* if history suggests anything, it is that the proprietary model is on its way to the endangered species list.\n\nSo what's the answer? How can open source fanatics and other early adopters rescue the change averse from their self-perpetuated anachronisms?\n\n*   **Talk about *solutions* not technology** – Geeks love shiny new things. It's in our DNA. Yet rarely are geeks the one making the decisions. Decision makers could often care less which acronym powers something, but rather than dumb things down (\"this thingy talks to that thingy\"), translate the situation in terms of [organizational change][14] (\"it will wholly eliminate the need for paper forms\"). Rarely does technology change without the organization following suit. [Approach the situation as a human problem][15], not a technical one.\n*   **Move past \"*****If it ain't broke, don't fix it\"** – \"*It's good enough\" should never be a persuasive argument for stagnation. Just because something has been used in the past, does not mean that it should. [^6] </em>In software development, changes fit into one of two categories: bugs and enhancements. Saying that something \"works\" ignores exactly half of the equation.\n*   **Broadcast excellence **- If you ask me why an organization should use SharePoint, I have at my fingertips [focus-group tested ammunition][17]. Ask my why you should use WordPress, and I'm [left to pretty much fend for myself][18].  Curators of innovative technology need to make themselves known, and give those empowered to affect change, the tools to do so.\n\nThe future's coming. That's for sure. Change is inevitable. Firms looking to seek a competitive advantage will begin to look past \"*it has to be expensive and complicated*\" and start looking toward open-source software, not as a misfit alternative, but as a viable player in the software space, but before that can happen the open-source community must step it up, and strive to be the serious competitor they wish to be treated as.\n\n**Update (9/1): **Not quite \"focus-group tested ammunition,\" but in a sort of meta-dogfooding, I took a stab at articulating \"[Why WordPress][19].\" Edits welcome.\n\nNotes:\n\n[^1]: Penenberg, Adam L. (2009-09-25). [ViralLoop: From Facebook to Twitter][20], How Today (p. 220). Hyperion. Kindle Edition. [21]\n[^2]: This could arguably be, because the automobile industry has seen little innovation in the past 40 years. Beyond keyless entry and GPS, cars today are in many ways functionally equivalent to their 1970′s counterparts. [22]\n[^3]: *See e.g, *[Facebook][23], [Gawker][24], [Twitter][25]. [26]\n[^4]: Full disclosure, some may argue that I myself risk falling off the bleeding edge of the technology adoption curve, after all, I text in [beta][27], browse in [canary][28], and publish in [trunk][29]. [30]\n[^5]: *See, e.g.,* Facebook using PHP, Twitter using Hadoop, and Google supporting Android and Chrome. [31]\n[^6]: *See, e.g., [bloodletting][32]. [33]</li></ol></div>\n\n [1]: #note-2020-1 \"Penenberg, Adam L. (2009-09-25). ViralLoop: From Facebook to Twitter, How Today (p. 220). Hyperion. Kindle Edition.\"\n [2]: #note-2020-2 \"This could arguably be, because the automobile industry has seen little innovation in the past 40 years. Beyond keyless entry and GPS, cars today are in many ways functionally equivalent to their 1970′s counterparts.\"\n [3]: #note-2020-3 \"See e.g, Facebook, Gawker, Twitter.\"\n [4]: #note-2020-4 \"Full disclosure, some may argue that I myself risk falling off the bleeding edge of the technology adoption curve, after all, I text in beta, browse in canary, and publish in trunk.\"\n [5]: http://opensource.sys-con.com/node/692407\n [6]: http://www.infoworld.com/d/security-central/gartner-seven-cloud-computing-security-risks-853\n [7]: http://searchnetworking.techtarget.com/news/1381193/IT-job-security-fears-over-cloud-computing-Network-jobs-still-vital\n [8]: http://www.lexjansen.com/pharmasug/2000/techtech/tt16.pdf\n [9]: http://en.wikipedia.org/wiki/Betamax\n [10]: http://www.google.com/apps/intl/en/business/messaging_value.html\n [11]: http://googleenterprise.blogspot.com/2009/07/paving-road-to-apps-adoption-in-large.html\n [12]: #note-2020-5 \"See, e.g., Facebook using PHP, Twitter using Hadoop, and Google supporting Android and Chrome.\"\n [13]: http://www.amazon.com/Wealth-Networks-Production-Transforms-Markets/dp/0300110561\n [14]: http://www.mindtools.com/pages/article/newPPM_82.htm\n [15]: http://www.amazon.com/Solution-Selling-Creating-Difficult-Markets/dp/0786303158\n [16]: #note-2020-6 \"See, e.g., bloodletting.\"\n [17]: http://sharepoint.microsoft.com/en-us/product/benefits/Pages/default.aspx\n [18]: https://encrypted.google.com/webhp?oei=4HNeTqaVEsb50gGCldE7#sclient=psy&hl=en&newwindow=1&site=webhp&source=hp&q=Why+Wordpress%3F+site%3Awordpress.org&pbx=1&oq=Why+Wordpress%3F+site:wordpress.org&aq=f&aqi=&aql=&gs_sm=e&gs_upl=3748l3748l0l4002l1l1l0l0l0l0l128l128l0.1l1l0&qscrl=1&bav=on.2,or.r_gc.r_pw.&fp=4bf87fb63526ad5b&biw=1123&bih=733\n [19]: http://ben.balter.com/2011/09/01/why-wordpress/\n [20]: http://www.amazon.com/Viral-Loop-Facebook-Businesses-Themselves/dp/1401323499\n \n \n [23]: http://www.petitiononline.com/ada4305/petition.html\n [24]: http://www.aolnews.com/2011/02/07/gawker-redesign-does-not-exactly-thrill-the-internet/\n [25]: http://www.businessweek.com/magazine/content/10_40/b4197036693152.htm\n \n [27]: http://developer.apple.com/\n [28]: http://tools.google.com/dlpage/chromesxs\n [29]: http://wordpress.org/download/svn/\n \n \n [32]: http://en.wikipedia.org/wiki/Bloodletting","previous":"<p>Google recently added <a href='http://mashable.com/2011/06/30/google-analytics-social-plugin/'>social engagement tracking</a> to its analytics suite. With a little bit of leg work, Google Analytics can track not only +1s, but also Facebook and Twitter shares via a simple <code>_gaq.push</code> call.</p>\n\n<p>If your site uses WordPress&#8217;s JetPack plugin with Sharedaddy, and you already have <a href='http://yoast.com/wordpress/google-analytics/'>Google Analytics</a> up and running, you can use jQuery to attach the virtual event to the share button.</p>\n\n<p>To add Google Analytics to Sharedaddy&#8217;s Twitter share button:</p>\n<div>{% highlight javascript %}\n$('a.share-twitter').click( function() {\n_gaq.push( ['_trackSocial', 'twitter', 'share',\n$(this).attr('href').substr(0, $(this).attr('href').indexOf('?'))]);\n});{% endhighlight %}</div>\n<p>…and for Facebook:</p>\n<div>{% highlight javascript %}\n$('a.share-facebook').click( function() {\n_gaq.push( ['_trackSocial', 'faceboook', 'share',\n$(this).attr('href').substr(0, $(this).attr('href').indexOf('?'))]);\n});{% endhighlight %}</div>\n<p>The above code simply listens for the share button to be clicked, and if so, passes the target URL back to Google, along with the service&#8217;s name. Putting it all together into a plugin with a hook to <del>`wp_head`</del> <code>wp_footer</code> you get:</p>\n<script src='https://gist.github.com/1058469.js'> </script>\n<p>The code should work out of the box with the standard share buttons (seen below), but can easily be adapted with a few minor modifications to apply to like and other iterations of the social media icons.</p>\n\n<p>More details on the tracking code can be found over in the <a href='http://code.google.com/apis/analytics/docs/tracking/gaTrackingSocial.html'>Google Analytics Social Engagement Documentation</a>. Improve the code to work with your site? Feel free to <a href='https://gist.github.com/1058469'>fork the gist</a> and contribute it back.</p>\n\n<p><strong>Update:</strong> Dedicated reader All-around rabble-rouser <a href='http://andrewnacin.com'>Andrew Nacin</a> points out that by default, jQuery is queued up into the footer. Updated the above code to hook into <code>wp_footer</code> with a priority of 20 (higher than jQuery&#8217;s 10 hook).</p>\n\n<p><strong>Update:</strong> Special thanks to <a href='http://twitter.com/Ramoonus'>@Ramoonus</a> for <a href='https://gist.github.com/1058469/db96b6836f279811205bddbf8be67bec6ca2159c'>didn&#8217;t queue up jQuery</a>.</p>","content":"<p><a href='http://wordpress.org/extend/plugins/wp-document-revisions/'>WP Document Revisions</a> is a <a href='http://en.wikipedia.org/wiki/Document_management_system'>document management</a> and <a href='http://en.wikipedia.org/wiki/Revision_control'>version control</a> plugin. Built for time-sensitive and mission-critical projects, teams can collaboratively edit files of any format — text documents, spreadsheets, images, sheet music… anything — all the while, seamlessly tracking the document&#8217;s progress as it moves through your organization&#8217;s existing workflow.</p>\n\n<p><a href='http://ben.balter.com/wp-content/uploads/2011/07/wp-document-revisions-screen-shot.png'><img alt='WP Document Revisions Screenshot' class='alignright' src='http://ben.balter.com/wp-content/uploads/2011/07/wp-document-revisions-screen-shot-300x226.png\n' /></a></p>\n\n<p><strong>WP Document Revisions is three things:</strong></p>\n\n<ol>\n<li>A <strong>document management system</strong> (DMS), to track, store, and organize files of any format</li>\n\n<li>A <strong>collaboration tool</strong> to empower teams to collaboratively draft, edit, and refine documents</li>\n\n<li>A <strong>file hosting solution</strong> to publish and securely deliver files to a team, to clients, or to the public</li>\n</ol>\n<iframe allowfullscreen='true' frameborder='0' height='315' src='http://www.youtube.com/embed/VpsTNSiJKis' width='560'>     </iframe>\n<p><strong>Powerful Collaboration Tools</strong> - <em>With great power does not have to come great complexity.</em> Based on a simple philosophy of putting powerful but intuitive tools in the hands of managers and content creators, WP Document Revisions leverages many of the essential WordPress features that, for more than eight years, have been tested and proven across countless industries — posts, attachments, revisions, taxonomies, authentication, and permalinks — to make collaborating on the creation and publication of documents a natural endeavor. Think of it as an <a href='http://ben.balter.com/2011/04/04/when-all-you-have-is-a-pair-of-bolt-cutters/'>open-source and more intuitive version</a> of the popular Microsoft collaboration suite, <a href='http://sharepoint.microsoft.com/en-us/Pages/default.aspx'>Sharepoint.</a></p>\n\n<p><strong>Document History</strong> - At each step of the authoring process, WP Document Revisions gives you an instant snapshot of your team&#8217;s progress and the document&#8217;s history. It even gives you the option to revert back to a previous revision — so don&#8217;t fret if you make a mistake — or receive updates on changes to the document right in your favorite feed reader.</p>\n\n<p><strong>Access Control</strong> - Each document is given a persistent URL (e.g., yourcompany.com/documents/2011/08/TPS-Report.doc) which can be private (securely delivered only to members of your organization), password protected (available only to those you select such as clients or contractors), or public (published and hosted for the world to see). If you catch a typo and upload a new version, that URL will continue to point to the latest version, regardless of how many changes you make.</p>\n\n<p><strong>Enterprise Security</strong> - Worried about storing propriety or sensitive information? WP Document Revisions was built from the first line of code with government- and enterprise-grade security in mind. Each file is masked behind an anonymous 128-bit <a href='http://en.wikipedia.org/wiki/MD5'>MD5 hash</a> as soon as it touches the server, and requests for files are transparently routed through WordPress&#8217;s time-tested URL rewriting, authentication, and permission systems (which can even <a href='http://wordpress.org/extend/plugins/active-directory-integration/'>integrate with existing enterprise active directory</a> or <a href='http://wordpress.org/extend/plugins/simple-ldap-login/'>LDAP servers</a>). Need more security? WP Document Revisions allows you to store documents in a folder above the <code>htdocs</code> or <code>public_html</code> <a href='http://httpd.apache.org/docs/2.0/mod/core.html#documentroot'>web root</a>, further ensuring that only those you authorize have access to your work.</p>\n\n<p><strong>Customization</strong> - WP Document Revisions recognizes that no two teams are identical, and as a result, molds to your firm&#8217;s needs, not the other way around. Need to track additional information associated with a document? Departments, editors, issues, sections, even arbitrary key-value pairs – whatever you can throw at it, it can handle. Development and customization costs are further minimized by its extensive plugin API, and the <a href='http://themergency.com/generators/wordpress-custom-taxonomy/'>WordPress Custom Taxonomy Generator</a> makes it easy for even the uninitiated to add custom taxonomies to documents. Need an audit trail to track check-ins and check-outs? User-level permissions based on the document&#8217;s state or another custom taxonomy? Support for third-party encryption? Check out the <a href='https://github.com/benbalter/WP-Document-Revisions-Code-Cookbook'>WP Document Revisions Code Cookbook</a> for sample code. Looking for even more advanced control of your workflow? WP Document Revisions will detect the popular workflow plugin <a href='http://editflow.org/'>Edit Flow</a>, if installed, and will automatically pull <a href='http://ben.balter.com/2011/10/24/advanced-workflow-management-tools-for-wp-document-revisions/'>Edit Flow&#8217;s advanced workflow management tools</a> into WP Document Revisions. Simply put, virtually every aspect of the plugin&#8217;s functionality from workflow states to user-level permissions can be fully customized to your team&#8217;s unique needs.</p>\n\n<p><strong>Future Proof</strong> - Switching costs a concern? WP Document Revisions is built with tomorrow&#8217;s uncertainty in mind. Equally at home in an in-house server room as it is in the cloud, moving individual files or entire document repositories in and out of WP Document Revisions is a breeze (history and all). And since the software is open-source, you can easily add tools to automate the process of moving to or integrating with future third-party systems.</p>\n\n<p><strong>The Vitals:</strong></p>\n\n<ul>\n<li>Support for any file type (docs, spreadsheets, images, PDFs — anything!)</li>\n\n<li>Securely stores unlimited revisions of your business&#8217;s essential files</li>\n\n<li>Provides a full file history in the form of a revision log, accessible via RSS</li>\n\n<li>Helps you track and organize documents as they move through your organization&#8217;s existing workflow</li>\n\n<li>Each file gets a permanent, authenticated URL that always points to the latest version</li>\n\n<li>Each revision gets its own unique url (e.g.,TPS-Report-revision-3.doc) accessible only to those you deem</li>\n\n<li>Files are intuitively checked out and locked to prevent revisions from colliding</li>\n\n<li>Toggle documents between public, private, and password protected with a single mouse click</li>\n\n<li>Runs in-house or in the cloud</li>\n\n<li>Secure: filenames are hashed on upload and files are only accessible through WordPress&#8217;s proven authentication system</li>\n\n<li>Can move document upload folder to location outside of web root to further ensure government- and enterprise-grade security</li>\n\n<li>Documents and Revisions shortcodes, Recently Revised Documents widget</li>\n\n<li>Multisite and Windows (XAMPP) support</li>\n\n<li>French and Spanish language support (easily translated to your language)</li>\n\n<li>Integration with <a href='http://editflow.org/'>Edit Flow</a></li>\n</ul>\n\n<p><strong>Features Available via the <a href='https://github.com/benbalter/WP-Document-Revisions-Code-Cookbook'>Code Cookbook</a>:</strong></p>\n\n<ul>\n<li><strong>Audit Trail</strong> - creates check in / check out audit trail for all documents</li>\n\n<li><strong>State Permissions</strong> - allows setting user-level permissions based on a custom taxonomy such as workflow state or other document status</li>\n\n<li><strong>Third Party Encryption</strong> - example of how to integrate at rest encryption using third-party tools</li>\n\n<li><strong>Rename Documents</strong> - changes all references to &#8220;Documents&#8221; in the interface to any label of your choosing</li>\n\n<li><strong>State Change Notification</strong> - how to use document api to allow users to receive notification whenever documents change workflow state</li>\n\n<li><strong>Bulk Import</strong> - how to batch import a directory (or other list) of files as documents</li>\n\n<li><strong>Filetype Taxonomy</strong> - Adds support to filter by filetype</li>\n\n<li><strong>Track Changes</strong> - Auto-generates and appends revision summaries for changes to taxonomies, title, and visibility</li>\n\n<li><strong>Remove Workflow States</strong> - Completely removes Workflow state taxonomy backend and UI</li>\n\n<li><strong>Change Tracker</strong> - Auto-generates and appends revision summaries for changes to taxonomies, title, and visibility</li>\n</ul>\n\n<p><strong>Translations:</strong></p>\n\n<ul>\n<li>French - <a href='http://omnimaki.com/'>Hubert CAMPAN</a></li>\n\n<li>Spanish - <a href='http://www.tradiart.com/'>TradiArt</a></li>\n</ul>\n\n<p><strong>Links</strong>:</p>\n\n<ul>\n<li><a href='https://github.com/benbalter/WP-Document-Revisions/'>Source Code</a> (GitHub)</li>\n\n<li><a href='https://github.com/benbalter/WP-Document-Revisions/tree/develop'>Development version</a> (<a href='http://travis-ci.org/#!/benbalter/WP-Document-Revisions'>Build Status</a>)</li>\n\n<li><a href='https://github.com/benbalter/WP-Document-Revisions-Code-Cookbook'>Code Cookbook</a></li>\n\n<li><a href='http://translations.benbalter.com/projects/wp-document-revisions/'>Translations</a> (GlotPres)</li>\n\n<li><a href='http://wordpress.org/tags/wp-document-revisions'>User support forums</a></li>\n\n<li><a href='https://github.com/benbalter/WP-Document-Revisions/issues'>Submit a bug/feature request</a><a href='http://ben.balter.com/wp-content/uploads/2011/08/wp-document-revisions.png'><br /></a></li>\n</ul>\n\n<p>Questions? Comments? Many may have already been addressed in <a href='http://wordpress.org/extend/plugins/wp-document-revisions/faq/'>the WP Document Revisions FAQ</a>, or feel free to simply leave a reply below.</p>\n\n<p><strong>Give it a try today.</strong><br /><a href='http://wordpress.org/extend/plugins/wp-document-revisions/'>Download WP Document Revisions</a> from the WordPress Plugin Repository</p>\n\n<p><em>WP Document Revisions was developed by a <a href='http://ben.balter.com'>law student and a business student</a> with a <a href='http://code.google.com/soc/'>grant from Google</a>, and in close coordination with and under the watchful eye of WordPress.org&#8217;s lead developers.</em> <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> <em>Special thanks to <a href='http://joncave.co.uk/'>Jon Cave</a>, <a href='http://aaron.jorb.in/'>Aaron Jorbin</a>, <a href='http://mitcho.com/'>Mitcho Erlewine</a>, and <a href='http://andrewnacin.com/'>Andrew Nacin</a> for their guidance.</em></p>\n\n<p><strong>Update (6/12): Comments have been closed in favor of <a href='https://github.com/benbalter/WP-Document-Revisions/wiki/Where-to-get-Support-or-Report-an-Issue'>expanded support and discussion options</a>. Additional documentation about the project can now be found in the <a href='https://github.com/benbalter/WP-Document-Revisions/wiki'>Project Wiki</a>. If you are interested in joining the project at any level of technical expertise, please see <a href='https://github.com/benbalter/WP-Document-Revisions/wiki/How-to-Contribute'>How to Contribute</a>.</strong></p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>Neither relationship should imply a formal endorsement.</p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li></ol></div>"}