{"author":"Benjamin J. Balter","title":"WP Document Revisions — Document Management & Version Control for WordPress","excerpt":"WP Document Revisions is a document management and version control plugin for the popular content management system, WordPress. Think of it as an open-source and more intuitive version of the popular Microsoft collaboration suite, Sharepoint.\n","layout":"post","categories":["Business","Law","Technology"],"tags":["code","collaboration","document management","enterprise","file hosting","government","gsoc","open source","plugin","sharepoint","version control","wordpress","workflow"],"post_format":[],"related_posts":[{"url":"/2010/09/12/wordpress-resume-plugin/","id":"/2010/09/12/wordpress-resume-plugin","title":"WordPress Resume Plugin"},{"url":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party/","id":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party","title":"New Media Flak: Megaphone vs. Cocktail Party"},{"url":"/2010/10/10/does-every-cloud-have-a-silver-lining/","id":"/2010/10/10/does-every-cloud-have-a-silver-lining","title":"Does Every Cloud Have a Silver Lining?"},{"url":"/2010/11/06/removing-the-barriers-to-organizational-agility/","id":"/2010/11/06/removing-the-barriers-to-organizational-agility","title":"Removing the Barriers to Organizational Agility\n"},{"url":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing/","id":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing","title":"What Fourteen-Century Apple Pie Teaches Us About Sharing\n"},{"url":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds/","id":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds","title":"Will Federal Contracting Officers Soon Have Their Heads in the Clouds?\n"},{"url":"/2010/11/29/free-trade-in-china-just-google-it/","id":"/2010/11/29/free-trade-in-china-just-google-it","title":"Free Trade in China? Just Google it."},{"url":"/2010/11/29/twitter-mentions-as-comments/","id":"/2010/11/29/twitter-mentions-as-comments","title":"Twitter Mentions as Comments WordPress Plugin\n"},{"url":"/2010/12/01/the-internet-is-series-of-tubes/","id":"/2010/12/01/the-internet-is-series-of-tubes","title":"The Internet is Series of Tubes (oh, and Tollgates too)\n"},{"url":"/2010/12/20/late-night-infomercials/","id":"/2010/12/20/late-night-infomercials","title":"Late-Night Infomercials: Guaranteed to Extend the 4th Amendment or Your Money Back"}],"url":"/2011/08/29/wp-document-revisions-document-management-version-control-wordpress/","date":"2011-08-29 00:00:00 +0000","id":"/2011/08/29/wp-document-revisions-document-management-version-control-wordpress","next":"/2011/08/31/enterprise-open-source-and-why-better-is-not-enough","previous":"/2011/06/30/google-analytics-tracking-of-jetpack-sharedaddy-social-engagement","content":"<p><a href='http://wordpress.org/extend/plugins/wp-document-revisions/'>WP Document Revisions</a> is a <a href='http://en.wikipedia.org/wiki/Document_management_system'>document management</a> and <a href='http://en.wikipedia.org/wiki/Revision_control'>version control</a> plugin. Built for time-sensitive and mission-critical projects, teams can collaboratively edit files of any format — text documents, spreadsheets, images, sheet music… anything — all the while, seamlessly tracking the document&#8217;s progress as it moves through your organization&#8217;s existing workflow.</p>\n\n<p><a href='http://ben.balter.com/wp-content/uploads/2011/07/wp-document-revisions-screen-shot.png'><img alt='WP Document Revisions Screenshot' class='alignright' src='http://ben.balter.com/wp-content/uploads/2011/07/wp-document-revisions-screen-shot-300x226.png\n' /></a></p>\n\n<p><strong>WP Document Revisions is three things:</strong></p>\n\n<ol>\n<li>A <strong>document management system</strong> (DMS), to track, store, and organize files of any format</li>\n\n<li>A <strong>collaboration tool</strong> to empower teams to collaboratively draft, edit, and refine documents</li>\n\n<li>A <strong>file hosting solution</strong> to publish and securely deliver files to a team, to clients, or to the public</li>\n</ol>\n<iframe allowfullscreen='true' frameborder='0' height='315' src='http://www.youtube.com/embed/VpsTNSiJKis' width='560'>     </iframe>\n<p><strong>Powerful Collaboration Tools</strong> - <em>With great power does not have to come great complexity.</em> Based on a simple philosophy of putting powerful but intuitive tools in the hands of managers and content creators, WP Document Revisions leverages many of the essential WordPress features that, for more than eight years, have been tested and proven across countless industries — posts, attachments, revisions, taxonomies, authentication, and permalinks — to make collaborating on the creation and publication of documents a natural endeavor. Think of it as an <a href='http://ben.balter.com/2011/04/04/when-all-you-have-is-a-pair-of-bolt-cutters/'>open-source and more intuitive version</a> of the popular Microsoft collaboration suite, <a href='http://sharepoint.microsoft.com/en-us/Pages/default.aspx'>Sharepoint.</a></p>\n\n<p><strong>Document History</strong> - At each step of the authoring process, WP Document Revisions gives you an instant snapshot of your team&#8217;s progress and the document&#8217;s history. It even gives you the option to revert back to a previous revision — so don&#8217;t fret if you make a mistake — or receive updates on changes to the document right in your favorite feed reader.</p>\n\n<p><strong>Access Control</strong> - Each document is given a persistent URL (e.g., yourcompany.com/documents/2011/08/TPS-Report.doc) which can be private (securely delivered only to members of your organization), password protected (available only to those you select such as clients or contractors), or public (published and hosted for the world to see). If you catch a typo and upload a new version, that URL will continue to point to the latest version, regardless of how many changes you make.</p>\n\n<p><strong>Enterprise Security</strong> - Worried about storing propriety or sensitive information? WP Document Revisions was built from the first line of code with government- and enterprise-grade security in mind. Each file is masked behind an anonymous 128-bit <a href='http://en.wikipedia.org/wiki/MD5'>MD5 hash</a> as soon as it touches the server, and requests for files are transparently routed through WordPress&#8217;s time-tested URL rewriting, authentication, and permission systems (which can even <a href='http://wordpress.org/extend/plugins/active-directory-integration/'>integrate with existing enterprise active directory</a> or <a href='http://wordpress.org/extend/plugins/simple-ldap-login/'>LDAP servers</a>). Need more security? WP Document Revisions allows you to store documents in a folder above the <code>htdocs</code> or <code>public_html</code> <a href='http://httpd.apache.org/docs/2.0/mod/core.html#documentroot'>web root</a>, further ensuring that only those you authorize have access to your work.</p>\n\n<p><strong>Customization</strong> - WP Document Revisions recognizes that no two teams are identical, and as a result, molds to your firm&#8217;s needs, not the other way around. Need to track additional information associated with a document? Departments, editors, issues, sections, even arbitrary key-value pairs – whatever you can throw at it, it can handle. Development and customization costs are further minimized by its extensive plugin API, and the <a href='http://themergency.com/generators/wordpress-custom-taxonomy/'>WordPress Custom Taxonomy Generator</a> makes it easy for even the uninitiated to add custom taxonomies to documents. Need an audit trail to track check-ins and check-outs? User-level permissions based on the document&#8217;s state or another custom taxonomy? Support for third-party encryption? Check out the <a href='https://github.com/benbalter/WP-Document-Revisions-Code-Cookbook'>WP Document Revisions Code Cookbook</a> for sample code. Looking for even more advanced control of your workflow? WP Document Revisions will detect the popular workflow plugin <a href='http://editflow.org/'>Edit Flow</a>, if installed, and will automatically pull <a href='http://ben.balter.com/2011/10/24/advanced-workflow-management-tools-for-wp-document-revisions/'>Edit Flow&#8217;s advanced workflow management tools</a> into WP Document Revisions. Simply put, virtually every aspect of the plugin&#8217;s functionality from workflow states to user-level permissions can be fully customized to your team&#8217;s unique needs.</p>\n\n<p><strong>Future Proof</strong> - Switching costs a concern? WP Document Revisions is built with tomorrow&#8217;s uncertainty in mind. Equally at home in an in-house server room as it is in the cloud, moving individual files or entire document repositories in and out of WP Document Revisions is a breeze (history and all). And since the software is open-source, you can easily add tools to automate the process of moving to or integrating with future third-party systems.</p>\n\n<p><strong>The Vitals:</strong></p>\n\n<ul>\n<li>Support for any file type (docs, spreadsheets, images, PDFs — anything!)</li>\n\n<li>Securely stores unlimited revisions of your business&#8217;s essential files</li>\n\n<li>Provides a full file history in the form of a revision log, accessible via RSS</li>\n\n<li>Helps you track and organize documents as they move through your organization&#8217;s existing workflow</li>\n\n<li>Each file gets a permanent, authenticated URL that always points to the latest version</li>\n\n<li>Each revision gets its own unique url (e.g.,TPS-Report-revision-3.doc) accessible only to those you deem</li>\n\n<li>Files are intuitively checked out and locked to prevent revisions from colliding</li>\n\n<li>Toggle documents between public, private, and password protected with a single mouse click</li>\n\n<li>Runs in-house or in the cloud</li>\n\n<li>Secure: filenames are hashed on upload and files are only accessible through WordPress&#8217;s proven authentication system</li>\n\n<li>Can move document upload folder to location outside of web root to further ensure government- and enterprise-grade security</li>\n\n<li>Documents and Revisions shortcodes, Recently Revised Documents widget</li>\n\n<li>Multisite and Windows (XAMPP) support</li>\n\n<li>French and Spanish language support (easily translated to your language)</li>\n\n<li>Integration with <a href='http://editflow.org/'>Edit Flow</a></li>\n</ul>\n\n<p><strong>Features Available via the <a href='https://github.com/benbalter/WP-Document-Revisions-Code-Cookbook'>Code Cookbook</a>:</strong></p>\n\n<ul>\n<li><strong>Audit Trail</strong> - creates check in / check out audit trail for all documents</li>\n\n<li><strong>State Permissions</strong> - allows setting user-level permissions based on a custom taxonomy such as workflow state or other document status</li>\n\n<li><strong>Third Party Encryption</strong> - example of how to integrate at rest encryption using third-party tools</li>\n\n<li><strong>Rename Documents</strong> - changes all references to &#8220;Documents&#8221; in the interface to any label of your choosing</li>\n\n<li><strong>State Change Notification</strong> - how to use document api to allow users to receive notification whenever documents change workflow state</li>\n\n<li><strong>Bulk Import</strong> - how to batch import a directory (or other list) of files as documents</li>\n\n<li><strong>Filetype Taxonomy</strong> - Adds support to filter by filetype</li>\n\n<li><strong>Track Changes</strong> - Auto-generates and appends revision summaries for changes to taxonomies, title, and visibility</li>\n\n<li><strong>Remove Workflow States</strong> - Completely removes Workflow state taxonomy backend and UI</li>\n\n<li><strong>Change Tracker</strong> - Auto-generates and appends revision summaries for changes to taxonomies, title, and visibility</li>\n</ul>\n\n<p><strong>Translations:</strong></p>\n\n<ul>\n<li>French - <a href='http://omnimaki.com/'>Hubert CAMPAN</a></li>\n\n<li>Spanish - <a href='http://www.tradiart.com/'>TradiArt</a></li>\n</ul>\n\n<p><strong>Links</strong>:</p>\n\n<ul>\n<li><a href='https://github.com/benbalter/WP-Document-Revisions/'>Source Code</a> (GitHub)</li>\n\n<li><a href='https://github.com/benbalter/WP-Document-Revisions/tree/develop'>Development version</a> (<a href='http://travis-ci.org/#!/benbalter/WP-Document-Revisions'>Build Status</a>)</li>\n\n<li><a href='https://github.com/benbalter/WP-Document-Revisions-Code-Cookbook'>Code Cookbook</a></li>\n\n<li><a href='http://translations.benbalter.com/projects/wp-document-revisions/'>Translations</a> (GlotPres)</li>\n\n<li><a href='http://wordpress.org/tags/wp-document-revisions'>User support forums</a></li>\n\n<li><a href='https://github.com/benbalter/WP-Document-Revisions/issues'>Submit a bug/feature request</a><a href='http://ben.balter.com/wp-content/uploads/2011/08/wp-document-revisions.png'><br /></a></li>\n</ul>\n\n<p>Questions? Comments? Many may have already been addressed in <a href='http://wordpress.org/extend/plugins/wp-document-revisions/faq/'>the WP Document Revisions FAQ</a>, or feel free to simply leave a reply below.</p>\n\n<p><strong>Give it a try today.</strong><br /><a href='http://wordpress.org/extend/plugins/wp-document-revisions/'>Download WP Document Revisions</a> from the WordPress Plugin Repository</p>\n\n<p><em>WP Document Revisions was developed by a <a href='http://ben.balter.com'>law student and a business student</a> with a <a href='http://code.google.com/soc/'>grant from Google</a>, and in close coordination with and under the watchful eye of WordPress.org&#8217;s lead developers.</em> <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> <em>Special thanks to <a href='http://joncave.co.uk/'>Jon Cave</a>, <a href='http://aaron.jorb.in/'>Aaron Jorbin</a>, <a href='http://mitcho.com/'>Mitcho Erlewine</a>, and <a href='http://andrewnacin.com/'>Andrew Nacin</a> for their guidance.</em></p>\n\n<p><strong>Update (6/12): Comments have been closed in favor of <a href='https://github.com/benbalter/WP-Document-Revisions/wiki/Where-to-get-Support-or-Report-an-Issue'>expanded support and discussion options</a>. Additional documentation about the project can now be found in the <a href='https://github.com/benbalter/WP-Document-Revisions/wiki'>Project Wiki</a>. If you are interested in joining the project at any level of technical expertise, please see <a href='https://github.com/benbalter/WP-Document-Revisions/wiki/How-to-Contribute'>How to Contribute</a>.</strong></p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>Neither relationship should imply a formal endorsement.</p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li></ol></div>"}