{"author":"Benjamin J. Balter","title":"The Files \"in\" the Computer -- Zoolander and the California Supreme Court","excerpt":"Imagine if a routine traffic stop, say, for failure to signal or wear a seat belt would place in the state's hands every e-mail you've ever sent, contact your ever met, or financial transaction your ever completed. The California Supreme Court ruled in favor of just that.","layout":"post","categories":["Law","Technology"],"tags":["cloud computing","digital due process","generation gap","privacy"],"post_format":[],"related_posts":[{"url":"/2010/09/12/wordpress-resume-plugin/","id":"/2010/09/12/wordpress-resume-plugin","title":"WordPress Resume Plugin"},{"url":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party/","id":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party","title":"New Media Flak: Megaphone vs. Cocktail Party"},{"url":"/2010/10/10/does-every-cloud-have-a-silver-lining/","id":"/2010/10/10/does-every-cloud-have-a-silver-lining","title":"Does Every Cloud Have a Silver Lining?"},{"url":"/2010/11/06/removing-the-barriers-to-organizational-agility/","id":"/2010/11/06/removing-the-barriers-to-organizational-agility","title":"Removing the Barriers to Organizational Agility\n"},{"url":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing/","id":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing","title":"What Fourteen-Century Apple Pie Teaches Us About Sharing\n"},{"url":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds/","id":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds","title":"Will Federal Contracting Officers Soon Have Their Heads in the Clouds?\n"},{"url":"/2010/11/29/free-trade-in-china-just-google-it/","id":"/2010/11/29/free-trade-in-china-just-google-it","title":"Free Trade in China? Just Google it."},{"url":"/2010/11/29/twitter-mentions-as-comments/","id":"/2010/11/29/twitter-mentions-as-comments","title":"Twitter Mentions as Comments WordPress Plugin\n"},{"url":"/2010/12/01/the-internet-is-series-of-tubes/","id":"/2010/12/01/the-internet-is-series-of-tubes","title":"The Internet is Series of Tubes (oh, and Tollgates too)\n"},{"url":"/2010/12/20/late-night-infomercials/","id":"/2010/12/20/late-night-infomercials","title":"Late-Night Infomercials: Guaranteed to Extend the 4th Amendment or Your Money Back"}],"url":"/2011/01/04/the-files-in-the-computer/","date":"2011-01-04 00:00:00 +0000","id":"/2011/01/04/the-files-in-the-computer","next":"/2011/01/11/twitter-goes-to-bat-for-wikileaks","previous":"/2010/12/20/late-night-infomercials","content":"<p><img alt='Policeman Checks Cellphone' src='http://cdn.benbalter.com/wp-content/uploads/2011/01/policeman.jpg' /></p>\n\n<p>When drafting and interpreting the fourth amendment, neither the founding fathers, nor the countless legal scholars that followed them could have ever imagined that one day technology would allow us to walk down the street with our entire life chronicled in our pocket. The growing popularity of the cloud coupled with increasing power of smart phones has resulted in what not too long ago was tool for placing and receiving calls, today, in actuality, is a portal to one&#8217;s entire digital life. Imagine if a routine traffic stop, say, for failing to signal properly, would place in the state&#8217;s hands every e-mail you have ever sent, contact you have ever met, or financial transaction you have ever completed (not to mention your current <a href='http://en.wikipedia.org/wiki/Angry_Birds'>Angry Birds</a> score!). Regardless of how Orwellian it may sound, the California Supreme Court <a href='http://arstechnica.com/tech-policy/news/2011/01/warrantless-cell-phone-search-gets-a-green-light-in-california.ars?comments=1#comments-bar'>ruled in favor of just such an outcome</a>.</p>\n\n<p>In <em><a href='http://www.courtinfo.ca.gov/opinions/documents/S166600.PDF'>People v. Diaz</a></em>, the court ruled that a warrentless search of text messages on a cell phone confiscated subsequent to a lawful arrest did infact, constitute a valid search. While the dissent realized that mobile phones were increasingly becoming the hubs of our digital world, noting that the decision gave &#8221;<em>carte blanche, with no showing of exigency, to rummage at leisure through the wealth of personal and business information that can be carried on a mobile phone or handheld computer merely because the device was taken from an arrestee&#8217;s person,</em>&#8221; I do not believe they fully grasped the gravity of the ruling. <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup></p>\n\n<p><img alt='' src='http://cdn.benbalter.com/wp-content/uploads/2011/01/zoolander-300x188.jpg' /><a href='http://www.youtube.com/watch?v=_m_PncKuDao&amp;feature=related#t=1m16s'>Much like Ben Stiller and Owen Wilson&#8217;s characters in the movie Zoolander</a>, the dissent&#8217;s analysis is based on the assumption that information &#8220;can be carried on&#8221; or &#8220;in&#8221; one&#8217;s mobile phone, a reality which simply is not the case in today&#8217;s increasingly cloud-centric world.</p>\n\n<p>Today, and even more so tomorrow, information will not be &#8220;carried on&#8221; a phone, but rather, that phone will merely be the vehicle used to access information stored elsewhere, information that would otherwise carry the highest expectation of privacy. Put another way, the device holds, both literally and metaphorically, the address, keys, and means to access one&#8217;s digital home, a breach of privacy that would not be tolerated if it occurred in a more tangible sense.</p>\n\n<p>In a world where in reality, nearly every e-mail I have ever sent or received can be accessed by opening a folder on my phone virtually indistinguishable <sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> from any neighboring folder that contains locally stored information, the majority&#8217;s interpretation grants the state access to nearly everything one says or does on a daily basis. Put another way, how much information do you think <em>won&#8217;t</em> be accessible from your mobile phone in 5 years? 10 years? 20? Just scroll through your home screen. <sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup></p>\n\n<p>The majority&#8217;s decision was well argued by legal minds much wiser than my own, but even reading through the verbiage of the opinion, discussing the nature of containers and cavities as they relate to what is &#8220;in&#8221; the phone, it leads one to believe that their analysis is handicapped by <a href='http://movieclips.com/sgNVB-zoolander-movie-computer-experts/'>outdated concepts of storage and space</a>. <sup id='fnref:4'><a href='#fn:4' rel='footnote'>4</a></sup></p>\n\n<p>While it may not be practical to install <a href='http://en.wikipedia.org/wiki/Faraday_cage'>Faraday cages</a> in every police station to ferret out what information can be gleamed from a mobile device without it querying a remote server (if there is any information at all), the majority&#8217;s opinion fails to take into account the reality of how mobile phones are used today, let alone, how they will be most likely be used in the not-to-distant future. While the courts sort out <a href='http://ben.balter.com/2010/12/20/late-night-infomercials/'>what fourth amendment protections are extended into the digital world</a>, I for one, will be sure to put a password on my phone next time I cross the California state line. <sup id='fnref:5'><a href='#fn:5' rel='footnote'>5</a></sup></p>\n\n<p>[photo: <a href='http://www.flickr.com/photos/thomashawk/61076493/'>Thomas Hawk</a>]</p>\n\n<p>Notes:</p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>While the question has been pondered to some extent, for example, in Professor Kerr&#8217;s 2006 paper <a href='http://papers.ssrn.com/sol3/papers.cfm?abstract_id=697541'>Searches and Seizures in a Digital World</a>, or Professor Gershowitz&#8217;s 2008 paper, <a href='http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1084503'>the iPhone Meets the Fourth Amendment</a>, technology has come a long way, even in the past two years, and will continue to evolve in the years to come.</p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p>Even for the technologically adept, today, it is hard to tell exactly what information exists &#8220;on&#8221; my phone, and what information exists &#8220;in&#8221; the cloud. The subject and sender of an incoming e-mail may be pushed to my iPhone automatically, for example, but the body or attachments may not download until I access the message itself. Today&#8217;s calendar entries may be cached on the device (I wouldn&#8217;t consider my calendar &#8220;stored&#8221; on my device — it&#8217;s not the master copy), but yesterday&#8217;s and tomorrow&#8217;s agendas are both retrieved on demand from a distant server unrelated to any hypothetical search to which I may me subject.</p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p>Beyond the obvious (e-mail, phone, contact, calendars), there&#8217;s <a href='http://itunes.apple.com/us/app/opentable/id296581815?mt=8'>dinner reservations</a>, <a href='http://www.zipcar.com/iphone/'>car rentals</a>, <a href='http://www.engadget.com/2010/11/15/comcast-xfinity-remote-app-for-iphone-ipad-launches-video-stre/'>TV viewing habits</a>, <a href='http://www.mint.com/features/iphone/'>financial data</a>, <a href='http://www.amazon.com/gp/feature.html?ie=UTF8&amp;docId=1000291661'>recent purchases</a>, even <a href='http://www.mozilla.com/en-US/mobile/home/'>desktop browsing history</a> — it&#8217;s like winning the lottery of personal information.</p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li><li id='fn:4'>\n<p>It&#8217;s worth noting that the word &#8220;server&#8221; is not mentioned once in the opinion, yet the phrase &#8220;storage capacity&#8221; is used no less than five times — a concept that <a href='http://mashable.com/2007/05/14/yahoo-mail-unlimited/'>even as early as 2007 was considered a thing of the past</a>.</p>\n<a href='#fnref:4' rev='footnote'>&#8617;</a></li><li id='fn:5'>\n<p>A password may only delay the inevitable. <em>See</em> Gershowitz, Adam M., <a href='http://ssrn.com/abstract=1669403'><em>Password Protected? Can a Password Save Your Cell Phone from the Search Incident to Arrest Doctrine?</em></a> (August 31, 2010).</p>\n<a href='#fnref:5' rev='footnote'>&#8617;</a></li></ol></div>"}