{"title":"What is a 'Hacker'?","excerpt":"Hackers embody sharing, openness, decentralization — coding to improve the world","author":"Benjamin J. Balter","layout":"post","comments":true,"category":"Technology","tags":["Code","Hacker","Hacking","Enterprise","Culture"],"published":true,"related_posts":[{"url":"/2010/09/12/wordpress-resume-plugin/","id":"/2010/09/12/wordpress-resume-plugin","title":"WordPress Resume Plugin"},{"url":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party/","id":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party","title":"New Media Flak: Megaphone vs. Cocktail Party"},{"url":"/2010/10/10/does-every-cloud-have-a-silver-lining/","id":"/2010/10/10/does-every-cloud-have-a-silver-lining","title":"Does Every Cloud Have a Silver Lining?"},{"url":"/2010/11/06/removing-the-barriers-to-organizational-agility/","id":"/2010/11/06/removing-the-barriers-to-organizational-agility","title":"Removing the Barriers to Organizational Agility\n"},{"url":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing/","id":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing","title":"What Fourteen-Century Apple Pie Teaches Us About Sharing\n"},{"url":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds/","id":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds","title":"Will Federal Contracting Officers Soon Have Their Heads in the Clouds?\n"},{"url":"/2010/11/29/free-trade-in-china-just-google-it/","id":"/2010/11/29/free-trade-in-china-just-google-it","title":"Free Trade in China? Just Google it."},{"url":"/2010/11/29/twitter-mentions-as-comments/","id":"/2010/11/29/twitter-mentions-as-comments","title":"Twitter Mentions as Comments WordPress Plugin\n"},{"url":"/2010/12/01/the-internet-is-series-of-tubes/","id":"/2010/12/01/the-internet-is-series-of-tubes","title":"The Internet is Series of Tubes (oh, and Tollgates too)\n"},{"url":"/2010/12/20/late-night-infomercials/","id":"/2010/12/20/late-night-infomercials","title":"Late-Night Infomercials: Guaranteed to Extend the 4th Amendment or Your Money Back"}],"url":"/2013/02/16/what-is-a-hacker/","date":"2013-02-16 00:00:00 +0000","id":"/2013/02/16/what-is-a-hacker","categories":["Technology"],"next":null,"previous":"/2013/02/06/the-next-big-thing-is-already-here","content":"<p>Working in DC, &#8221;<em>hacker</em>&#8221; can often be seen as a four-letter word. I can&#8217;t count the number of times a press aide or government attorney has cringed at seeing it in a draft release, or even worse, in an upcoming event audaciously entitled a &#8220;hackathon&#8221;. To the media and many government types &#8220;hacking&#8221; often conjures up images of malcontents in ski masks crouched over computer screens, but to the rest of the world (and especially the Internet), the term has a very, very different meaning. Heck, even Merriam-Webster <a href='http://www.merriam-webster.com/dictionary/hacker'>defines hacker</a> as:</p>\n\n<ol>\n<li>&#8220;One that hacks&#8221; (defined as &#8220;to write computer programs for enjoyment&#8221;),</li>\n\n<li>&#8220;a person who is inexperienced or unskilled at a particular activity&#8221;, and</li>\n\n<li>&#8220;an expert at programming and solving problems with a computer&#8221;</li>\n</ol>\n\n<p>Being a hacker isn&#8217;t about stealing credit card numbers or disabling public utilities, but rather it&#8217;s the exact opposite. It&#8217;s about embodying all three of those meanings simultaneously. It&#8217;s about sharing, openness, decentralization&#8230; It&#8217;s about trying to satisfy an unquenchable thirst for defying expectations and making the impossible a reality, often involving nothing more than duct tape, bubblegum, and ultimately solutions that purported experts would certainly balk at for being too simplistic.</p>\n\n<p>The term traces its routes all the way back to the 1960s when it emerged to describe a certain playful cleverness of exploration that surrounded those at MIT who openly pushed the limits of the world&#8217;s first computers. Today it continues to embody that ethic as the pursuit of excellence — constantly asking oneself &#8220;is this even possible?&#8221; (and instinctively responding &#8220;let&#8217;s find out!&#8221;). It&#8217;s the intrinsic delight one gets from solving never-before-solved problems and overcoming limits conventional wisdom long-ago presumed too difficult to tackle.</p>\n\n<p>Somewhat surprisingly, hacking isn&#8217;t at all about technology. It&#8217;s about community. Think about it in terms of a hacker ethic, a hacker way, and a hacker culture.</p>\n<!-- more -->\n<h2 id='the_hacker_ethic'>The Hacker Ethic</h2>\n\n<p>Hackers are motivated by a distinct ethos.<sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> It&#8217;s about <strong>sharing</strong>. Hacking requires the ability to take things apart and figure out how they work in the hopes of ultimately improving upon them. It&#8217;s a &#8220;hands on&#8221; imperative that necessitates both access to and the right to fork a project in hopes of building something even more interesting and ultimately bettering what&#8217;s available to all. It&#8217;s about <strong>openness</strong>. Hacking is a group effort, and thus the free flow of information is a necessity to empower hackers to fix, improve, and reinvent. Secrecy simply serves to stifle creative possibility. Freedom of inquiry requires that information be free. It&#8217;s about <strong>decentralization</strong>. The best way to promote the free exchange of information is to have an open system that provides no friction between a hacker and his or her quest for knowledge. By intentionally or unintentionally erecting such barriers, bureaucracies, whether corporate, government, or university, are inherently flawed systems.</p>\n\n<h2 id='the_hacker_way'>The Hacker Way</h2>\n\n<p>But it&#8217;s more than ideology. There&#8217;s a practical side to it as well. There&#8217;s a thirst, a drive. There&#8217;s a constant intellectual itch just begging to be scratched.<sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> <strong>The world is full of problems waiting to be solved</strong>. In the hands of a creative mind, technology can make the world a better place for all. Just as athletes seek delight in pushing their bodies past their physical limits, hackers seek the thrill of pushing tools beyond what is known, what is solved, and what is possible. But that also means that <strong>no problem should ever have to be solved twice</strong>. Creative minds are a valuable, finite resource and shouldn&#8217;t be wasted on re-inventing the wheel when there are other fascinating, unsolved problems waiting to be solved.</p>\n\n<h2 id='hacker_culture'>Hacker Culture</h2>\n\n<p>Hackers embody a unique culture that often flies in the face of traditional paradigms. It&#8217;s a culture of <strong>meritocracy</strong>. Contribution is the sole currency of the Internet. Money and title bare far less weight than meaningful contributions, be they code, copy, design, whatever. It&#8217;s a culture of <strong>elegance</strong>. Hackers strive for artfully arranged, innovative techniques that perform complicated tasks with as few instructions as possible. and It&#8217;s a culture of <strong>playful cleverness</strong>. There&#8217;s a certain lighthearted cleverness to being a hacker, often expressed by injecting dry wit and memes into otherwise mundane tasks.</p>\n\n<h2 id='hackers_in_the_enterprise'>Hackers in the Enterprise</h2>\n\n<p>It&#8217;s no surprise then, that as the pace of technological innovation quickens, the very bureaucracies that hackers condemn are <a href='http://www.intechnic.com/blog/a-hacker-the-secret-ingredient-your-it-department-lacks/'>beginning to appreciate</a> their ability to consistently deliver high-value projects at little cost. Heck, even the White House recently <a href='http://www.whitehouse.gov/blog/2013/02/05/announcing-we-people-20-and-white-house-hackathon'>announced its first hackathon</a>. But elevating hackers in traditional organizations is not simply another name for &#8220;skunk works,&#8221; just as a hackathon is no excuse for not consistently fostering a culture of innovation. It&#8217;s not about working faster or cheaper.</p>\n\n<p>&#8220;Hacker&#8221; isn&#8217;t just the next hot buzzword, following a long history of &#8220;rock star&#8221;, &#8220;ninja&#8221;, and &#8220;guru&#8221;. Nor is it synonymous with &#8220;cybercriminal&#8221; or imply any nefarious intentions whatsoever. Instead the exact opposite is true. It&#8217;s about embracing an ethos, a drive, a culture. It&#8217;s about coding to improve the world.</p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>As articulated best by <a href='http://www.amazon.com/Hackers-Computer-Revolution-Anniversary-ebook/dp/B003PDMKIY/ref=tmm_kin_title_0&amp;tag=613240924-20'>Steven Levy</a></p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p><em>See</em> <a href='http://www.catb.org/esr/faqs/hacker-howto.html'>Eric S. Raymond</a></p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li></ol></div>"}