{"title":"New Media Fellow, Office of the Managing Director\n","organization":"Federal Communications Commission","section":"Experience","from":"May 2010","to":"January 2012","location":"Washington, D.C.","robots":"noindex, nofollow","category":"resume","layout":"default","url":"/0001/09/01/new-media-fellow/","date":"0001-09-01 00:00:00 -0500","id":"/0001/09/01/new-media-fellow","categories":["resume"],"next":"*   Created enterprise business solutions to automate and streamline business processes in support of the President of the United States as part of the White House’s first-ever agile software development team.\n*   In close coordination with the Office of Federal Financial Management, lead development of [prototypical government-wide, open-source classifieds system][1] for sharing of federal real and other properties among executive agencies.\n*   Regularly met with and presented to C-level executives and key stakeholders to develop and support mission-critical applications including public data collection, White House comment line, goods and services tracking, and employee on-boarding and off-boarding.\n*   Developed application to catalog blackberry SMS and PIN messages to aid E-Discovery team and assure compliance with Federal Records Act, Presidential Records Act, and Freedom of Information Act.\n*   Assisted information assurance teams with application certification and accreditation.\n\n [1]: https://max.gov/unclesamslist/","previous":"<ul>\n<li>With stipend from Google, developed government- and enterprise-friendly, <a href='http://ben.balter.com/2011/08/29/wp-document-revisions-document-management-version-control-wordpress/'>open-source document and workflow management system</a> for WordPress, the content management system that powers nearly a quarter of new websites today. The project has been downloaded more than 10,000 times to date.</li>\n</ul>","tags":[],"content":"<ul>\n<li>Negotiated agency-wide, federal service agreements with the web’s top service providers including FISMA-compliant cloud hosting, social media, data manipulation, source code collaboration, and geospacial firms.</li>\n\n<li>Drafted website privacy policy, comment moderation policy, third-party privacy notices, and API terms of service for agency’s reimagined web presence.</li>\n\n<li>Created legal and technical roadmaps to ensure compliance of new media platforms with White House Office of Management and Budget memorandums M-10-22 and M-10-23 governing federal agencies’ use of website tracking technologies and third-party services.</li>\n\n<li>Supported New Media Team’s procurement efforts, including scope of work, impact statement, and limited source justification drafting.</li>\n\n<li>Received Superior Achievement Award for customer service, quality performance, and overall contribution to the agency mission.</li>\n\n<li>Led adoption, implementation, and analysis of Google Analytics website visitor tracking statistics.</li>\n\n<li>Developed more than 30 in-house software tools including <a href='http://github.com/fcc'>open-source website auditing and site-mapping software</a> instrumental to evaluation of online presence spanning more than 1.2 million pages.</li>\n</ul>"}