{"title":"Deprecate Management","excerpt":"There are many aspects to 'making things' that open source just does better, and does so without traditional management structure.","author":"Benjamin J. Balter","layout":"post","comments":true,"category":"Management","tags":["Open Souce","GitHub","Collaboration"],"published":true,"related_posts":[{"url":"/2010/09/12/wordpress-resume-plugin/","id":"/2010/09/12/wordpress-resume-plugin","title":"WordPress Resume Plugin"},{"url":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party/","id":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party","title":"New Media Flak: Megaphone vs. Cocktail Party"},{"url":"/2010/10/10/does-every-cloud-have-a-silver-lining/","id":"/2010/10/10/does-every-cloud-have-a-silver-lining","title":"Does Every Cloud Have a Silver Lining?"},{"url":"/2010/11/06/removing-the-barriers-to-organizational-agility/","id":"/2010/11/06/removing-the-barriers-to-organizational-agility","title":"Removing the Barriers to Organizational Agility\n"},{"url":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing/","id":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing","title":"What Fourteen-Century Apple Pie Teaches Us About Sharing\n"},{"url":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds/","id":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds","title":"Will Federal Contracting Officers Soon Have Their Heads in the Clouds?\n"},{"url":"/2010/11/29/free-trade-in-china-just-google-it/","id":"/2010/11/29/free-trade-in-china-just-google-it","title":"Free Trade in China? Just Google it."},{"url":"/2010/11/29/twitter-mentions-as-comments/","id":"/2010/11/29/twitter-mentions-as-comments","title":"Twitter Mentions as Comments WordPress Plugin\n"},{"url":"/2010/12/01/the-internet-is-series-of-tubes/","id":"/2010/12/01/the-internet-is-series-of-tubes","title":"The Internet is Series of Tubes (oh, and Tollgates too)\n"},{"url":"/2010/12/20/late-night-infomercials/","id":"/2010/12/20/late-night-infomercials","title":"Late-Night Infomercials: Guaranteed to Extend the 4th Amendment or Your Money Back"}],"url":"/2012/12/16/deprecate-management/","date":"2012-12-16 00:00:00 +0000","id":"/2012/12/16/deprecate-management","categories":["Management"],"next":"/2012/12/26/securing-the-status-quo","previous":"/2012/12/15/why-wordpress-next-version-should-just-give-it-a-rest-already","content":"<p>There are many aspects to &#8220;making things&#8221; that <a href='http://ben.balter.com/2012/10/19/we-ve-been-trained-to-make-paper/'>open source just does better</a>. Regardless of if at the end of the day you ship bits or cogs, certain aspects of &#8220;office&#8221; work are universal: ideation, vetting initiatives, resolving conflicts, and shipping product. Now imagine if you had to do all this not across conference tables, but across geographies and timezones. You&#8217;d have a pretty kickass process for sure. Welcome to the world of open source.</p>\n\n<p>Think about it this way: in the traditional office setting, we use management to facilitate this collaborative building process. Management does many things, but at the most basic level they:</p>\n\n<ul>\n<li>Shuttle Information</li>\n\n<li>Coordinate across business units</li>\n\n<li>Align efforts to organazation priorities</li>\n\n<li>Make sure people do work</li>\n\n<li>Recruit new people</li>\n</ul>\n\n<p>This makes sense if you look at the history of the role. In an age when conveying information was onerous, the only way for Adam to tell Becky what he was working on (and thus to ensure Becky was not duplicating efforts) was to stop what he was doing, walk down the hall, and interrupt Becky. So instead of doing this every day, we hire Charlie to facilitate a standing meeting and shuttle that information back and forth. Makes sense.</p>\n\n<p>But what if when that problem first arose Adam could send Becky an e-mail or an IM or post a update to a shared collaboration space. Do you think they&#8217;d need Charlie in the first place? Would management as we see it today have arisen in an age where technology reduces the friction of collaboration to nearly nil?</p>\n\n<p>Take the open source community, as a test case, which was afforded just such a unique opportunity. Same problem, same outcome, and (for the most part), no traditional hierarchical structure. How do you overcome the management burden? Transparent, persistent communication — everything from code to decisions happen in the open and are archived for all to see — and pure meritocracy — a bunch of ideas arise and are voted on (through opt-in participation) and the best are seen to fruition.</p>\n\n<p>But does it <del>blend</del> scale? WordPress, the open source content management system had nearly 300 individual contributors to its latest release, in just under four months, all working on a single project downloaded more than a million times within days of its release. And there&#8217;s no reason this process has to be limited to software. Collaboration is collaboration.</p>\n\n<p>So what aspects of the open source process make this management free collaboration possible? Ryan Tomayko <a href='http://tomayko.com/writings/adopt-an-open-source-process-constraints'>outlines</a> his experience applying the open source philosophy to an entire (for-profit) venture, noting four key features to the system:</p>\n\n<blockquote>\n<ul>\n<li>\n<p><strong>Electronic</strong>: Discussion, planning, and operations process should use a high fidelity form of electronic communication like email, github.com, or chat with transcripts wherever possible. Avoid meatspace discussion and meetings.</p>\n</li>\n\n<li>\n<p><strong>Available</strong>: Work should be visible and expose process. Work should have a URL. It should be possible to move backward from a piece of product or a system failure and understand how it came to be that way. Prefer git, issues, pull requests, mailing lists, and chat with transcripts over URL-less mediums.</p>\n</li>\n\n<li>\n<p><strong>Asynchronous</strong>: Almost no part of the product development process requires that one person interrupt another&#8217;s immediate attention or that people be in the same place at the same time, or even that people be in different places at the same time. Even small meetings or short phone calls can wreck flow so consider laying it out in (a thought out) email or sending a pull request instead.</p>\n</li>\n\n<li>\n<p><strong>Lock free</strong>: Avoid synchronization / lock points when designing process. This is <a href='http://en.wikipedia.org/wiki/Distributed_revision_control'>distributed version control</a> writ large. We don&#8217;t have a development manager that grants commit bit to repositories before you can do work, or a release manager that approves deploys, or a product manager that approves work on experimental product ideas. Work toward a goal should never be blocked on approval. Push approval/rejection to the review stage or automate it, but surface work early to get feedback.</p>\n</li>\n</ul>\n</blockquote>\n\n<p>Granted, this open-source philosophy doesn&#8217;t apply to every workplace, but how much better would the process of &#8220;making things&#8221; be if we could eliminate traditional pain points of managerial friction entirely — conference calls, status meetings, &#8220;sync ups&#8221;, and other non-decisional &#8220;checkins&#8221;. Work happens in the open, rather than hidden away in one-on-one e-mails or behind closed doors, and decisions are made by those who show up to do the work.</p>\n\n<p>Straddling the line between arguably the world&#8217;s most bureaucratic, hierarchical organization (federal government), and it&#8217;s definitional polar opposite (open source), provides a unique perspective. There are so many aspects to the work day that we do just because it&#8217;s the way thing&#8217;s have been done since the dawn of the industrial revolution, and it puzzles me why nobody&#8217;s stopped to think critically about how these processes could be remained in an age of technology. I need to get this (physical) form approved by Joan? Okay, you just took two people away from doing what they&#8217;re paid to be doing. I have to e-mail someone for the latest version or figure out where we&#8217;re at on this project? Again, just moved someone from high-level to low-level work.</p>\n\n<p>Granted, not every workplace is apt for such radical egalitarianism, but the buttoned up (offline) world of &#8220;serious&#8221; business could learn a thing or two from open source&#8217;s collaborative experiment. In many respects, organizational friction is no longer a sunk cost, and thus, arguably, so too is management.</p>"}