{"title":"Deprecate Management","excerpt":"There are many aspects to 'making things' that open source just does better, and does so without traditional management structure.","author":"Benjamin J. Balter","layout":"post","comments":true,"category":"Management","tags":["Open Souce","GitHub","Collaboration"],"published":true,"url":"/2012/12/16/deprecate-management/","date":"2012-12-16 00:00:00 -0500","id":"/2012/12/16/deprecate-management","categories":["Management"],"next":null,"previous":"<p>The internet has a particular way of solving difficult technical challenges. We try a bunch of diverse approaches out, keep only the most elegant, and quickly forget the rest ever happened. That&#8217;s why the Web is the Internet&#8217;s preeminent service (as apposed to say <a href='http://en.wikipedia.org/wiki/Gopher_%28protocol%29'>Gopher</a>), clicking the logo in the top left corner of almost any site goes to that site&#8217;s homepage, and typing a URL in your browser retrieves that particular page. These aren&#8217;t just design conventions in the sense that a lot of people like them, but rather represent the purposeful result of trial and error.</p><p>Over the past few years, as sites become more mature and even more inter-connected, the internet has been coalescing around one such pattern (known as <a href='http://en.wikipedia.org/wiki/Representational_state_transfer'>REST</a>). The idea is simple: a URL should uniquely identify the underlying data it represents. If I have a URL, I shouldn&#8217;t need anything else to view or otherwise manipulate the information behind it.</p><p>WordPress, for the most part, does this well. Each post is given a unique permalink (e.g., <code>2012-12-15-why-wordpress...</code>) that always points to that post. The problem is, however, in WordPress&#8217;s sense, it points to the <em>display</em> of that content, not the content itself. When editing, for example, that same content may be represented as <code>/wp-admin/post.php?p=1234</code>, clearly a different URL, and if you&#8217;d like to programmatically access the underlying data (say to build a mobile app, or some sort of external widget), you&#8217;re pretty much SOL in terms of WordPress&#8217;s core vision.</p><p>Why does such a nuance matter? Take a look at the direction the net&#8217;s heading. We&#8217;re separating content (say, the post itself), from the presentation layer that holds it hostage (say the theme&#8217;s template), so that we can use it in many, many different ways without starting from scratch. This goes on behind the scenes in many ways you may not even notice, and that&#8217;s the point. By enabling programatic access of the underlying data, that same post can be read via a mobile app, a feed reader, posted to a social network, or even embedded within another site altogether.</p><p>Websites are quickly becoming the curators of information, not simply the presenters of it. It&#8217;s a return to content management in its purest form. It&#8217;s exposing content as a service, and it&#8217;s coming whether we want it or not.</p><p>WordPress came about as many of these now-standard design conventions were still emerging, and understandably, it doesn&#8217;t exactly embrace them head on. Yet next generation content management systems — not weighed down by history — have an advantage here, and as folks look to build the next generation of websites, they&#8217;re obviously going to be looking to where we&#8217;re going, not where we&#8217;ve been.</p><p>If WordPress wants to stay relevant as a content management platform, the future isn&#8217;t traditional post-and-forget blogging, but rather a concerted effort to once again make content king. We obviously can&#8217;t flip a switch and get there overnight, but a crawl, walk, run over the next version or so can better align the veritable CMS with the reality of what&#8217;s in our collective pipeline:</p><h3 id='crawl'>Crawl</h3><p>At the very least, lets expose all WordPress content in a machine readable format. This once and for all breaks the content-presentation link. We do this with RSS somewhat, but it&#8217;s time to put non-HTML formats on equal footing with HTML in core&#8217;s eyes.</p><ol>\n<li>\n<p>Create a new format (&#8220;feed&#8221; in WordPress parlance) called JSON, and add the necessary rewrite rules such that I can simply add <code>.json</code> to any post and retrieve the underlying information in a machine readable format. This should contain not only the content of the post and information that would normally be accessible via HTML, but all the fields of the posts table (e.g., date published, date updated, etc.), all the post&#8217;s metadata (custom, post-specific information), and all the associated term objects (tags, categories, etc.). Sure we&#8217;ll need to add a filter or two in their to ensure information folks want private stays private, but from a technical standpoint, we&#8217;re talking a handful of lines of code here.</p>\n</li>\n\n<li>\n<p>Extend that format to indexes (archives in WordPress terms). Again, just as above, every list of posts (by date, by associated term, search results) should have the capability to exose the list in that same machine-readable format. This allows for the programatic discovery of information. A little bit harder than #1, but again, nothing crazy here. Pretty basic stuff.</p>\n</li>\n</ol><h3 id='walk'>Walk</h3><p>Access to content is half the equation. Allow programatic management of WordPress content as well. Conceptually, this is nothing radical. WordPress allows remote management of content through the <a href='http://en.wikipedia.org/wiki/XML-RPC'>XML-RPC</a> protocol, a blog-specific format that was designed some 15 years ago. We&#8217;re just talking about an upgrade.</p><ol>\n<li>\n<p>Use the existing <code>admin-ajax</code> infrastructure to consistently expose administrative functions in a programtic ways. For example, POSTing to <code>admin-ajax.php?action=create</code> should allow me to create a new post, just as <code>admin-ajax.php?action=update&amp;p=123</code> or <code>?action=delete&amp;p=1234</code> should do the same. Again, the basic plumbing&#8217;s already there, it&#8217;s just a matter of abstracting it out and aligning with modern conventions.</p>\n</li>\n\n<li>\n<p>Pick a few high-priority pieces of backend functionality to prototype, such as listing posts or editing an existing post, and rather than reloading the entire administrative interface every time I click something, dogfood the services exposed in #1 to update the content dynamically. Put another way, turn the WordPress backend into a full-fledged client-side content administration application, rather than merely part of a blog. Again, nothign radical here. Gmail does this with mail, Twitter does this with Tweets. It&#8217;s time for WordPress to start doing this with posts.</p>\n</li>\n</ol><h3 id='run'>Run</h3><p>We may not get there tomorrow, but I know that with a bit of nuance, WordPress can align itself as the platform of the future and tackle the next generation of web-based applications in the &#8220;WordPress way&#8221;. It&#8217;s simply a matter of positioning.</p><ol>\n<li>\n<p>Transparently map the already-exposed permalink endpoints (e.g., <code>2012/12/15/post.json</code>) to their backend counterparts. This may require a bit of rewriting of the WordPress routings system (to understand <a href='http://en.wikipedia.org/wiki/Hypertext_Transfer_Protocol#Request_methods'>HTTP verbs</a> other than simply GET). At this point, WordPress would expose a fully RESTful API for any content it knows about, but could do so with the traditional WordPress finess.</p>\n</li>\n\n<li>\n<p>Add <a href='http://backbonejs.org/'>Backbone</a> to the default theme (it&#8217;s already used on the backend), and begin to dogfood content on the front end as well as the backend so that clicking a post or page simply retrieves the content, rather than reloading the entire website. There&#8217;s an opportunity to really rethink templating here. Perhaps <code>wp_get_ajax_template</code> or something converts a WordPress template to an underscore template. Perhaps WordPress compiles everything into JST for me.</p>\n</li>\n</ol><p>As community members sit down to sketch out what the next version of WordPress looks like, I sincerely hope they can at least think about implementing some of the front-end functionality early on, and maybe even make a prototypical wp-admin 2.0 somewhat of a priority.</p><p>Technology has this tricky way of bringing about organizational change. Making something so dumb-simple really is an empowering force. WordPress did it once as it first set out to democratize publishing, and it&#8217;s time to do it again for the next generation of non-blogging websites and applications.</p><p><strong>Update (12/20):</strong> <em>Not quite REST, but as <a href='https://twitter.com/scribu'>@scribu</a> points out in the comments below, <a href='https://core.trac.wordpress.org/ticket/14618'>#14618</a> proposed an RPC-like JSON API some two years ago. Looks like the ticket ended up in somewhat over a holy war over standards (XML v. JSON anyone?), but the arguments in favor still stand nonetheless.</em></p>","content":"<p>There are many aspects to &#8220;making things&#8221; that <a href='http://ben.balter.com/2012/10/19/we-ve-been-trained-to-make-paper/'>open source just does better</a>. Regardless of if at the end of the day you ship bits or cogs, certain aspects of &#8220;office&#8221; work are universal: ideation, vetting initiatives, resolving conflicts, and shipping product. Now imagine if you had to do all this not across conference tables, but across geographies and timezones. You&#8217;d have a pretty kickass process for sure. Welcome to the world of open source.</p><p>Think about it this way: in the traditional office setting, we use management to facilitate this collaborative building process. Management does many things, but at the most basic level they:</p><ul>\n<li>Shuttle Information</li>\n\n<li>Coordinate across business units</li>\n\n<li>Align efforts to organazation priorities</li>\n\n<li>Make sure people do work</li>\n\n<li>Recruit new people</li>\n</ul><p>This makes sense if you look at the history of the role. In an age when conveying information was onerous, the only way for Adam to tell Becky what he was working on (and thus to ensure Becky was not duplicating efforts) was to stop what he was doing, walk down the hall, and interrupt Becky. So instead of doing this every day, we hire Charlie to facilitate a standing meeting and shuttle that information back and forth. Makes sense.</p><p>But what if when that problem first arose Adam could send Becky an e-mail or an IM or post a update to a shared collaboration space. Do you think they&#8217;d need Charlie in the first place? Would management as we see it today have arisen in an age where technology reduces the friction of collaboration to nearly nil?</p><p>Take the open source community, as a test case, which was afforded just such a unique opportunity. Same problem, same outcome, and (for the most part), no traditional hierarchical structure. How do you overcome the management burden? Transparent, persistent communication — everything from code to decisions happen in the open and are archived for all to see — and pure meritocracy — a bunch of ideas arise and are voted on (through opt-in participation) and the best are seen to fruition.</p><p>But does it <del>blend</del> scale? WordPress, the open source content management system had nearly 300 individual contributors to its latest release, in just under four months, all working on a single project downloaded more than a million times within days of its release. And there&#8217;s no reason this process has to be limited to software. Collaboration is collaboration.</p><p>So what aspects of the open source process make this management free collaboration possible? Ryan Tomayko <a href='http://tomayko.com/writings/adopt-an-open-source-process-constraints'>outlines</a> his experience applying the open source philosophy to an entire (for-profit) venture, noting four key features to the system:</p><blockquote>\n<ul>\n<li>\n<p><strong>Electronic</strong>: Discussion, planning, and operations process should use a high fidelity form of electronic communication like email, github.com, or chat with transcripts wherever possible. Avoid meatspace discussion and meetings.</p>\n</li>\n\n<li>\n<p><strong>Available</strong>: Work should be visible and expose process. Work should have a URL. It should be possible to move backward from a piece of product or a system failure and understand how it came to be that way. Prefer git, issues, pull requests, mailing lists, and chat with transcripts over URL-less mediums.</p>\n</li>\n\n<li>\n<p><strong>Asynchronous</strong>: Almost no part of the product development process requires that one person interrupt another&#8217;s immediate attention or that people be in the same place at the same time, or even that people be in different places at the same time. Even small meetings or short phone calls can wreck flow so consider laying it out in (a thought out) email or sending a pull request instead.</p>\n</li>\n\n<li>\n<p><strong>Lock free</strong>: Avoid synchronization / lock points when designing process. This is <a href='http://en.wikipedia.org/wiki/Distributed_revision_control'>distributed version control</a> writ large. We don&#8217;t have a development manager that grants commit bit to repositories before you can do work, or a release manager that approves deploys, or a product manager that approves work on experimental product ideas. Work toward a goal should never be blocked on approval. Push approval/rejection to the review stage or automate it, but surface work early to get feedback.</p>\n</li>\n</ul>\n</blockquote><p>Granted, this open-source philosophy doesn&#8217;t apply to every workplace, but how much better would the process of &#8220;making things&#8221; be if we could eliminate traditional pain points of managerial friction entirely — conference calls, status meetings, &#8220;sync ups&#8221;, and other non-decisional &#8220;checkins&#8221;. Work happens in the open, rather than hidden away in one-on-one e-mails or behind closed doors, and decisions are made by those who show up to do the work.</p><p>Straddling the line between arguably the world&#8217;s most bureaucratic, hierarchical organization (federal government), and it&#8217;s definitional polar opposite (open source), provides a unique perspective. There are so many aspects to the work day that we do just because it&#8217;s the way thing&#8217;s have been done since the dawn of the industrial revolution, and it puzzles me why nobody&#8217;s stopped to think critically about how these processes could be remained in an age of technology. I need to get this (physical) form approved by Joan? Okay, you just took two people away from doing what they&#8217;re paid to be doing. I have to e-mail someone for the latest version or figure out where we&#8217;re at on this project? Again, just moved someone from high-level to low-level work.</p><p>Granted, not every workplace is apt for such radical egalitarianism, but the buttoned up (offline) world of &#8220;serious&#8221; business could learn a thing or two from open source&#8217;s collaborative experiment. In many respects, organizational friction is no longer a sunk cost, and thus, arguably, so too is management.</p>","related_posts":[{"url":"/about/","title":"About"},{"url":"/contact/","title":"Contact"},{"url":"/donate/","title":"Donate"},{"url":"/fine-print/","title":"Fine Print"},{"url":"/resume/","title":"Resume"},{"url":"/0001/03/01/speaking-experience/","title":"Speaking Experience"},{"url":"/0001/03/10/web-development-and-management/","title":"Web Development and Management"},{"url":"/0001/05/01/bachelor-of-arts-political-science/","title":"Bachelor of Arts, Political Science"},{"url":"/0001/05/05/master-of-business-administration-strategic-management-and-public-policy/","title":"Master of Business Administration — Strategic Management and Public Policy\n"},{"url":"/0001/05/10/juris-doctorate-candidate/","title":"Juris Doctorate Candidate"}]}