{"title":"Fellow, Office of the US Chief Information Officer\n","organization":"Executive Office of the President","section":"Experience","from":"January 2012","to":"August 2012","location":"Washington, D.C.","category":"resume","robots":"noindex, nofollow","layout":"default","url":"/0001/10/05/e-government-information-technology/","date":"0001-10-05 00:00:00 -0500","id":"/0001/10/05/e-government-information-technology","categories":["resume"],"next":"Described by the US Chief Technology Officer as \"the baddest of the badass innovators,\" serve as entrepreneur in residence reimagining the role of technology in brokering the relationship between citizens and government.\n","previous":"<ul>\n<li>Created enterprise business solutions to automate and streamline business processes in support of the President of the United States as part of the White House’s first-ever agile software development team.</li>\n\n<li>In close coordination with the Office of Federal Financial Management, lead development of <a href='https://max.gov/unclesamslist/'>prototypical government-wide, open-source classifieds system</a> for sharing of federal real and other properties among executive agencies.</li>\n\n<li>Regularly met with and presented to C-level executives and key stakeholders to develop and support mission-critical applications including public data collection, White House comment line, goods and services tracking, and employee on-boarding and off-boarding.</li>\n\n<li>Developed application to catalog blackberry SMS and PIN messages to aid E-Discovery team and assure compliance with Federal Records Act, Presidential Records Act, and Freedom of Information Act.</li>\n\n<li>Assisted information assurance teams with application certification and accreditation.</li>\n</ul>","tags":[],"content":"<ul>\n<li>Assisted with drafting, stakeholder outreach, and coordination of the release of <a href='http://www.whitehouse.gov/sites/default/files/omb/egov/digital-government/digital-government.html'>the President’s Digital Government Strategy</a>, a fundamental reimagination of the role of technology in the public sector</li>\n\n<li>In response to presidential mandate requiring the release of open source software, coordinated and led negotiation of contract for code-sharing services including creation of records management plans under both the Federal Records and Presidential Records Acts</li>\n\n<li>Briefed senior White House officials on legal implications and licensing consideration surrounding the creation of government-funded open-source software collaborations</li>\n\n<li>Prepared US Chief Information Officer for public appearances including speech writing, messaging, and creation of multiple HTML5-based presentations</li>\n\n<li>Developed technical roadmap, prototyped, and implemented <a href='https://github.com/GSA/digital-strategy'>first-of-its-kind mechanism</a> for agencies to report progress on the Digital Government Strategy</li>\n</ul>"}