{"author":"Benjamin J. Balter","title":"Why Digital Talent Doesn't Want To Work At Your Company\n","excerpt":"It's because you're not providing them the right opportunity. The talent you want would be happy to work in an un-air-conditioned garage in New Mexico if it meant the chance to change the world.\n","layout":"post","category":["Business","Technology"],"tags":["agile","bureaucracy","career","enterprise","federal","generation gap","government","job","talent"],"post_format":["Quote"],"url":"/2011/10/29/why-digital-talent-doesnt-want-to-work-at-your-company/","date":"2011-10-29 00:00:00 -0400","id":"/2011/10/29/why-digital-talent-doesnt-want-to-work-at-your-company","categories":["posts"],"next":"Never before has it been so vital that the federal government do more with less. On all sides of the National Mall, government agencies are tightening their belts considerably, but the challenge is not simply about trimming budgets or spending less. In many cases, the problem is a matter of spending smarter.\n\n<div style=\"float:right; width: 300px; margin-left: 20px; text-align: left;\" markdown=\"1\" class=\"well\">\n#### What is Agile?\n\n*   An incremental approach to software development that breaks a project into many independent, fungible tasks;\n*   Does not seek to build software in a sequential, step-wise manner;\n*   Recognizes the reality that requirements are unpredictable and change over time; and\n*   Plans are continuously inspected and adapted through rapid prototyping.\n</div>\n\nWhile the federal IT infrastructure is beginning to show its age — loosing its ability to serve federal employees and thus more broadly the American public — federal approaches to IT procurement and management are increasingly proving themselves to be equally anachronistic. Traditional heavyweight philosophies known most commonly as waterfall development simply move too slowly for today's quickly changing federal IT landscape. By the time projects reach completion, all too often, the technology or the customer's needs have fundamentally changed, and what is delivered does not resemble what is needed. If we wish to create the efficient government of the 21st century, we must jettison traditional approaches to IT project management and adopt a more agile model.\n\n### Technology that Outpaces the Laws that Govern its Adoption\n\nGovernment contracts are rarely written for agile, and with good reason: As a matter of public policy, procurement regulations force agencies to prefer full and open competition over sound project deliverables. By purposeful design, federal procurement emphasizes the process surrounding the purchase, not on the purchase itself. Traditional contracting vehicles call for stable requirements to be outlined up front and rigidly adhered to, regardless of advancements in technology or changes to the agency's needs. Compounding the problem, contracting officers must often secure and commit funding well in advance, rendering adaptation impossible and Agile's \"I'll know it when I see it\" approach, somewhat counterintuitive. Finally, due to the significant administrative cost presented to the agency, these restrictions encourage agency-wide transformations to be approached in a large, single pass rather than addressing the component parts individually. These procedural necessities — not usually seen in the private sector — generate significant lead times further hindering agencies' adoption of any approach that relies on small iterations.\n\n<div style=\"float:left; width: 300px; margin-right: 20px; text-align: left;\" markdown=\"1\" class=\"well\">\n#### Federal IT Procurement by the Numbers:\n\n*   **77.1** – amount in billions the federal government spent on IT in FY2010\n*   **70** – percent increase in federal IT spending over the past decade\n*   **1/3** – procured features actually used by the agencies that contract them\n*   **9** – percentage of federal IT projects delivered on budget and on time\n</div>\n\nThese potential stumbling blocks, however, do not necessarily prove fatal. Compared to organizational culture, laws are easy to change given enough pressure by those they govern. Ironically, this seemingly technological challenge is, most elementally, a human one. Federal stakeholders must actively rethink the predominant culture in today's IT shops. They must seek to train or hire a more agile workforce and rethink the way agencies approach requirements at the time of solicitation. Like any other organizational change, none of this would be possible unless it is communicated as an agency- and government-wide imperative, and ultimately seen to fruition on a project-by-project and task-by-task level by the IT professionals that will be its daily shepherds.  Here are five steps that will lead in that direction: \n\n### 1. Rethinking an innovation-averse culture\n\nGovernment agencies embody an entrenched culture of rigidly defined parameters, documentations, and overall, a meticulously defined hierarchical process. Uncertainty, and thus risk, is mitigated through policy that, by its very nature, resists change at all levels, especially a disruptive change like agile. Before any degree of agility can be injected into a stereotypically form-centric environment, managers must seek to create somewhat of a startup culture within their own business unit.\n\nAt the most basic level, it is not agencies that purchase IT for the government, but rather individuals on behalf of those agencies. Like their private-sector counterparts, care must be taken to ensure that these individuals' incentives remain in line with those of their employer. Despite this, government budgeting continues to focus primarily on projects that fall within a single budget year, are controlled by a single budget program, and promise an easily predicted, low-risk return.\n\nFor example, contracting officer that adopts an innovative, but ultimately flawed approach may face reprimand or termination when presented with the technology's underperformance, while without explicit financial incentives, gains little if the experiment proves beneficial. Put another way, federal employees are encouraged to avoid near-term risk and thus have a disincentive to improve well entrenched but outdated processes like waterfall. New ideas must compete against proven ones, and all-too-often known problems take precedence over potential improvements. High-value, but high-risk ideas like agile require the kind of no-fault support from upper management that only a cultural shift can bring before they can begin to take foothold in the federal workplace.\n\n### 2. Infusing agile knowledge into an otherwise waterfall workforce\n\nAcross the board, federal employees, from contracting officers to in-house IT departments to agency CIOs, many of whom have risen through the ranks of primarily waterfall federal bureaucracies, are often not accustomed to managing an agile project, nor do they often find the necessary encouragement to take on such an endeavor. These federal employees, the front line of agile adoption, must be given the necessary toolset to properly contract and manage agile projects in an otherwise \"over the fence\" culture.\n\nWhile many cities, Washington, D.C. especially, may offer agile training and certification, by-and-large federal employees seemingly do not take advantage of such opportunities. Like any industry, federal IT professionals at all levels must make a commitment to stay abreast of significant developments in their field. Project management has undergone a radical transformation in recent years. Whereas once mainframe computers and batch processing rendered change costly and thus an analogy to traditional engineering fields apropos, today cloud computing, commodity hardware, and the adoption of higher-level languages has created a more interactive development process that make mistakes made under an agile framework negligibly cheap. Yet this game-changing inflection point has yet to be fully appreciated by government, despite its widespread adoption in the private sector. Management must seek to infuse agility into the IT workforce either through continued education or strategic hiring at all levels.\n\n### 3. Focusing on functional, rather than technical requirements\n\nFrom a practical standpoint, to encourage agile adoption, solicitations and other formal documentation should outline functional, rather than technical requirements. Rather than specifying that a system use a particular encryption algorithm, for example, and thus risk that technology being obsolete or no longer needed at the time of delivery, requirements documentation should outline the functional goal that the agency really is after—in this case, industry-standard security practices. These requirements should be generated without the significant lead-time often seen in government procurement efforts and should involve all relevant stakeholders from the contracting officer to the technical point of contact and future system. An agile contract cannot be written from a waterfall mindset. The statement of work should specify high-level goals or systems (rather than specific features) that will eventually become the framework that defines each subsequent sprint. If necessary, the contract could include specific, functional milestones and accompanying deadlines, which may be married to an award schedule.\n\n### 4. Making innovation an imperative at all levels\n\nLike any push for organizational change, none of this can happen without significant, top-down support. First, federal opinion-leaders like the Office of Management and Budget must lean heavily on agencies to adopt more modern software development practices. Without significant political pressure both within an agency and between, reform will remain simply rhetorical. Tangible, specific guidance from the administration to agency CIOs and CFOs is necessary for innovation to overcome existing organizational inertia.\n\nSecond, relevant stakeholders within an agency must be empowered to take risks with, what is by government standards, a radically unconventional approach. Hierarchical status and paper forms—two staples of government—are antithetical to agile's reliance on face-to-face informal communication. When responsibility lies in management, and thus is distinct from the actual development activity, such an approach inhibits the fast, authoritative decisions that are the hallmark of agile.\n\n### 5. Applying agile-to-agile adoption\n\nIt would be foolish to suggest that a transition to agile can happen on a government-wide or even agency level. Instead, like the processes it espouses, the push for agile should be iterative and rely almost exclusively on successive prototyping across business units. Individual projects, or even segments of individual projects, should be attempted using a fully agile framework, and slowly iterate through the agency's efforts as subsequent development efforts learn from the evaluation of past sprints.\n\n### Beyond Technology\n\nGovernment agility is not only important in so far as it helps agencies hit increasingly frugal budget targets, but also because when federal projects are not delivered on time and on budget agency objectives suffer. IT programs that cost more than they should or ultimately fail to meet agency needs, means the Department of Education helps fewer students, the Department of Health fosters cures for fewer patients, and the Department of Commerce creates fewer opportunities for the unemployed.\n\nTechnology has lapped the approach the federal government has traditionally taken to managing it. A highly entrenched, management-directed culture fatal to agile has taken foothold in the nation's capital, and shows no signs of lessening. Agencies must seek to build a workforce that understands and can embody the virtues of agile in their daily work. Functionality and the agency's mission, not technology, should rule the workplace. None of this is possible, however, without significant pressure, both from the administration to agencies, and within agencies themselves, to make the shift to agile not only a priority, but a necessity of survival in today's 21st century government. As the public's scrutiny turns increasingly toward the federal budget, it is especially important that agencies are smarter about their development efforts and see them not as a line-item expense, but rather as a potential cost-saving innovation.\n\n*This article originally published in [Government CIO Magazine][1].*\n\n [1]: http://www.governmentciomagazine.com/2011/11/federal-agility-adopting-cultural-approach-technical-problem#blog-content","previous":"<p>Looking for even more advanced control of your workflow? <a href='http://ben.balter.com/2011/08/29/wp-document-revisions-document-management-version-control-wordpress/' title='WP Document Revisions — Document Management &amp; Version Control for WordPress'>WP Document Revisions</a>gained a huge feature today with the addition of integrated support for the popular workflow plugin <a href='http://editflow.org'>Edit Flow</a>. Beginning with <a href='http://wordpress.org/extend/plugins/wp-document-revisions/'>version 1.1</a>, WP Document Revisions will detect Edit Flow, if installed, and will automatically pull <a href='http://wordpress.org/extend/plugins/edit-flow/screenshots/'>Edit Flow&#8217;s advanced workflow management tools</a> into the proven WP Document Revisions experience you already know and use. Specifically:</p>\n\n<ul>\n<li><strong>E-Mail Notifications and User Groups</strong> allow you to keep track of activity via e-mail and manage alerts based on existing teams. Subscribe individual users or entire groups to receive a document&#8217;s updates.</li>\n\n<li><strong>Custom Document Metadata</strong> allows organizations to store additional information alongside your documents in a sleek, intuitive manner. Supports a virtually unlimited number of checkboxes, dates, locations, text, users, and numeric fields.</li>\n\n<li><strong>Collaborative Team Chat</strong>allows users to comment on and discuss individual documents, pulling the conversation out of your inbox and back into your workflow.</li>\n\n<li><strong>Evolved Workflow State Integration</strong> allows for more granular control of Workflow states (&#8220;Document Status&#8221; in EditFlow parlance), including setting a document&#8217;s initial status and better integration with the native WordPress experience.</li>\n\n<li><strong>Advanced Snapshots</strong> of your team&#8217;s progress via filterable calendar and budget views. See all documents in a particular step in your workflow, in a particular category, in a particular week, or by a particular user.</li>\n</ul>\n\n<p>Ideal for teams of any size looking to fine tune their WP Document Revisions experience without the hassle of <a href='https://github.com/benbalter/WP-Document-Revisions-Code-Cookbook'>coding a custom implementation</a>, the addition of Edit Flow support offers a unique suite of powerful and intuitive workflow management tools right out of the box.</p>\n\n<p>Want one feature but not another? Each can be individually enabled or disabled via Edit Flow&#8217;s settings panel. For more information, see the <a href='http://editflow.org/'>Edit Flow homepage</a> or simply <a href='http://wordpress.org/extend/plugins/edit-flow/'>download and install the plugin</a> to begin — no additional setup necessary.</p>","content":"<p>As Aaron Shapiro over at Fast Company <a href='http://www.fastcompany.com/1779120/embargo-1027-why-digital-talent-doesn-t-want-to-work-at-your-company'>cogently argues</a>, &#8221;<em>it&#8217;s because you&#8217;re not providing them the right opportunity. The talent you want would be happy to work in an un-air-conditioned garage in New Mexico if it meant the chance to change the world</em>.&#8221;</p>\n\n<p>Specifically he points out:</p>\n\n<ul>\n<li><strong>Every element of their work will be pored over by multiple layers of bureaucracy.</strong> Even if that&#8217;s how the rest of the company operates, it can&#8217;t spill into the digital department. In a technology environment, new products and businesses spring up daily and a new endeavor can go from conception to launch in a matter of months. Reining in the momentum will be read as inaction and a clear signal the company isn&#8217;t willing to grasp the new way of the world.</li>\n\n<li><strong>Mediocre is good enough.</strong> While clocking out at 5 p.m. is attractive to some, it will discourage digital talent. They want to be expected to do something great. They want to be pushed. They care about their work. Their leadership, and those they rely on to get things done, must match their appetite for success.</li>\n\n<li><strong>Trial and error is condemned.</strong> The freedom to try out new ideas allows employees to take initiative, make decisions, and learn from their mistakes. It also demonstrates an attractive and inspiring entrepreneurial spirit.</li>\n\n<li><strong>Your company is structured so it takes a lifetime to get to the top, and as such there are no digital experts in company-wide leadership positions.</strong>Digital talent–often in their 20s and 30s–need to see a clear path for uninhibited career development that&#8217;s based on merit, not years spent, and that&#8217;s beyond the confines of the digital department. If they don&#8217;t, they won&#8217;t see a reason to stay with the company in the long term.</li>\n\n<li><strong>Your offices are cold, impersonal and downright stodgy.</strong> It may sound like it conflicts with the &#8220;you don&#8217;t need to be in Silicon Valley point,&#8221; but appreciate the nuance. A traditional office layout is designed to communicate power among certain individuals and barriers between departments. This does not support the collaborative ethos which is intrinsic to the web. Companies should do everything possible to provide the digital team friendlier, open office space. A location in a hip, young neighborhood (which surely exists in every mid- to large-sized city) is also a big plus.</li>\n</ul>\n\n<p>I think the argument could be extended to hiring 20-somethings more broadly (<a href='http://www.nextgov.com/nextgov/ng_20100423_7313.php'>I&#8217;m looking at your Federal Government</a>), but a great read, nonetheless.</p>\n\n<p><span>via <a href='http://www.fastcompany.com/1779120/embargo-1027-why-digital-talent-doesn-t-want-to-work-at-your-company'>Fast Company</a></span></p>"}