{"author":"Benjamin J. Balter","title":"Government's Release of Federally Funded Source Code: Public Domain or Open Source? Yes.","excerpt":"The question for developers isn't how should the US government best license software, but how can the open source community help it to do so","layout":"post","categories":["Law","Technology"],"tags":[".govs","code","contracting","copyright","enterprise","federal","gov 2.0","government","gpl","IT","licensing","open government","open source","procurement"],"post_format":[],"related_posts":[{"url":"/2010/09/12/wordpress-resume-plugin/","id":"/2010/09/12/wordpress-resume-plugin","title":"WordPress Resume Plugin"},{"url":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party/","id":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party","title":"New Media Flak: Megaphone vs. Cocktail Party"},{"url":"/2010/10/10/does-every-cloud-have-a-silver-lining/","id":"/2010/10/10/does-every-cloud-have-a-silver-lining","title":"Does Every Cloud Have a Silver Lining?"},{"url":"/2010/11/06/removing-the-barriers-to-organizational-agility/","id":"/2010/11/06/removing-the-barriers-to-organizational-agility","title":"Removing the Barriers to Organizational Agility\n"},{"url":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing/","id":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing","title":"What Fourteen-Century Apple Pie Teaches Us About Sharing\n"},{"url":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds/","id":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds","title":"Will Federal Contracting Officers Soon Have Their Heads in the Clouds?\n"},{"url":"/2010/11/29/free-trade-in-china-just-google-it/","id":"/2010/11/29/free-trade-in-china-just-google-it","title":"Free Trade in China? Just Google it."},{"url":"/2010/11/29/twitter-mentions-as-comments/","id":"/2010/11/29/twitter-mentions-as-comments","title":"Twitter Mentions as Comments WordPress Plugin\n"},{"url":"/2010/12/01/the-internet-is-series-of-tubes/","id":"/2010/12/01/the-internet-is-series-of-tubes","title":"The Internet is Series of Tubes (oh, and Tollgates too)\n"},{"url":"/2010/12/20/late-night-infomercials/","id":"/2010/12/20/late-night-infomercials","title":"Late-Night Infomercials: Guaranteed to Extend the 4th Amendment or Your Money Back"}],"url":"/2012/07/26/government-release-of-source-code-public-domain-or-open-source/","date":"2012-07-26 00:00:00 +0000","id":"/2012/07/26/government-release-of-source-code-public-domain-or-open-source","next":"/2012/10/01/welcome-to-the-post-cms-world","previous":"/2012/07/10/the-demise-of-the-dashboard","content":"<p>A petition was recently posted on <a href='https://petitions.whitehouse.gov/'>We The People</a> demanding <a href='https://petitions.whitehouse.gov/petition/maximize-public-benefit-federal-technology-sharing-government-developed-software-under-open-source/6n5ZBBwf?utm_source=wh.gov&amp;utm_medium=shorturl&amp;utm_campaign=shorturl'>that federally funded software be released under an open source license</a>. Makes sense. The public should have access to what is technically their property.</p>\n\n<p>However, <a href='http://www.techdirt.com/articles/20120723/12181319800/should-software-created-federal-govt-be-open-source-licensed-public-domain.shtml'>TechDirt posed the question</a> of whether it should be released under an open-source license or public domain, and I&#8217;m afraid they really missed the point.</p>\n\n<p>There&#8217;s no doubt in my mind that the creator of the petition was simply asking the question &#8220;I can haz source code?&#8221; Plain and simple. Put it in context: 99% of the time when an organization (or an individual) releases software to the public, they do so under the terms of an open source license. It tells users what they can and can&#8217;t do, and tells contributors under what terms they can contribute. It&#8217;s set&#8217;s the ground rules. It&#8217;s a contract with the public. It&#8217;s a prenup for code.</p>\n\n<p>So what&#8217;s the issue? Although I generally dread the phrase, in this case, government is objectively different. Under 17 U.S.C ยง 105 US Government Works are not subject to domestic copyright protection. It&#8217;s not technically public domain, but it&#8217;s close enough. <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> Any US citizen can use the code any way they wish. There&#8217;s simply no copyright, thus no need to license. <sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> And this entire debate is a moot point if the software is a derivative work of a viral license like the GPL, the most common open source license. <sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup></p>\n\n<p>That of course, only applies to code created by a US government employee, an increasingly rare occurrence. <sup id='fnref:4'><a href='#fn:4' rel='footnote'>4</a></sup> Absent permission from the contracting officer, the US government retains unlimited rights for all work created under contract (including the right to redistribute). <sup id='fnref:5'><a href='#fn:5' rel='footnote'>5</a></sup> And again a moot point if GPL derivative (and thus must be given to the Government under the GPL.)</p>\n\n<p>Yet all this is very academic (not to mention dry). Waldo Jaquith and Anil Dash <a href='https://twitter.com/anildash/statuses/227476701599391744'>made a great suggestion</a>: let&#8217;s be pragmatic here. Government doesn&#8217;t hold on to software because they are concerned about licensing. They hold on to software because they have better things to do, because it&#8217;s not within the culture, and because there&#8217;s no angry mob slamming a battering ram against the metaphorical front gates when they don&#8217;t.</p>\n\n<p>I don&#8217;t think the nuances of federal procurement law is even close to the first thing we should care about here. <sup id='fnref:6'><a href='#fn:6' rel='footnote'>6</a></sup> The concern is about whether feds should do the leg work to open source it or not. The question for us as developers, for the thought leaders in the space, isn&#8217;t how should the US government best license / not license software, but <em>how can the open source community help it to do so.</em> How can we get more software out the door? In a world of finite time, <em>how can we make open sourcing</em> <sup id='fnref:7'><a href='#fn:7' rel='footnote'>7</a></sup> <em>a bonafide priority</em>?</p>\n\n<p>How? For one, involvement in existing open source projects <sup id='fnref:8'><a href='#fn:8' rel='footnote'>8</a></sup> would surely send a strong message that there&#8217;s latent demand here, and would give the foot soldiers political air cover to forge onward with their efforts. For another, taking ownership of the code itself, and realizing it is <em>our</em> code, not the government&#8217;s would surely change the tone of the debate by encouraging agencies to ship code sooner, rather than delaying release out of fear of criticism.</p>\n\n<p>Put simply, it&#8217;s about what role we are going to play, not what rights we are going to receive. Let&#8217;s at least get the source code, then we can go back to our regularly scheduled holy wars over licensing.</p>\n\n<p><em>As always, <a href='http://ben.balter.com/fine-print/'>views are my own</a>.</em></p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>I&#8217;d argue that all software, even government funded software should still be licensed under a traditional open source license, to resolve any legal ambiguity when used abroad under the terms of various international copyright treaties and agreements</p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p>Although citizen-contributions to that project would theoretically not be public domain, thus necessitating a license, which should be clarified in the project&#8217;s documentation at the time of release to avoid potential issues with 21 U.S.C. ยง 1342.</p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p>Although again, technically speaking the project as a whole would be licensed under GPL, individual code not dependent on the parent project could be used as a US Government Work.</p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li><li id='fn:4'>\n<p>Unless you&#8217;re looking at the <a href='https://github.com/languages/ColdFusion'>vibrant open source cold fusion community</a>.</p>\n<a href='#fnref:4' rev='footnote'>&#8617;</a></li><li id='fn:5'>\n<p>FAR 52.227-14(c)(1)(i). Even if the contracting officer grants such rights, they do not take effect unless the contractor includes a copyright notice at the time of delivery, acknowledging the government&#8217;s sponsorship and indicating the contract number under which it was procured. See FAR 27.404(a)(5).</p>\n<a href='#fnref:5' rev='footnote'>&#8617;</a></li><li id='fn:6'>\n<p>General counsels across government already have enough ammunition to stymy progress.</p>\n<a href='#fnref:6' rev='footnote'>&#8617;</a></li><li id='fn:7'>\n<p>Often the last and least seen step in the enterprise development process.</p>\n<a href='#fnref:7' rev='footnote'>&#8617;</a></li><li id='fn:8'>\n<p>There&#8217;s been <a href='http://ben.balter.com/2012/04/15/cfpb-accepts-first-citizen-submitted-pull-request-on-behalf-of-federal-government/'>exactly one pull request to date</a> across all government github repos.</p>\n<a href='#fnref:8' rev='footnote'>&#8617;</a></li></ol></div>"}