{"author":"Benjamin J. Balter","title":"What's Missing from CFPB's Awesome New Source Code Policy","excerpt":null,"layout":"post","categories":["Law","Technology"],"tags":[".govs","cfpb","code","contracting","copyright","enterprise","fcc","federal","github","gov 2.0","government","IT","open government","open source","procurement","source code policy"],"post_format":[],"related_posts":[{"url":"/2010/09/12/wordpress-resume-plugin/","id":"/2010/09/12/wordpress-resume-plugin","title":"WordPress Resume Plugin"},{"url":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party/","id":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party","title":"New Media Flak: Megaphone vs. Cocktail Party"},{"url":"/2010/10/10/does-every-cloud-have-a-silver-lining/","id":"/2010/10/10/does-every-cloud-have-a-silver-lining","title":"Does Every Cloud Have a Silver Lining?"},{"url":"/2010/11/06/removing-the-barriers-to-organizational-agility/","id":"/2010/11/06/removing-the-barriers-to-organizational-agility","title":"Removing the Barriers to Organizational Agility\n"},{"url":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing/","id":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing","title":"What Fourteen-Century Apple Pie Teaches Us About Sharing\n"},{"url":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds/","id":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds","title":"Will Federal Contracting Officers Soon Have Their Heads in the Clouds?\n"},{"url":"/2010/11/29/free-trade-in-china-just-google-it/","id":"/2010/11/29/free-trade-in-china-just-google-it","title":"Free Trade in China? Just Google it."},{"url":"/2010/11/29/twitter-mentions-as-comments/","id":"/2010/11/29/twitter-mentions-as-comments","title":"Twitter Mentions as Comments WordPress Plugin\n"},{"url":"/2010/12/01/the-internet-is-series-of-tubes/","id":"/2010/12/01/the-internet-is-series-of-tubes","title":"The Internet is Series of Tubes (oh, and Tollgates too)\n"},{"url":"/2010/12/20/late-night-infomercials/","id":"/2010/12/20/late-night-infomercials","title":"Late-Night Infomercials: Guaranteed to Extend the 4th Amendment or Your Money Back"}],"url":"/2012/04/10/whats-missing-from-cfpbs-awesome-new-source-code-policy/","date":"2012-04-10 00:00:00 +0000","id":"/2012/04/10/whats-missing-from-cfpbs-awesome-new-source-code-policy","next":"/2012/04/15/cfpb-accepts-first-citizen-submitted-pull-request-on-behalf-of-federal-government","previous":"/2012/03/05/wordpress-for-government-and-enterprise","content":"<p><img alt='CFPB Logo' class='alignright' src='http://www.treasury.gov/press-center/news/PublishingImages/CFPB.jpg' /></p>\n\n<p>Most often, when we talk about open source in government, it&#8217;s talked about in one of two ways: either it&#8217;s <a href='http://ben.balter.com/2011/11/29/towards-a-more-agile-government/'>the pitfalls of the federal IT procurement model</a> that can&#8217;t seem to comprehend a world in which open-source is an option, much less potentially a superior choice (<a href='http://radar.oreilly.com/2011/09/open-source-government-it-goscon.html'>&#8220;acquisition as a roadblock</a>&#8221;), or it&#8217;s reiterating the same open-source talking points that haven&#8217;t seemed to give open source much parity with the wall of organizational inertia proprietary software seems to have gained over the years (&#8221;<a href='http://benbalter.github.com/open-source-alternatives/'>open source as an alternative</a>&#8221;).</p>\n\n<p>The <a href='http://cfpb.gov'>Consumer Financial Protection Bureau</a> (CFPB), however, is in a unique position. As the newest kid on the block, it&#8217;s one of the few government agencies to have been born in a digital era, and more importantly, without the bureaucratic baggage that all too often stymies innovation. They have a chance to &#8220;do it right&#8221; from the start… and they&#8217;re doing just that.</p>\n\n<p><strong>An Agency Born of the Internet Generation</strong></p>\n\n<p>Yesterday, CFPB <a href='http://www.consumerfinance.gov/developers/sourcecodepolicy/'>announced a bureau-wide preference for open source</a> in its shiny new <a href='http://www.consumerfinance.gov/developers/sourcecodepolicy/'>Source Code Policy</a>, by my <a href='http://www.google.com/search?sugexp=chrome,mod=4&amp;sourceid=chrome&amp;ie=UTF-8&amp;q=source+code+policy+site%3A.gov'>crude research</a>, a first for any government agency. There are two watershed shifts here: first, that the agency not only should, but <em>must</em> evaluate open source software on equal footing to its proprietary counterparts, a comparison which I believe will <a href='http://www.amazon.com/The-Wealth-Networks-Production-ebook/dp/B0015GWX0S'>increasingly fall in open source&#8217;s favor</a>, and second, that unless there&#8217;s an overriding security or similar concern <em>not to</em>, public code must be public. There&#8217;s nothing new here. All it says is that we should use the best software for the job (a no-brainier), and that that software, the public&#8217;s property, should belong to the public.</p>\n\n<p>So why is this news? Plenty of government entities have <a href='http://www.fcc.gov/blog/contributing-code-back-fcc-govs-open-source-feedback-loop'>released</a> <a href='http://www.whitehouse.gov/blog/2011/02/11/whitehousegov-releases-second-set-open-source-code'>source</a> <a href='http://open.nasa.gov'>code</a>, or <a href='https://update.cabinetoffice.gov.uk/resource-library/open-source-procurement-toolkit'>encouraged the</a><a href='http://www.finance.gov.au/e-government/infrastructure/docs/AGuidetoOpenSourceSoftware.pdf'>use of open</a>-<a href='http://www.tekno.dk/pdf/projekter/p03_opensource_paper_english.pdf'>source software</a>. But no one has come out and <a href='https://twitter.com/#!/victorzapanta/status/189390759181557760'>plainly stated that they were an &#8220;open-source agency&#8221;</a>, that open source is the new default, and that absent an affirmative step by some nay-sayer, that the public will have access to their code.That&#8217;s huge. It&#8217;s flipping the burden, and it&#8217;s the way things should be from the start.</p>\n\n<p><strong>But Where&#8217;s the Beef?</strong></p>\n\n<p>That said, there&#8217;s one thing the source code policy is noticeably silent on: <em>the ecosystem</em>. Posting code is great and it&#8217;s great that they&#8217;ve done the legal legwork so other agencies can follow suit, but that&#8217;s just the 1.0. The true power of open source comes not from simply publishing code, but from being a member of a broader coding community. Can a CFPB employee contribute a patch to an existing open source project on CFPB time? <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> What about contributing to a CFPB project once he or she&#8217;s left? What happens to my rights when I fork a <a href='http://github.com/cfpb'>CFPB project on GitHub</a> and send the agency a pull request? <sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> Can the agency even accept my code legally? <sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup> There&#8217;s a lot of legal ambiguity there, and it&#8217;s just the kind of legal ambiguity a well-intentioned government attorney can seize upon to gum up the very gears that are driving this incredible move.</p>\n\n<p>We&#8217;ve seen the same progression in the open data world. The 1.0 is posting 10 XML files at a gigabyte each — an arms-length relationship with developers — arguably open data simply for open data&#8217;s sake. The secret sauce lies in the relationship, in publishing APIs and web services rather than static data, to build an ecosystem around the agency&#8217;s work.</p>\n\n<p><strong>An Innovation Ecosystem</strong></p>\n\n<p>Imagine if government agencies served as the catalyst for a <a href='http://ben.balter.com/2012/03/05/wordpress-for-government-and-enterprise/#p[NssBlW]'>joint public-private effort to drive tomorrow&#8217;s innovation</a>. We saw this during the space race, and see it today in terms of government-funded research, but by-and-large, open-source coders have yet to be included. Sure we&#8217;ve seen the &#8220;let&#8217;s have some open-source developers build this for us for free&#8221; type challenges, but that&#8217;s about it. There&#8217;s no ecosystem, no community, no push-pull or give-and-take, and I&#8217;m worried that as CFPB&#8217;s efforts federate across government, this nuance may not federate along with it.</p>\n\n<p>The agency&#8217;s already got <a href='https://github.com/cfpb/transit_subsidy/pull/1'>it&#8217;s first public-generated code contribution</a>, and can expect at least one more on <a href='https://gist.github.com/2343578'>their gist of the policy</a> (Ed. note: does CFPB not <em>own</em> a Blue Book?!), but the possibility of such a relationship with the citizenry doesn&#8217;t seem contemplated by the policy, let alone included as integrally as it should.</p>\n\n<p>I&#8217;d love to see the next iteration of the policy have a third section, &#8220;III. Membership in the Open-Source Community&#8221; on not just publishing code they&#8217;ve developed in house — don&#8217;t get me wrong, that&#8217;s huge — but actually <em>contributing</em>meaningful code to the broader ecosystem, and working directly with the open-source community to foster an active partnership that delivers the best citizen services possible. It&#8217;s a dialog, not a code dump. There needs to be a conversation there.</p>\n\n<p><strong>Procure, Publish, Participate.</strong></p>\n\n<p>It&#8217;s the realization that when you use open-source software, you&#8217;re not a customer. You&#8217;re a member of a community. You&#8217;re invited to a pot-luck dinner. There&#8217;s not the same sense of entitlement you have with proprietary software. It&#8217;s not that they owe you a given feature. There&#8217;s no financial transaction there. It&#8217;s that that feature hasn&#8217;t been developed yet, but can be, the same way every other feature has evolved, through community contributions. There&#8217;s an entirely different philosophy driving the relationship.</p>\n\n<p>For open source in government to work, it&#8217;s got to move beyond procuring community contributed open-source projects on the one hand, and releasing open-source code developed in house distinctly on the other. It&#8217;s about feeling a sense of belonging. It&#8217;s about the agency taking on a sense of ownership in the broader project. It&#8217;s about participation. <sup id='fnref:4'><a href='#fn:4' rel='footnote'>4</a></sup></p>\n\n<p>I think CFPB gets it in a big way, and the fact that this is memorialized in writing is a major step in the right direction. They&#8217;ve got the basic mechanics down — procure open–source projects, publish open-source code — but the missing secret sauce that would really drive the policy home? Participate in the open-source community as a matter of policy.</p>\n\n<p>+1 CFPB, +1. <em>Welcome to the community.</em></p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>In simple terms, the core of open-source projects (as distinct from community-contributed plugins or modules) are primarily fueled by &#8220;patches&#8221; (small code change sets) in response to bugs or feature requests, that get committed to the project&#8217;s codebase and released in subsequent versions.</p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p>If the project is licensed as government work, are my code contributions now government work? Are the government employee lines of code under a broader license, while mine are under a more restrictive license like GPL or apache?</p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p>Is this considered a donation for Federal ethics purposes thus requiring disclosure?</p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li><li id='fn:4'>\n<p>This can manifest itself in lots of different ways, but most tangibly: going to local meetups and conferences (or hosting them); contributing to the project&#8217;s core by introducing new features, documentation, or posting to support forums; abstracting business logic from the start to be more broadly applicable to other developers; outreach and evangelism; and fostering relationships with key stakeholders within the community</p>\n<a href='#fnref:4' rev='footnote'>&#8617;</a></li></ol></div>"}