{"author":"Benjamin J. Balter","title":"What's Missing from CFPB's Awesome New Source Code Policy","excerpt":null,"layout":"post","category":["Law","Technology"],"tags":[".govs","cfpb","code","contracting","copyright","enterprise","fcc","federal","github","gov 2.0","government","IT","open government","open source","procurement","source code policy"],"post_format":[],"url":"/2012/04/10/whats-missing-from-cfpbs-awesome-new-source-code-policy/","date":"2012-04-10 00:00:00 -0400","id":"/2012/04/10/whats-missing-from-cfpbs-awesome-new-source-code-policy","categories":["posts"],"next":"\"Fix typo.\" Not quite \"one small step for man,\" but a significant first nonetheless. These simple words, typed by an open-source developer operating under the pseudonym \"iceeey,\" may represent the first collaborative effort between the federal government and the broader open-source community, and surely represents a tangible win for the open-government movement as a whole.\n\nThe Consumer Financial Protection Bureau (CFPB) is in a unique position. As the youngest federal agency, they have the opportunity to reimagine many day-to-day business processes for an internet era, and to share that innovation across government. One such process is the means by which federal employees apply for and receive subsidies to offset the cost of public transportation to and from work. Having created an application that alleviated the need to shuttle time-consuming, paper-based forms from building to building within their own agency, the Bureau sought to package up the solution, and publicly release the source code for other federal agencies to use and expand upon. The logic was simple: solve the problem once, solve it everywhere.\n\nBut the code was not simply made available for government employees to access. The code was placed on [GitHub][1] – a popular source code sharing service – for anyone to download and explore, and within days of CFPB publishing its [recently announced Source Code Policy][2], someone did just that.GitHub user \"iceeey\" [submitted a proposed change][3] – known in developer parlance as \"forking the project\" and submitting a \"pull request\" — correcting a misspelling on the form initially presented to new employees (\"roundtrip\" was accidentally spelled \"rountrip\").\n\nAdmittedly a minor change (\"one small step for grammar?\"), but notable for the underlying first that it represents: the opportunity to create efficiencies across government by partnering with the broader community of civically engaged developers.\n\nOpen-source software (software for which the underlying source code is made publicly available) as a vehicle for a more open and more efficient government is nothing new. Behind the scenes, countless agencies rely on open-source software for various business functions, and many have even chosen to publicly publish the source code underlying the applications that they themselves have built in-house to tackle unique challenges. But this seemingly innocuous missing \"d\" and its subsequently submitted fix represents the first time a federal agency has directly collaborated with open-source developers to better its own day-to-day tools.\n\nIceeey has [already submitted his second pull request][4] (\"more typos\" he joked with an emoticon smiley), and I hope more agencies and more open-source developers will follow suit. Such collaborations empower agencies to do more with less; put better, more robust tools in the hands of federal employees as they carry out agency mission; and undoubtedly represent a giant-leap forward for a more open and more efficient government.\n\n [1]: http://github.com/\n [2]: http://www.consumerfinance.gov/blog/the-cfpbs-source-code-policy-open-and-shared/\n [3]: https://github.com/cfpb/transit_subsidy/pull/1\n [4]: https://github.com/cfpb/transit_subsidy/pull/2","previous":"<p><a href='http://ben.balter.com/wp-content/uploads/2012/03/wordpress-in-government-ben-balter.png'><img alt='WordPress for Government' class='alignleft' src='http://ben.balter.com/wp-content/uploads/2012/03/wordpress-in-government-ben-balter-150x150.png' /></a></p>\n\n<p>Over the past several years WordPress&#8217;s market share has enjoyed explosive growth across virtually every industry. Today, it powers <a href='http://techcrunch.com/2011/08/19/wordpress-now-powers-22-percent-of-new-active-websites-in-the-us/'>nearly a quarter of new sites</a>, and is the CMS of choice for<a href='http://trends.builtwith.com/cms'>more than two thirds of the top-million sites</a> on the web making it the world&#8217;s most popular publishing platform by a long shot. Yet one group of seemingly ideal users has been slow to take the former blogging platform seriously: .Govs.</p>\n\n<p>Drupal powers twice as many federal .Govs <a href='http://dotgov.benbalter.com'>as every other CMS combined</a>. That&#8217;s more than six Drupal sites for every one WordPress .Gov alone, not to mention the Joomlas, MovableTypes, and SharePoints of the world. The build-it-yourself software powers the White House, the House of Representatives, half a dozen agencies, and countless data-driven microsites like Recovery.gov and the IT Spending Dashboard, and its public sector use is <a href='http://groups.drupal.org/node/19885'>equally if not more impressive abroad</a>.</p>\n\n<h3 id='a_problem_of_perception'>A Problem of Perception</h3>\n<div class='well' style='float:right; width: 300px; margin-left: 20px; text-align: left;'>\n<h4>Typical Enterprise Misconceptions</h4>\n\n<ul>\n<li>WordPress is a blogging platform</li>\n\n<li>WordPress doesn&#8217;t scale well</li>\n\n<li>Most plugins are written by hobbyists, not professionals</li>\n\n<li>WordPress is less secure</li>\n\n<li>WordPress can&#8217;t handle complex data types or user roles</li>\n\n<li>There&#8217;s no enterprise support</li>\n\n<li>There aren&#8217;t many WordPress developers</li>\n\n<li>No &#8220;serious&#8221; people use WordPress</li>\n\n<li>The WordPress codebase is immature</li>\n</ul>\n</div>\n<p>WordPress&#8217;s disproportionately low government adoption is arguably the result of a handful of factors. For one, custom post types, the feature that formally graduated WordPress from a mere blogging platform into a full-fledged content management system, has only been around since June of last year. Yet, even among new sites,<sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> the ratio remains somewhat stagnant, if not shrinking, leaving one to believe that the technology has lapped its own already stellar perception.</p>\n\n<p>When you stack the two side by side (or against any other CMS for that matter), WordPress is objectively the prudent choice. On paper, you&#8217;d be hard-pressed to make the case for anything else. But, it&#8217;s not a technical problem. It&#8217;s a human one. It seems that WordPress&#8217;s greatest asset – ease of use that has resulted in widespread adoption by a largely non-technical user base – is threatening to become its greatest liability.</p>\n\n<p>Among those empowered to make purchasing decisions, there seems to be a sense that WordPress is what you use on the weekends to post pictures of your lunch while Drupal is what you use for &#8220;serious&#8221; business, and with good reason. For better or for worse, Drupal has positioned itself as not just a CMS, but rather <em>the</em> enterprise solution — an inseparable fifth layer of the increasingly ubiquitous enterprise LAMPD stack.</p>\n<table class='table'>\n    <thead>\n        <tr>\n            <th />\n            <th>Drupal</th>\n            <th>WordPress</th>\n        </tr>\n    </thead>\n    <tbody>\n        <tr>\n            <td>API Hooks</td>\n            <td><a href='http://api.drupal.org/api/drupal/includes--module.inc/group/hooks/8'>267</a></td>\n            <td><a href='http://adambrown.info/p/wp_hooks/version/3.2'>1,506</a>(5x)</td>\n        </tr>\n        <tr>\n            <td>Active Sites</td>\n            <td><a href='http://drupal.org/project/usage'>533,136</a></td>\n            <td><a href='http://en.wordpress.com/stats/'>65,052,049</a>(125x)</td>        \n        </tr>\n        <tr>\n            <td>Plugins / Modules</td>\n            <td><a href='http://drupal.org/project/modules'>8,536</a></td>\n            <td><a href='http://wordpress.org/extend/plugins/'>16,076</a>(2x)</td>        \n        </tr>\n        <tr>\n            <td>Themes</td>\n            <td><a href='http://drupal.org/project/themes'>893</a></td>\n            <td><a href='http://wordpress.org/extend/themes/'>1,426</a>(1.5x)</td>        \n        </tr>\n        <tr>\n            <td>Community<sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup></td>\n            <td>1.5 Million</td>\n            <td>20 Million (13x)</td>        \n        </tr>\n    </tbody>\n</table>\n<h3 id='beyond_cowboy_coders'><strong>Beyond Cowboy Coders</strong></h3>\n\n<p>Not surprisingly, the two communities are a reflection of their underlying software&#8217;s position in the broader market. CodePoet.com, for example, a directory of WordPress consultants curated by Automattic, lists <a href='http://codepoet.com/browse/regions/north-america/platforms/wordpress/project-size/250000-250000/'>a mere thirteen firms in North America that seek jobs over $250,000</a>(often a small price tag for government or corporate sites), while its Drupal counterpart lists roughly 80 firms that specifically target <a href='http://drupal.org/marketplace-preview/all/Government'>government</a>, <a href='http://drupal.org/marketplace-preview/all/Corporate'>enterprise</a>, and <a href='http://drupal.org/marketplace-preview/all/Non-Governmental-Organizations'>NGO clients</a> daily.</p>\n\n<p>I am not suggesting that freelance developers should bring an end to what makes WordPress WordPress and change out of their shorts and sandals this instant or that they become intimately familiar with the nuances of federal procurement law, nor am I suggesting that small shops seek to bite off more than they can realistically chew anytime soon. I am suggestion, however, that there are small, tangible steps that the community can take to make headway into the government and enterprise space and gradually entrench WordPress as a viable alternative to otherwise subpar software harming innocent public servants.</p>\n\n<h3 id='1_outdated_language'>1. <code>_Deprecate( ‘</code>Outdated Language<code>&#39; )</code></h3>\n\n<p>The results of the recent WordPress survey suggest that the majority of sites use WordPress <em>as a CMS</em>. That&#8217;s like saying the majority of drivers use their Cadillac <em>as an automobile</em>. WordPress <em>is</em>a CMS. Yet, no one seems to be saying that. WordPress.org calls the software a &#8220;blog tool&#8221;, the WordPress Features codex page <a href='http://codex.wordpress.org/WordPress_Features'>describes the site that the software creates as a &#8220;weblog&#8221; no less than 28 times</a>, <sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup> and the first search result for &#8220;WordPress CMS,&#8221; <a href='http://codex.wordpress.org/User:Lastnode/Wordpress_CMS'>describes &#8220;what aspects of the WordPress… need to be changed in order to turn WordPress into a CMS.&#8221;</a></p>\n\n<p>Especially in the buttoned-up context of corporate and government installs, &#8220;blog&#8221; can be a dirty word. Yet, to get the title of any site, the command we all still run is <code>get_bloginfo()</code>. Inside <code>&amp;lt;?php</code> tags and out, the technology we have created has far outpaced the metaphor we use to describe it.</p>\n\n<h3 id='2_make_new_friends'>2. Make New Friends</h3>\n\n<p>In a typical procurement, be it a federal agency, mid-sized corporation, or local municipality, the CMS does not come first. In fact, many stakeholders wouldn&#8217;t know the site&#8217;s underlying technology if it weren&#8217;t for the logo on the login screen. A firm with a strong reputation in the industry is sought, and based largely on their recommendation, the technology – be it proprietary, open-source, or purpose-built – is chosen by evaluating each across a handful of metrics.</p>\n\n<p>We all know the decision points. Performance and scaling, handing of complex data types, managing user roles, etc. All challenges that WordPress doesn&#8217;t even flinch at, yet the perception among the uninitiated is still widely that between open-source alternatives, WordPress is the least-accomplished in the bunch. Whether its reaching out and inviting nearby firms to your next meetup, giving a WordPress talk at a non-WordPress conference, or just being an exemplar in your local development community, we need to show the tie-wearing few in the conference room that you don&#8217;t have to be boring, overly complex, or unnecessarily expensive to get the job done right.</p>\n\n<h3 id='3_but_wait_theres_more'>3. But Wait, There&#8217;s More…</h3>\n\n<p>WordPress consultants are great at selling themselves, but rarely does anyone ever sell WordPress. Ask my why an agency or municipality should adopt Sharepoint, and I have page after page of <a href='http://sharepoint.microsoft.com/en-us/product/benefits/Pages/default.aspx'>focus-group tested material tailored to my industry</a>. Ask my why anyone should use WordPress, and <a href='http://ben.balter.com/2011/09/01/why-wordpress/'>I&#8217;m pretty much left to fend for myself</a>. Somewhat counterintuitive in a world of free software, migrating to WordPress comes with significant costs that firms need to take into account, both real and imagined, costs that the technology&#8217;s ambassadors must actively overcome. Beyond actual development and training costs, there are perceived risks of an immature codebase, insecure plugins, and a general inability to do the job.</p>\n\n<p>One of WordPress&#8217;s greatest strengths is its tight-nit cadre of dedicated enthusiasts. Yet it can often be hard for those on the inside to see things as those outside do. Think about those who have not yet tasted just how sweet the punch is. The name WordPress most often makes its way into a CIO&#8217;s inbox, for example, only when there&#8217;s been a security breach, not when there&#8217;s been a feature release. Where other platforms have stagnated, WordPress&#8217;s &#8220;can-do&#8221; attitude has forged onward introducing even more one-of-a-kind features, yet all too often they go unnoticed or underappreciated where it matters. Both collectively and individually, for WordPress to gain the respect of &#8220;the man,&#8221; we must seek to broadcast its excellence. Now is not the time for humility.</p>\n\n<h3 id='4_build_serious_features_for_serious_users'>4. Build Serious Features for Serious Users</h3>\n\n<p><a href='http://wordpress.org/about/philosophy/'>WordPress&#8217;s core philosophy</a> has always been to &#8220;code for the majority&#8221; and with the amount of customization required out-of-the-box to do just about anything, arguably Drupal&#8217;s philosophy has been &#8220;code for yourself.&#8221; While Automattic does a great job with <a href='http://en.wordpress.com/notable-users/'>the CNN&#8217;s and TechCrunch&#8217;s of the world</a>, there&#8217;s a huge opportunity here for developers to fill a void by giving rise to a new generation of core features, plugins, and themes with &#8220;serious&#8221; implementations in mind. Rather than another social media plugin, what&#8217;s the next big thing? Large-scale data? Geolocation? APIs and interoperability?</p>\n\n<p>NASA&#8217;s space-race supercharching of the aerospace industry brought consumers everything from Super Soakers to sun glasses, and that same reach for the stars philosophy can put yet-unimagined power in the browsers of everyday WordPress users. Distraction free writing and an <em>even</em> more intuitive administrative interface are killer features to be sure, but they are the icing on an already beautiful cake and do little to gain parity with more traditional CMSs let alone take on the CMS space in the &#8220;WordPress Way.&#8221; A good example of this may be <a href='http://ben.balter.com/2011/08/29/wp-document-revisions-document-management-version-control-wordpress/' title='WP Document Revisions — Document Management &amp; Version Control for WordPress'>WP Document Revisions</a>, a document management and workflow management tool built almost solely using core functionality. By leveraging WordPress&#8217;s core competencies, the venerable CMS can not only gain a seat at the adult&#8217;s table, but exponentially improve the experience for its primary user base as well</p>\n\n<h3 id='frenemies'>Frenemies</h3>\n\n<p>It&#8217;s important to note, though, it&#8217;s not a zero-sum game. Drupal doesn&#8217;t compete with WordPress like McDonalds does with Burger King or Coke with Pepsi. Government support for open-source software is a good thing, regardless of what form it takes. True, an infusion of publicly funded effort into the WordPress code base would invariably advance the software just as government funded research advances hard sciences, but, in the end, everybody wins here.</p>\n\n<p>WordPress and government just make sense. As public institutions both large and small face growing budget concerns and begin to shift many of their services to the web, a platform like WordPress built with engagement, collaboration, and dialogue is the ideal fit, not to mention, incredibly persuasive when compared to expensive, propriety, or purpose-built alternatives.</p>\n\n<h3 id='we_all_have_a_stake'><strong>We All Have a Stake</strong></h3>\n\n<p>Whether WordPress is your primary source of income, a hobby, or just the thing that powers your personal site, we all have a stake in WordPress&#8217;s future. It is paramount that the community stays true to its scrappy roots. After all, there&#8217;s no sense selling the couch to buy a new TV. Yet, in order to be taken seriously by the public sector as a platform for more than simply sharing photos of kitten and chronicling teenage angst, we must first take ourselves seriously, and take baby steps to bring government adoption in line with the WordPress community&#8217;s otherwise unparalleled and well-deserved success.</p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>Jen Lampton, &#8220;Why WordPress is Better than Drupal, Developers Take Note&#8221; (July, 2010)</p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p><strong>Update (3/7):</strong> As many have pointed out, a lot of the misinformation may also be traced back to somewhat of a <em>decision lag</em>. Custom post types, custom taxonomies, and WordPress multisite — three key features that although minor from a technical standpoint, really served as the fundamental shift to transition the platform from <em>blog+</em> to <em>full-fledged CMS</em> — came about only three major versions ago (WordPress 3.0). While eighteen months may be an eternity for the vast majority of the technology sector (the iPad 1 had just barely launched eighteen months ago for comparison), in the Government space, <a href='http://ben.balter.com/2011/11/29/towards-a-more-agile-government/'>procurement regulations dictate that such lag times are all but the norm</a>. As a result, in an already risk-averse contracting environment, we may actually be seeing numbers that more accurately reflect say, WordPress 2.9&#8217;s reception in the Government sector — a snapshot of when an agency chose a CMS at the onset of a multi-year procurement — rather than those that accurately reflect its technical capabilities today.</p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p><strong>Update (3/8):</strong> The features page is part of a community edited Wiki (the WordPress Codex) and since originally posted, I&#8217;ve gone through and reworked much of the blog-specific language. <a href='http://codex.wordpress.org/index.php?title=WordPress_Features&amp;oldid=113531'>View the original</a>.</p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li></ol></div>","content":"<p><img alt='CFPB Logo' class='alignright' src='http://www.treasury.gov/press-center/news/PublishingImages/CFPB.jpg' /></p>\n\n<p>Most often, when we talk about open source in government, it&#8217;s talked about in one of two ways: either it&#8217;s <a href='http://ben.balter.com/2011/11/29/towards-a-more-agile-government/'>the pitfalls of the federal IT procurement model</a> that can&#8217;t seem to comprehend a world in which open-source is an option, much less potentially a superior choice (<a href='http://radar.oreilly.com/2011/09/open-source-government-it-goscon.html'>&#8220;acquisition as a roadblock</a>&#8221;), or it&#8217;s reiterating the same open-source talking points that haven&#8217;t seemed to give open source much parity with the wall of organizational inertia proprietary software seems to have gained over the years (&#8221;<a href='http://benbalter.github.com/open-source-alternatives/'>open source as an alternative</a>&#8221;).</p>\n\n<p>The <a href='http://cfpb.gov'>Consumer Financial Protection Bureau</a> (CFPB), however, is in a unique position. As the newest kid on the block, it&#8217;s one of the few government agencies to have been born in a digital era, and more importantly, without the bureaucratic baggage that all too often stymies innovation. They have a chance to &#8220;do it right&#8221; from the start… and they&#8217;re doing just that.</p>\n\n<p><strong>An Agency Born of the Internet Generation</strong></p>\n\n<p>Yesterday, CFPB <a href='http://www.consumerfinance.gov/developers/sourcecodepolicy/'>announced a bureau-wide preference for open source</a> in its shiny new <a href='http://www.consumerfinance.gov/developers/sourcecodepolicy/'>Source Code Policy</a>, by my <a href='http://www.google.com/search?sugexp=chrome,mod=4&amp;sourceid=chrome&amp;ie=UTF-8&amp;q=source+code+policy+site%3A.gov'>crude research</a>, a first for any government agency. There are two watershed shifts here: first, that the agency not only should, but <em>must</em> evaluate open source software on equal footing to its proprietary counterparts, a comparison which I believe will <a href='http://www.amazon.com/The-Wealth-Networks-Production-ebook/dp/B0015GWX0S'>increasingly fall in open source&#8217;s favor</a>, and second, that unless there&#8217;s an overriding security or similar concern <em>not to</em>, public code must be public. There&#8217;s nothing new here. All it says is that we should use the best software for the job (a no-brainier), and that that software, the public&#8217;s property, should belong to the public.</p>\n\n<p>So why is this news? Plenty of government entities have <a href='http://www.fcc.gov/blog/contributing-code-back-fcc-govs-open-source-feedback-loop'>released</a> <a href='http://www.whitehouse.gov/blog/2011/02/11/whitehousegov-releases-second-set-open-source-code'>source</a> <a href='http://open.nasa.gov'>code</a>, or <a href='https://update.cabinetoffice.gov.uk/resource-library/open-source-procurement-toolkit'>encouraged the</a><a href='http://www.finance.gov.au/e-government/infrastructure/docs/AGuidetoOpenSourceSoftware.pdf'>use of open</a>-<a href='http://www.tekno.dk/pdf/projekter/p03_opensource_paper_english.pdf'>source software</a>. But no one has come out and <a href='https://twitter.com/#!/victorzapanta/status/189390759181557760'>plainly stated that they were an &#8220;open-source agency&#8221;</a>, that open source is the new default, and that absent an affirmative step by some nay-sayer, that the public will have access to their code.That&#8217;s huge. It&#8217;s flipping the burden, and it&#8217;s the way things should be from the start.</p>\n\n<p><strong>But Where&#8217;s the Beef?</strong></p>\n\n<p>That said, there&#8217;s one thing the source code policy is noticeably silent on: <em>the ecosystem</em>. Posting code is great and it&#8217;s great that they&#8217;ve done the legal legwork so other agencies can follow suit, but that&#8217;s just the 1.0. The true power of open source comes not from simply publishing code, but from being a member of a broader coding community. Can a CFPB employee contribute a patch to an existing open source project on CFPB time? <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> What about contributing to a CFPB project once he or she&#8217;s left? What happens to my rights when I fork a <a href='http://github.com/cfpb'>CFPB project on GitHub</a> and send the agency a pull request? <sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> Can the agency even accept my code legally? <sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup> There&#8217;s a lot of legal ambiguity there, and it&#8217;s just the kind of legal ambiguity a well-intentioned government attorney can seize upon to gum up the very gears that are driving this incredible move.</p>\n\n<p>We&#8217;ve seen the same progression in the open data world. The 1.0 is posting 10 XML files at a gigabyte each — an arms-length relationship with developers — arguably open data simply for open data&#8217;s sake. The secret sauce lies in the relationship, in publishing APIs and web services rather than static data, to build an ecosystem around the agency&#8217;s work.</p>\n\n<p><strong>An Innovation Ecosystem</strong></p>\n\n<p>Imagine if government agencies served as the catalyst for a <a href='http://ben.balter.com/2012/03/05/wordpress-for-government-and-enterprise/#p[NssBlW]'>joint public-private effort to drive tomorrow&#8217;s innovation</a>. We saw this during the space race, and see it today in terms of government-funded research, but by-and-large, open-source coders have yet to be included. Sure we&#8217;ve seen the &#8220;let&#8217;s have some open-source developers build this for us for free&#8221; type challenges, but that&#8217;s about it. There&#8217;s no ecosystem, no community, no push-pull or give-and-take, and I&#8217;m worried that as CFPB&#8217;s efforts federate across government, this nuance may not federate along with it.</p>\n\n<p>The agency&#8217;s already got <a href='https://github.com/cfpb/transit_subsidy/pull/1'>it&#8217;s first public-generated code contribution</a>, and can expect at least one more on <a href='https://gist.github.com/2343578'>their gist of the policy</a> (Ed. note: does CFPB not <em>own</em> a Blue Book?!), but the possibility of such a relationship with the citizenry doesn&#8217;t seem contemplated by the policy, let alone included as integrally as it should.</p>\n\n<p>I&#8217;d love to see the next iteration of the policy have a third section, &#8220;III. Membership in the Open-Source Community&#8221; on not just publishing code they&#8217;ve developed in house — don&#8217;t get me wrong, that&#8217;s huge — but actually <em>contributing</em>meaningful code to the broader ecosystem, and working directly with the open-source community to foster an active partnership that delivers the best citizen services possible. It&#8217;s a dialog, not a code dump. There needs to be a conversation there.</p>\n\n<p><strong>Procure, Publish, Participate.</strong></p>\n\n<p>It&#8217;s the realization that when you use open-source software, you&#8217;re not a customer. You&#8217;re a member of a community. You&#8217;re invited to a pot-luck dinner. There&#8217;s not the same sense of entitlement you have with proprietary software. It&#8217;s not that they owe you a given feature. There&#8217;s no financial transaction there. It&#8217;s that that feature hasn&#8217;t been developed yet, but can be, the same way every other feature has evolved, through community contributions. There&#8217;s an entirely different philosophy driving the relationship.</p>\n\n<p>For open source in government to work, it&#8217;s got to move beyond procuring community contributed open-source projects on the one hand, and releasing open-source code developed in house distinctly on the other. It&#8217;s about feeling a sense of belonging. It&#8217;s about the agency taking on a sense of ownership in the broader project. It&#8217;s about participation. <sup id='fnref:4'><a href='#fn:4' rel='footnote'>4</a></sup></p>\n\n<p>I think CFPB gets it in a big way, and the fact that this is memorialized in writing is a major step in the right direction. They&#8217;ve got the basic mechanics down — procure open–source projects, publish open-source code — but the missing secret sauce that would really drive the policy home? Participate in the open-source community as a matter of policy.</p>\n\n<p>+1 CFPB, +1. <em>Welcome to the community.</em></p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>In simple terms, the core of open-source projects (as distinct from community-contributed plugins or modules) are primarily fueled by &#8220;patches&#8221; (small code change sets) in response to bugs or feature requests, that get committed to the project&#8217;s codebase and released in subsequent versions. <span>24</span></p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p>If the project is licensed as government work, are my code contributions now government work? Are the government employee lines of code under a broader license, while mine are under a more restrictive license like GPL or apache? <span>25</span></p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p>Is this considered a donation for Federal ethics purposes thus requiring disclosure? <span>26</span></p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li><li id='fn:4'>\n<p>This can manifest itself in lots of different ways, but most tangibly: going to local meetups and conferences (or hosting them); contributing to the project&#8217;s core by introducing new features, documentation, or posting to support forums; abstracting business logic from the start to be more broadly applicable to other developers; outreach and evangelism; and fostering relationships with key stakeholders within the community <span>27</span></p>\n<a href='#fnref:4' rev='footnote'>&#8617;</a></li></ol></div>"}