{"author":"Benjamin J. Balter","title":"A Site By Any Other Name...","excerpt":"DHS recently began protecting America's shores from threats of a different kind: online copyright infringement. In the days before the Superbowl, the agency set out to enforce the \"express written consent of the NFL\" provision attached to most broadcasts by slamming the iron fist of the law down on six sports-streaming websites.\n","layout":"post","categories":["Law","Technology"],"tags":["censorship","copyright","digital due process","domains"],"post_format":[],"related_posts":[{"url":"/2010/09/12/wordpress-resume-plugin/","id":"/2010/09/12/wordpress-resume-plugin","title":"WordPress Resume Plugin"},{"url":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party/","id":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party","title":"New Media Flak: Megaphone vs. Cocktail Party"},{"url":"/2010/10/10/does-every-cloud-have-a-silver-lining/","id":"/2010/10/10/does-every-cloud-have-a-silver-lining","title":"Does Every Cloud Have a Silver Lining?"},{"url":"/2010/11/06/removing-the-barriers-to-organizational-agility/","id":"/2010/11/06/removing-the-barriers-to-organizational-agility","title":"Removing the Barriers to Organizational Agility\n"},{"url":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing/","id":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing","title":"What Fourteen-Century Apple Pie Teaches Us About Sharing\n"},{"url":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds/","id":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds","title":"Will Federal Contracting Officers Soon Have Their Heads in the Clouds?\n"},{"url":"/2010/11/29/free-trade-in-china-just-google-it/","id":"/2010/11/29/free-trade-in-china-just-google-it","title":"Free Trade in China? Just Google it."},{"url":"/2010/11/29/twitter-mentions-as-comments/","id":"/2010/11/29/twitter-mentions-as-comments","title":"Twitter Mentions as Comments WordPress Plugin\n"},{"url":"/2010/12/01/the-internet-is-series-of-tubes/","id":"/2010/12/01/the-internet-is-series-of-tubes","title":"The Internet is Series of Tubes (oh, and Tollgates too)\n"},{"url":"/2010/12/20/late-night-infomercials/","id":"/2010/12/20/late-night-infomercials","title":"Late-Night Infomercials: Guaranteed to Extend the 4th Amendment or Your Money Back"}],"url":"/2011/02/03/a-site-by-any-other-name/","date":"2011-02-03 00:00:00 +0000","id":"/2011/02/03/a-site-by-any-other-name","next":"/2011/03/09/craft-your-personal-brand","previous":"/2011/01/25/gw-course-schedule-and-campus-api","content":"<p><img alt='' src='http://ben.balter.com/wp-content/uploads/2011/02/IPRC_Seized_2010_11-300x225.gif' />Violating due process is one thing, but violating web standards… well that&#8217;s another story.</p>\n\n<p>The Department of Homeland Security (DHS) recently began protecting America&#8217;s shores from threats of a different kind: online copyright infringement. In the days before the Superbowl, the agency set out to enforce the &#8220;express written consent of the NFL&#8221; provision attached to most broadcasts by slamming the iron fist of the law down on <a href='http://itwel.com/atdhe-live-sports-streaming-website-seized-by-us-authorities.php'>six sports-streaming websites</a>. This is troubling on multiple levels. As the Vololkh Conspiracy&#8217;s David Post <a href='http://volokh.com/2011/02/02/more-outrageous-domain-name-seizures-by-our-vigilant-dept-of-homeland-security/'>put it</a>:</p>\n\n<blockquote>\n<p>There&#8217;s a good reason we don&#8217;t generally allow agents of the State to march into judge&#8217;s chambers and deprive people of their property without an adversary hearing, viz., they&#8217;re likely to make errors that can be difficult to correct ex post.</p>\n</blockquote>\n\n<p>And that&#8217;s exactly what happened when the Feds <a href='http://www.huffingtonpost.com/2011/02/02/rojadirecta-org-seized_n_817458.html'>seized riojadirecta.org</a>.However, the law in the area is a bit more nuanced than a single form can satisfy. Riojadirecta did not actually host any infringing content — it merely aggregated links to such content — potentially invoking the safe harbor provisions of the copyright act. <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> Compounding the issue, Spanish Courts had found the Spanish-based site to be <a href='http://torrentfreak.com/sports-streaming-torrent-links-site-victorious-in-court-100510/'>perfectly legal</a>, just a few months prior.</p>\n\n<p>Seizures of this type are nothing new. Back in November, DHS <a href='http://torrentfreak.com/u-s-government-seizes-bittorrent-search-engine-domain-and-more-101126/'>commandeered</a> some <a href='http://www.ice.gov/doclib/news/releases/2010/domain_names.pdf'>80 bit torrent domains</a> (PDF) as part of the broader &#8221;<a href='http://www.ice.gov/news/releases/1006/100630losangeles.htm'>Operation In Our Sites</a>&#8221;. One such site, dajaz1.com, a music blog dedicated to hip-hop, was claimed to have infringed on music copyrights, however it was later revealed that the <a href='http://www.nytimes.com/2010/12/20/business/media/20music.html?_r=1&amp;ref=todayspaper'>music in question was provided to the site by music industry executives</a>. Despite this revelation, DHS made no apparent move to look into the case or restore the domain, and <a href='http://dajaz1.com/'>the site remains down</a> to this day.</p>\n\n<p>Part of the problem may stem from law enforcement being out of touch with today&#8217;s trends. Even the agent in charge of the investigation <a href='http://arstechnica.com/tech-policy/news/2010/12/busting-bittorrent.ars'>referred to the infringing material as &#8220;a bit torrent,&#8221;</a> suggesting a sophomoric understand of just what exactly was being seized.</p>\n\n<p>More worrisome, however, is the fact that the statute cited to authorize such seizures, 18 U.S.C. § 2323, provides no safeguard to prevent such errors from occurring <sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> nor does it <a href='http://www.copyhype.com/2011/02/can-google-be-seized-by-ice/'>prohibit its expanded use</a>. <sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup> As Sen. Ron Wyden (D-OR) <a href='http://arstechnica.com/tech-policy/news/2011/02/senator-us-domain-name-seizures-alarmingly-unprecedented.ars?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=rss'>argued</a>:</p>\n\n<blockquote>\n<p>In contrast to ordinary copyright litigation, the domain name seizure process does not appear to give targeted websites an opportunity to defend themselves before sanctions are imposed… I worry that domain name seizures could function as a means for end-running the normal legal process in order to target websites that may prevail in full court. The new enforcement approach used by Operation In Our Sites is alarmingly unprecedented in the breadth of its potential reach.</p>\n</blockquote>\n\n<p>Even looking beyond the due process issues and to the underlying copyright infringement, simply put, the government&#8217;s efforts fail to solve the problem. In Riojadirecta&#8217;s case, for example, the site <a href='http://twitter.com/#!/rojadirecta/status/32348722188779520'>used Twitter</a> to <a href='http://www.huffingtonpost.com/2011/02/02/rojadirecta-org-seized_n_817458.html'>direct users to one of its five other domains</a> rending the seizure a moot point. The problem is that the government is not seizing the infringing material, but rather, an <a href='http://en.wikipedia.org/wiki/Domain_name'>alias for the network address</a> of a site that in many cases, only contains links to infringing material. It would be as if DHS seized my cell phone number because my friends could use it to call and find out the location of a weekly poker game — the game would still take place, I would just get a new phone number.</p>\n\n<p>The most upsetting part, at least for the web developer in me, has to be <a href='http://dajaz1.com/IPRC_Seized_2010_11.gif'>the seizure notice</a> itself. Putting text in images like that has to be up there with <a href='http://bancomicsans.com/'>using Comic Sans</a>. While I do not expect DHS to hire a legion of designers and developers to make an HTML5 seizure notice (although that would be awesome), some in-document text would go a long way to making the web a whole lot less ugly. <sup id='fnref:4'><a href='#fn:4' rel='footnote'>4</a></sup> Additionally, it looks like their policy has changed since the initial seizures, however, at least as late as November, DHS was <a href='http://qbit.cc/homeland-security-tracking-visits-to-seized-domains-using-google-analytics-and-piwik/'>placing Google Analytics and Piwik tracking codes on its seized domains</a>, arguably in violation of <a href='http://www.whitehouse.gov/sites/default/files/omb/assets/memoranda_2010/m10-22.pdf'>OMB memorandum M-10-22</a> (PDF).</p>\n\n<p>As seen in the recent <a href='http://gawker.com/#!5704966/wikileaks-loses-its-domain'>Wikileaks domain shell game</a>, its clear that domain servers are the weak link in the online content-delivery chain. When the state can no longer seize something that represent the forefront of our ability to communicate with one another (decentralized information sharing) and replace it with a technology the web collectively deprecated with the rise of CSS1 (sites which rely on .GIFs to render text), legality and politics aside, the internet will undoubtedly be a better place.</p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>17 U.S.C. § 512(d).</p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p>The relevant provisions of § 2323 allow for the forfeiture of &#8220;(A) Any article, the making or trafficking of which is, prohibited under section 506 of title 17″ prohibiting &#8220;willful copyright infringement&#8221; and &#8220;(B) Any property used, or intended to be used, in any manner or part to commit or facilitate the commission of an offense referred to in subparagraph (A).&#8221;</p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p>As <a href='http://volokh.com/2010/12/01/copyright-enforcement-tail-wags-internet-dog-contd-or-what-the-hell-ever-happened-to-due-process/'>Post noted back then</a>, and even more relevant now in light of Egypt&#8217;s recent flipping of its internet kill switch, &#8220;our ability to defend the principle of the single global Internet – the Internet where all of humanity has equal access to knowledge and ideas, the Internet that looks the same to, and allows free and unfettered communication between, users located in Shanghai and Seattle and Santiago, free of locally imposed censorship regimes – will be deeply compromised by [seizures of this kind], which would enshrine in U.S. law for the first time the contrary principle: that all countries have a right to insist on the removal of content, wherever located, from the global Internet in service of the exigencies of local law.&#8221; (Quoting a <a href='http://volokh.com/2010/12/01/copyright-enforcement-tail-wags-internet-dog-contd-or-what-the-hell-ever-happened-to-due-process/'>letter he authored</a> criticizing the Senate&#8217;s Combating Online Infringements and Counterfeits Act).</p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li><li id='fn:4'>\n<p>Beyond being reminiscent of Geocities (and most of the 90s), text in images is not machine readable, a requirement of section 508 (codified at 29 U.S.C. § 794(d)) . That means that neither screen readers nor search engines can accurately parse the site&#8217;s content.</p>\n<a href='#fnref:4' rev='footnote'>&#8617;</a></li></ol></div>"}