{"title":"Developer, WordPress Document Revisions","organization":"Google Summer of Code","section":"Experience","from":"April 2011","to":"August 2011","location":null,"category":"resume","robots":"noindex, nofollow","layout":"default","url":"/0001/08/10/developer-wordpress-document-revisions/","date":"0001-08-10 00:00:00 -0500","id":"/0001/08/10/developer-wordpress-document-revisions","categories":["resume"],"next":"*   Negotiated agency-wide, federal service agreements with the web’s top service providers including FISMA-compliant cloud hosting, social media, data manipulation, source code collaboration, and geospacial firms.\n*   Drafted website privacy policy, comment moderation policy, third-party privacy notices, and API terms of service for agency’s reimagined web presence.\n*   Created legal and technical roadmaps to ensure compliance of new media platforms with White House Office of Management and Budget memorandums M-10-22 and M-10-23 governing federal agencies’ use of website tracking technologies and third-party services.\n*   Supported New Media Team’s procurement efforts, including scope of work, impact statement, and limited source justification drafting.\n*   Received Superior Achievement Award for customer service, quality performance, and overall contribution to the agency mission.\n*   Led adoption, implementation, and analysis of Google Analytics website visitor tracking statistics.\n*   Developed more than 30 in-house software tools including [open-source website auditing and site-mapping software][1] instrumental to evaluation of online presence spanning more than 1.2 million pages.\n\n [1]: http://github.com/fcc","previous":"<ul>\n<li>Support technology needs of rapidly expanding, 10,000+ member <a href='http://hackshackers.com/'>international grassroots journalism organization</a> in 26 cities and 7 countries dedicated to creating a thriving network of journalists and technologists rethinking the future of news and information.</li>\n</ul>","tags":[],"content":"<ul>\n<li>With stipend from Google, developed government- and enterprise-friendly, <a href='http://ben.balter.com/2011/08/29/wp-document-revisions-document-management-version-control-wordpress/'>open-source document and workflow management system</a> for WordPress, the content management system that powers nearly a quarter of new websites today. The project has been downloaded more than 10,000 times to date.</li>\n</ul>"}