{"author":"Benjamin J. Balter","title":"Enterprise, Open Source, and Why Better is not Enough\n","excerpt":"Firms looking to seek a competitive advantage will begin to look past \"it has to be expensive and complicated\" and start looking toward open-source software, not as a misfit alternative, but as a viable player in the software space, but before that can happen the open-source community must strive to be the serious competitor they wish to be treated as.\n","layout":"post","category":["Business","Technology"],"tags":["career","cloud","cloud computing","generation gap","google","innovation","open source","organizational change","wordpress"],"post_format":[],"url":"/2011/08/31/enterprise-open-source-and-why-better-is-not-enough/","date":"2011-08-31 00:00:00 -0400","id":"/2011/08/31/enterprise-open-source-and-why-better-is-not-enough","categories":["posts"],"next":"WordPress is *[different][1]*. WordPress is about content. WordPress is about simplicity. Out of the box, it's a clean, lean, and mean semantic publishing platform that makes broadcasting your ideas as effortless as possible.\n\n*   **Proven** – WordPress powers [nearly a quarter][2] of new sites today, is the content management system (CMS) of choice for [more than two thirds][3] of the top million sites making it the most popular on the web, and is trusted by content publishers both large and small including CNN and the NY Times. With more than [50 million sites globally][4] and eight years of proven history, you know you're getting the best software for the job.\n*   **Ease of use** – At the core of WordPress is a [dumb-simple interface][5] similar to the desktop publishing software you use today. With no coding experience or expert knowledge necessary, the learning curve is[ often about as short as typing in your site's URL and logging in][6]. In fact, most users are able to pick up the basics without any training at all. Interfaces are polished and easy to use, and are the result of years of refinement. It's the power of a Microsoft Word with the intuitiveness of an iPhone.\n*   **Built for Publishing**- WordPress makes sharing content and attracting readers to your site a breeze. Whether pushing content to social networks, ensuring that your website is provided in the [optimal format to appear at the top of search results][7] the moment you hit publish, or providing visitors the ability to [subscribe to specific content sub-feeds][8] in their favorite feed reader (or even via e-mail), WordPress is not simply a website, but rather a content-publishing platform. With a single click, you have a powerful megaphone to broadcast your message to the world\n*   **Community Support** – WordPress is supported by a [vibrant community of users][9] who have already solved many of the toughest challenges to sharing information today. The latest version of WordPress has been download [more than five million times][10] since it was release a month ago, and the prior version was downloaded more than 32 million times. With a library of [more than 20,000 free, open-source plug-ins and themes][11] growing each day, and hundreds of core contributors each release cycle, the WordPress community is an ecosystem built around the platform's viability and proven success.\n\n### Content Is King\n\n*   **Your Entire Workflow** - Although it may sound a bit counter intuitive for some that saw the letters QWERTY together for the first time on an [IMB Selectric][12], WordPress can actually take the place of your entire workflow from the initial draft to the time you hit publish – spelling, grammar, collaboration, and review – there's no need for e-mails back-and-forth or expensive desktop software.\n*   **Beyond Black and White **- Everything that makes webpages feel rich – pictures, videos, music, documents – can feel right at home in WordPress. With a drag-and-drop [file uploader][13] that uses the latest technology to ensure your file efortlessly makes it to the web page every time, and a [media browser to help you store, organize and find the files][14] you're looking for, WordPress hosts the files that make your pages pop.\n*   **Distraction Free Writing** - Between E-Mail, IMs, Texts, Tweets, and Status Updates, we have enough distractions as is today. Your publishing platform should not be one of them. While writing WordPress literally fades away letting you concentrate on your ideas themselves, not how you're getting them out there.\n*   **Never Lose a Word** - WordPress [automatically saves your work][15] as you type so you don't have to worry if your computer crashes or you make a mistake. Want to go back to a previous version? Not a problem. Every time you hit save, [WordPress creates a snapshot][16] that you can restore with a single click.\n*   **Time Travel** - Okay, not really, but it's pretty close. WordPress lets you schedule posts for some time in the future or lets you backdate a post for some time in the past so that you can write when its convenient for you.\n*   **Publish Anywhere** - The internet's every, so why shouldn't your workflow be? WordPress has [mobile applications][17] for Android, iOS, Blackberry, Nokia, Windows Phone 7, even WebOS. Wherever you are, control of your site is *literally* at your fingertips. Your phone not listed? No fret. You can even [post to your site by e-mail][18].\n\n### A Supercharged V8 Under the Hood\n\n*   **The Right Tuxedo for Any Content** – Your content deserves the best. The site should conform to your content, not the other way around. WordPress comes with a [full theme system][19] which makes designing everything from the simplest site to the most complicated portal a piece of cake. Have a new design every day. Your ideas should look as good as what they say.\n*   **Obsessively Organized** - It doesn't matter how much content you have, if your visitors can't find it. WordPress organizes your content by day, by month, by year, by author, by category — any way you can describe it — and dynamically creates browsable archives so things always stay up to date.\n*   **Killer Search Inside and Out **- WordPress has killer search baked in. Every word you write is fully searchable through a single box at the top of each page and if your users choose to use an external search engine like Google, rest assured, WordPress will present your content in a way that all but ensures it makes it to the top of the results every time.\n*   **Even the URLs are Beautiful **- Ever go to a site and look up to the URL bar only to see a string of letter and number gobbledygook? WordPress realizes that websites are built for people, not computers. Every URL is [intuitively written for humans][20] and describes what your content says, not where it sits in a database.\n*   **Typography Nerds Rejoice** - To do it right, publishing on the web can be a pain without the right tools. Every time you hit publish [WordPress silently typesets each and every letter for seamless web production][21]. Where many other CMSs let the details fall by the wayside, WordPress uses the [Texturize][22] engine to intelligently converts web-unfriendly characters like quotes, apostrophes, ellipses, em and en dashes, multiplication symbols, and ampersands into typographically correct HTML entities.\n*   **¡Bienvenidos a WordPress!** - WordPress has been translated to more than [60 different languages][23], so however you say \"publish\", you'll be saying it in no time flat.\n*   **Drag and Drop Administration** - Weren't a computer science major in college? No degree required, promise. Most of what users see from [menus][24] to the [dynamic functionality on each page][25] can be fully customized with simple drag-and-drop controls on the back end.\n*   **Multiple Personalities** - Got a bunch of users? Not a problem. WordPress lets you [define different roles for different users][26] – just like in real life – and lets you assign privileges accordingly. Users can register themselves (if you want), and can submit content for your review.\n\n### User Tested, Geek Approved\n\n*   **Out-of-the-box Power** - WordPress provides extensive functionality right out-of-the-box and often little customization is needed to adapt the software for your unique use. Many other CMSs rely on you to hunt down, install, and configure a long-list of add-ons just to get many of the features WordPress considers core (comments, RSS feeds, revisions, etc.) and relies on developers to undertake significant coding efforts to provide the functionality you need. WordPress does the heavy lifting so you don't have to. Why reinvent the wheel when you already have the best wheel in the world?\n*   **Open and Transparent **- WordPress is built by a dedicated community of professional developers, academics, and enthusiasts with the source code released to the world to take apart, build upon, and improve. It's hallmark is a rapid development cycle, meaning frequent updates and always up-to-date software, all with no licensing fees or direct costs. And with an extensive international community professional support is always wherever you are.\n*   **It's Your Data** - Some publishing platforms like to lock you in with proprietary data formats. Not here. WordPress relies on open standards to allow you to take your data with you, and even comes with tools to seamlessly import from many popular sources. It's your data, and you should do what you want with it.\n*   **It's Your Software** - WordPress is designed to be installed on your own web server, in the cloud, or in a shared hosting account. You have complete control. Unlike commercial software or third-party hosted services, you can be sure of being able to access and modify everything related to your site. You can even install WordPress on your personal computer, or on a corporate intranet.\n*   **Power One Site or Millions** - WordPress offers multi-site technology. It is the same technology that powers over 20 million sites on [WordPress][27][.][27][com][27] and global sites like CNN and the New York Times. Multi-site technology allows users to have full administrative control over their own site, without any security concerns. Each site can have its own look-and-feel (themes), its own functionality (plug-ins), and manage its own users, while at the same time, network-wide policies and security updates can be deployed at the click of a button.\n\n### Your CIO will Love it\n\n*   **Your Site is Your Castle **- WordPress has more than eight years of history powering stable, [secure websites][28]. Vulnerabilities are discovered quickly because of the wide user-base and dedicated open-source community, patches are rapidly developed by the dedicated security team, and often released in the span of hours from the time they are reported. WordPress comes with an[ integrated core-update system][29], so patches are deployed at the click of a mouse. WordPress[ sanitizes all user input][30], restricts URL access, has an extensive user permissioning system, and never stores passwords in an unecryptable format. WordPress uses WordPress.com's 20 million users to beta test releases before they come out, so that by the time new versions are released, stakeholders can be confident in their stability.\n*   **Extensive APIs** - WordPress's core relies on its own[ extensive API interface][31] (commonly known as [dogfooding][32]) which consequently allows developers to quickly and effectively customize the application to their unique needs. Many aspects of the essential WordPress experience can be overridden or modified by user-generated [hooks and filters][33]. These APIs help WordPress integrate seamlessly with existing systems, a necessity in a stove-pipe rich environments.\n*   **Enterprise Ready** - Any challenge the agency faces, chances are, someone else has already tackled it and provided the code free of charge. WordPress has been adapted to countless enterprise environments, and provides support for Active Directory authentication, user management, work-flow integration, and scheduled backups, among other enterprise-centric features.\n*   **Interoperability** - Want to connect WordPress to another system? WordPress uses [XML-RPC][34], an open XML standard that allows different systems in different environments to talk to one another. XML-RPC is designed to be as simple as possible, while at the same time allowing for complex tasks to be performed.\n*   **Maintenance so simple you'll wonder why you did it the other way**- Installing and upgrading WordPress is a piece of cake. WordPress's [famous five minute install][35] is the envy of the industry, and with [one click updates][36], you'll know you always be using the best. Try it and you'll wonder why all software isn't this easy.\n*   **Trust, but Verify** - Not everyone is evil, but keep those who are in check by limiting which html tags are kosher on your weblog. The default html tags allowed by WordPress are a sane choice to let people use html in their comments and posts, without compromising the safety of your data or server.\n*   **Standards Complaint… and then some** - The WordPress team has gone to great lengths to ensure every bit of WordPress generated code is in full compliance with the standards of the [W3C][37]. This is important not only for interoperability with today's browser but also for forward compatibility with the tools of the next generation. Your web site is a beautiful thing, and you should demand nothing less.\n*   **More than a Blog… Much, Much More **- Anyone who says WordPress is a mere blogging platform is covering for the fact that they haven't been following the CMS's explosive growth over the past couple years. Saying WordPress is only a blogging platform is like saying BMW is [only a propeller manufacturer][38]. In fact, the majority of the time, [WordPress isn't even used as a blog][39]. With built in support for custom post types and custom taxonomies, if you can dream it, WordPress can make it a reality.\n\n [1]: http://wordpress.org/about/philosophy/\n [2]: http://techcrunch.com/2011/08/19/wordpress-now-powers-22-percent-of-new-active-websites-in-the-us/\n [3]: http://trends.builtwith.com/cms\n [4]: http://en.wordpress.com/stats/\n [5]: http://codex.wordpress.org/Administration_Screens\n [6]: http://codex.wordpress.org/Writing_Posts\n [7]: http://codex.wordpress.org/Search_Engine_Optimization_for_WordPress\n [8]: http://codex.wordpress.org/WordPress_Feeds\n [9]: http://codex.wordpress.org/Contributing_to_WordPress\n [10]: http://wordpress.org/download/counter/\n [11]: http://wordpress.org/extend/\n [12]: http://en.wikipedia.org/wiki/IBM_Selectric_typewriter\n [13]: http://codex.wordpress.org/Uploading_Files\n [14]: http://codex.wordpress.org/Media_Add_New_Screen\n [15]: http://codex.wordpress.org/Revision_Management#Autosaves\n [16]: http://codex.wordpress.org/Revision_Management\n [17]: http://wordpress.org/extend/mobile/\n [18]: http://codex.wordpress.org/Post_to_your_blog_using_email\n [19]: http://codex.wordpress.org/Using_Themes\n [20]: http://codex.wordpress.org/Using_Permalinks\n [21]: http://codex.wordpress.org/How_WordPress_Processes_Post_Content\n [22]: http://photomatt.net/tools/texturize\n [23]: http://codex.wordpress.org/WordPress_in_Your_Language\n [24]: http://codex.wordpress.org/Appearance_Menus_Screen\n [25]: http://codex.wordpress.org/Appearance_Widgets_Screen\n [26]: http://codex.wordpress.org/Roles_and_Capabilities\n [27]: http://wordpress.com/\n [28]: http://codex.wordpress.org/Hardening_WordPress\n [29]: http://codex.wordpress.org/Updating_WordPress#Automatic_Update\n [30]: http://codex.wordpress.org/Data_Validation\n [31]: http://codex.wordpress.org/Plugin_API\n [32]: http://en.wikipedia.org/wiki/Eating_your_own_dog_food\n [33]: http://codex.wordpress.org/Plugin_API/Action_Reference\n [34]: http://www.xmlrpc.com/\n [35]: http://codex.wordpress.org/Installing_WordPress#Famous_5-Minute_Install\n [36]: http://codex.wordpress.org/Dashboard_Updates_Screen\n [37]: http://w3.org/\n [38]: http://www.logoblog.org/bmw_logo.php\n [39]: http://max.limpag.com/article/wordpress-open-source-cms-2011/","previous":"<p><a href='http://wordpress.org/extend/plugins/wp-document-revisions/'>WP Document Revisions</a> is a <a href='http://en.wikipedia.org/wiki/Document_management_system'>document management</a> and <a href='http://en.wikipedia.org/wiki/Revision_control'>version control</a> plugin. Built for time-sensitive and mission-critical projects, teams can collaboratively edit files of any format — text documents, spreadsheets, images, sheet music… anything — all the while, seamlessly tracking the document&#8217;s progress as it moves through your organization&#8217;s existing workflow.</p>\n\n<p><a href='http://ben.balter.com/wp-content/uploads/2011/07/wp-document-revisions-screen-shot.png'><img alt='WP Document Revisions Screenshot' class='alignright' src='http://ben.balter.com/wp-content/uploads/2011/07/wp-document-revisions-screen-shot-300x226.png\n' /></a></p>\n\n<p><strong>WP Document Revisions is three things:</strong></p>\n\n<ol>\n<li>A <strong>document management system</strong> (DMS), to track, store, and organize files of any format</li>\n\n<li>A <strong>collaboration tool</strong> to empower teams to collaboratively draft, edit, and refine documents</li>\n\n<li>A <strong>file hosting solution</strong> to publish and securely deliver files to a team, to clients, or to the public</li>\n</ol>\n<iframe allowfullscreen='true' frameborder='0' height='315' src='http://www.youtube.com/embed/VpsTNSiJKis' width='560'>     </iframe>\n<p><strong>Powerful Collaboration Tools</strong> - <em>With great power does not have to come great complexity.</em> Based on a simple philosophy of putting powerful but intuitive tools in the hands of managers and content creators, WP Document Revisions leverages many of the essential WordPress features that, for more than eight years, have been tested and proven across countless industries — posts, attachments, revisions, taxonomies, authentication, and permalinks — to make collaborating on the creation and publication of documents a natural endeavor. Think of it as an <a href='http://ben.balter.com/2011/04/04/when-all-you-have-is-a-pair-of-bolt-cutters/'>open-source and more intuitive version</a> of the popular Microsoft collaboration suite, <a href='http://sharepoint.microsoft.com/en-us/Pages/default.aspx'>Sharepoint.</a></p>\n\n<p><strong>Document History</strong> - At each step of the authoring process, WP Document Revisions gives you an instant snapshot of your team&#8217;s progress and the document&#8217;s history. It even gives you the option to revert back to a previous revision — so don&#8217;t fret if you make a mistake — or receive updates on changes to the document right in your favorite feed reader.</p>\n\n<p><strong>Access Control</strong> - Each document is given a persistent URL (e.g., yourcompany.com/documents/2011/08/TPS-Report.doc) which can be private (securely delivered only to members of your organization), password protected (available only to those you select such as clients or contractors), or public (published and hosted for the world to see). If you catch a typo and upload a new version, that URL will continue to point to the latest version, regardless of how many changes you make.</p>\n\n<p><strong>Enterprise Security</strong> - Worried about storing propriety or sensitive information? WP Document Revisions was built from the first line of code with government- and enterprise-grade security in mind. Each file is masked behind an anonymous 128-bit <a href='http://en.wikipedia.org/wiki/MD5'>MD5 hash</a> as soon as it touches the server, and requests for files are transparently routed through WordPress&#8217;s time-tested URL rewriting, authentication, and permission systems (which can even <a href='http://wordpress.org/extend/plugins/active-directory-integration/'>integrate with existing enterprise active directory</a> or <a href='http://wordpress.org/extend/plugins/simple-ldap-login/'>LDAP servers</a>). Need more security? WP Document Revisions allows you to store documents in a folder above the <code>htdocs</code> or <code>public_html</code> <a href='http://httpd.apache.org/docs/2.0/mod/core.html#documentroot'>web root</a>, further ensuring that only those you authorize have access to your work.</p>\n\n<p><strong>Customization</strong> - WP Document Revisions recognizes that no two teams are identical, and as a result, molds to your firm&#8217;s needs, not the other way around. Need to track additional information associated with a document? Departments, editors, issues, sections, even arbitrary key-value pairs – whatever you can throw at it, it can handle. Development and customization costs are further minimized by its extensive plugin API, and the <a href='http://themergency.com/generators/wordpress-custom-taxonomy/'>WordPress Custom Taxonomy Generator</a> makes it easy for even the uninitiated to add custom taxonomies to documents. Need an audit trail to track check-ins and check-outs? User-level permissions based on the document&#8217;s state or another custom taxonomy? Support for third-party encryption? Check out the <a href='https://github.com/benbalter/WP-Document-Revisions-Code-Cookbook'>WP Document Revisions Code Cookbook</a> for sample code. Looking for even more advanced control of your workflow? WP Document Revisions will detect the popular workflow plugin <a href='http://editflow.org/'>Edit Flow</a>, if installed, and will automatically pull <a href='http://ben.balter.com/2011/10/24/advanced-workflow-management-tools-for-wp-document-revisions/'>Edit Flow&#8217;s advanced workflow management tools</a> into WP Document Revisions. Simply put, virtually every aspect of the plugin&#8217;s functionality from workflow states to user-level permissions can be fully customized to your team&#8217;s unique needs.</p>\n\n<p><strong>Future Proof</strong> - Switching costs a concern? WP Document Revisions is built with tomorrow&#8217;s uncertainty in mind. Equally at home in an in-house server room as it is in the cloud, moving individual files or entire document repositories in and out of WP Document Revisions is a breeze (history and all). And since the software is open-source, you can easily add tools to automate the process of moving to or integrating with future third-party systems.</p>\n\n<p><strong>The Vitals:</strong></p>\n\n<ul>\n<li>Support for any file type (docs, spreadsheets, images, PDFs — anything!)</li>\n\n<li>Securely stores unlimited revisions of your business&#8217;s essential files</li>\n\n<li>Provides a full file history in the form of a revision log, accessible via RSS</li>\n\n<li>Helps you track and organize documents as they move through your organization&#8217;s existing workflow</li>\n\n<li>Each file gets a permanent, authenticated URL that always points to the latest version</li>\n\n<li>Each revision gets its own unique url (e.g.,TPS-Report-revision-3.doc) accessible only to those you deem</li>\n\n<li>Files are intuitively checked out and locked to prevent revisions from colliding</li>\n\n<li>Toggle documents between public, private, and password protected with a single mouse click</li>\n\n<li>Runs in-house or in the cloud</li>\n\n<li>Secure: filenames are hashed on upload and files are only accessible through WordPress&#8217;s proven authentication system</li>\n\n<li>Can move document upload folder to location outside of web root to further ensure government- and enterprise-grade security</li>\n\n<li>Documents and Revisions shortcodes, Recently Revised Documents widget</li>\n\n<li>Multisite and Windows (XAMPP) support</li>\n\n<li>French and Spanish language support (easily translated to your language)</li>\n\n<li>Integration with <a href='http://editflow.org/'>Edit Flow</a></li>\n</ul>\n\n<p><strong>Features Available via the <a href='https://github.com/benbalter/WP-Document-Revisions-Code-Cookbook'>Code Cookbook</a>:</strong></p>\n\n<ul>\n<li><strong>Audit Trail</strong> - creates check in / check out audit trail for all documents</li>\n\n<li><strong>State Permissions</strong> - allows setting user-level permissions based on a custom taxonomy such as workflow state or other document status</li>\n\n<li><strong>Third Party Encryption</strong> - example of how to integrate at rest encryption using third-party tools</li>\n\n<li><strong>Rename Documents</strong> - changes all references to &#8220;Documents&#8221; in the interface to any label of your choosing</li>\n\n<li><strong>State Change Notification</strong> - how to use document api to allow users to receive notification whenever documents change workflow state</li>\n\n<li><strong>Bulk Import</strong> - how to batch import a directory (or other list) of files as documents</li>\n\n<li><strong>Filetype Taxonomy</strong> - Adds support to filter by filetype</li>\n\n<li><strong>Track Changes</strong> - Auto-generates and appends revision summaries for changes to taxonomies, title, and visibility</li>\n\n<li><strong>Remove Workflow States</strong> - Completely removes Workflow state taxonomy backend and UI</li>\n\n<li><strong>Change Tracker</strong> - Auto-generates and appends revision summaries for changes to taxonomies, title, and visibility</li>\n</ul>\n\n<p><strong>Translations:</strong></p>\n\n<ul>\n<li>French - <a href='http://omnimaki.com/'>Hubert CAMPAN</a></li>\n\n<li>Spanish - <a href='http://www.tradiart.com/'>TradiArt</a></li>\n</ul>\n\n<p><strong>Links</strong>:</p>\n\n<ul>\n<li><a href='https://github.com/benbalter/WP-Document-Revisions/'>Source Code</a> (GitHub)</li>\n\n<li><a href='https://github.com/benbalter/WP-Document-Revisions/tree/develop'>Development version</a> (<a href='http://travis-ci.org/#!/benbalter/WP-Document-Revisions'>Build Status</a>)</li>\n\n<li><a href='https://github.com/benbalter/WP-Document-Revisions-Code-Cookbook'>Code Cookbook</a></li>\n\n<li><a href='http://translations.benbalter.com/projects/wp-document-revisions/'>Translations</a> (GlotPres)</li>\n\n<li><a href='http://wordpress.org/tags/wp-document-revisions'>User support forums</a></li>\n\n<li><a href='https://github.com/benbalter/WP-Document-Revisions/issues'>Submit a bug/feature request</a><a href='http://ben.balter.com/wp-content/uploads/2011/08/wp-document-revisions.png'><br /></a></li>\n</ul>\n\n<p>Questions? Comments? Many may have already been addressed in <a href='http://wordpress.org/extend/plugins/wp-document-revisions/faq/'>the WP Document Revisions FAQ</a>, or feel free to simply leave a reply below.</p>\n\n<p><strong>Give it a try today.</strong><br /><a href='http://wordpress.org/extend/plugins/wp-document-revisions/'>Download WP Document Revisions</a> from the WordPress Plugin Repository</p>\n\n<p><em>WP Document Revisions was developed by a <a href='http://ben.balter.com'>law student and a business student</a> with a <a href='http://code.google.com/soc/'>grant from Google</a>, and in close coordination with and under the watchful eye of WordPress.org&#8217;s lead developers.</em> <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> <em>Special thanks to <a href='http://joncave.co.uk/'>Jon Cave</a>, <a href='http://aaron.jorb.in/'>Aaron Jorbin</a>, <a href='http://mitcho.com/'>Mitcho Erlewine</a>, and <a href='http://andrewnacin.com/'>Andrew Nacin</a> for their guidance.</em></p>\n\n<p><strong>Update (6/12): Comments have been closed in favor of <a href='https://github.com/benbalter/WP-Document-Revisions/wiki/Where-to-get-Support-or-Report-an-Issue'>expanded support and discussion options</a>. Additional documentation about the project can now be found in the <a href='https://github.com/benbalter/WP-Document-Revisions/wiki'>Project Wiki</a>. If you are interested in joining the project at any level of technical expertise, please see <a href='https://github.com/benbalter/WP-Document-Revisions/wiki/How-to-Contribute'>How to Contribute</a>.</strong></p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>Neither relationship should imply a formal endorsement.</p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li></ol></div>","content":"<blockquote>\n<p>&#8220;In 1876, the president of Western Union brushed off Alexander Graham Bell&#8217;s telephone as little more than an &#8221;<em>electric toy</em>,&#8221; and the company called Bell&#8217;s proposal to put one in every home &#8221;<em>utterly out of the question</em>.&#8221; Oxford University professor Erasmus Wilson predicted that when the 1878 Paris Exhibition closed, the electric light would &#8221;<em>close with it and no more will be heard of it</em>.&#8221; A Michigan banker advised his client not to invest in Henry Ford&#8217;s company in 1903 because &#8221;<em>the horse is here to stay, but the automobile is only a novelty</em>.&#8221; …If there is one constant through out time, it&#8217;s that conventional wisdom often misses the mark, especially in the early days of technological transformation.&#8221; <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup></p>\n</blockquote>\n\n<p>I&#8217;ve never heard any individual, upon being asked what they thought of a recent automobile purchase respond, &#8221;<em>well, it&#8217;s got this weird ‘new car&#8217; smell, so it&#8217;s going to take some getting used to</em>.&#8221; <sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> Yet for many, such is the typical reaction to experiencing a new technology. <sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup></p>\n\n<p>What is it about technological progress that sends many running for their digital security blankets? <sup id='fnref:4'><a href='#fn:4' rel='footnote'>4</a></sup> For some reason, much of the resistance appears to be <a href='http://opensource.sys-con.com/node/692407'>uniformed doubt</a> (<em>e.g.</em>, &#8220;It&#8217;s different&#8221;), rather than <a href='http://www.infoworld.com/d/security-central/gartner-seven-cloud-computing-security-risks-853'>calculated avoidance</a> (<em>e.g.</em>, &#8220;It&#8217;s less secure because you can&#8217;t prevent X&#8221;). To be fair, the business world, and even more so CIO&#8217;s, see avoiding uncertainty and minimizing risk as a core competency, but I don&#8217;t think that&#8217;s the whole story.</p>\n\n<p>The rapid pace of innovation has rendered many stakeholders and decision makers out of the loop when it comes to where a given technology stands in relation to their current practices, and for good reason: disruptive technology poses a risk not only on a organization level, but on a personal level as well.</p>\n\n<ul>\n<li><strong>From a practical standpoint</strong>, all other things remaining constant, a firm&#8217;s move to the cloud, for example, <a href='http://searchnetworking.techtarget.com/news/1381193/IT-job-security-fears-over-cloud-computing-Network-jobs-still-vital'>brings into question the security of the sysadmin</a> that has spent years building up a fiefdom of server farms.</li>\n\n<li><strong>From a skills standpoint</strong>, there&#8217;s a whole generation out there that grew up on the Internet, and many of those in a position to make purchasing decisions or recommendation are simply not part of it. A young upstart consultant coming in and showing up the veteran can potentially be a recurring (and realistic) <a href='http://www.lexjansen.com/pharmasug/2000/techtech/tt16.pdf'>nightmare for many baby boomers</a>.</li>\n\n<li><strong>From a professional standpoint</strong>, at its most basic level, risk is taken by individuals (who propose a new system, procedure, etc.), which in many organizations may have an incentive to adopt a &#8220;don&#8217;t rock the boat&#8221; mentality for their own career&#8217;s sake, rather than <a href='http://en.wikipedia.org/wiki/Betamax'>risk being wrong</a>.</li>\n</ul>\n\n<p>If technological innovation were simply a matter of calculated risk and switching costs, one would expect firms to be <em>equally</em> as unlikely to upgrade an existing technology as they would be to switch to a new one. Mathematically, upgrading in-house servers to the next version of Microsoft Exchange may<a href='http://www.google.com/apps/intl/en/business/messaging_value.html'>far outweigh</a> a move to the cloud. Yet, large firms have been <a href='http://googleenterprise.blogspot.com/2009/07/paving-road-to-apps-adoption-in-large.html'>slow to make the change</a>.</p>\n\n<p>There&#8217;s a whole world out there of distributed, open innovation that, with the exception of a few startups, <sup id='fnref:5'><a href='#fn:5' rel='footnote'>5</a></sup> has been widely ignored by IT departments, and as Yochai Benkler argues in <em><a href='http://www.amazon.com/Wealth-Networks-Production-Transforms-Markets/dp/0300110561'>The Wealth of Networks</a>,</em> if history suggests anything, it is that the proprietary model is on its way to the endangered species list.</p>\n\n<p>So what&#8217;s the answer? How can open source fanatics and other early adopters rescue the change averse from their self-perpetuated anachronisms?</p>\n\n<ul>\n<li><strong>Talk about <em>solutions</em> not technology</strong> – Geeks love shiny new things. It&#8217;s in our DNA. Yet rarely are geeks the one making the decisions. Decision makers could often care less which acronym powers something, but rather than dumb things down (&#8220;this thingy talks to that thingy&#8221;), translate the situation in terms of <a href='http://www.mindtools.com/pages/article/newPPM_82.htm'>organizational change</a> (&#8220;it will wholly eliminate the need for paper forms&#8221;). Rarely does technology change without the organization following suit. <a href='http://www.amazon.com/Solution-Selling-Creating-Difficult-Markets/dp/0786303158'>Approach the situation as a human problem</a>, not a technical one.</li>\n\n<li><strong>Move past &#8221;</strong><strong><em>If it ain&#8217;t broke, don&#8217;t fix it&#8221;** – &#8221;<em>It&#8217;s good enough&#8221; should never be a persuasive argument for stagnation. Just because something has been used in the past, does not mean that it should. <sup id='fnref:6'><a href='#fn:6' rel='footnote'>6</a></sup> &lt;/em&gt;In software development, changes fit into one of two categories: bugs and enhancements. Saying that something &#8220;works&#8221; ignores exactly half of the equation.</em></em></strong></li>\n\n<li><strong>Broadcast excellence</strong>- If you ask me why an organization should use SharePoint, I have at my fingertips <a href='http://sharepoint.microsoft.com/en-us/product/benefits/Pages/default.aspx'>focus-group tested ammunition</a>. Ask my why you should use WordPress, and I&#8217;m <a href='https://encrypted.google.com/webhp?oei=4HNeTqaVEsb50gGCldE7#sclient=psy&amp;hl=en&amp;newwindow=1&amp;site=webhp&amp;source=hp&amp;q=Why+Wordpress%3F+site%3Awordpress.org&amp;pbx=1&amp;oq=Why+Wordpress%3F+site:wordpress.org&amp;aq=f&amp;aqi=&amp;aql=&amp;gs_sm=e&amp;gs_upl=3748l3748l0l4002l1l1l0l0l0l0l128l128l0.1l1l0&amp;qscrl=1&amp;bav=on.2,or.r_gc.r_pw.&amp;fp=4bf87fb63526ad5b&amp;biw=1123&amp;bih=733'>left to pretty much fend for myself</a>. Curators of innovative technology need to make themselves known, and give those empowered to affect change, the tools to do so.</li>\n</ul>\n\n<p>The future&#8217;s coming. That&#8217;s for sure. Change is inevitable. Firms looking to seek a competitive advantage will begin to look past &#8221;<em>it has to be expensive and complicated</em>&#8221; and start looking toward open-source software, not as a misfit alternative, but as a viable player in the software space, but before that can happen the open-source community must step it up, and strive to be the serious competitor they wish to be treated as.</p>\n\n<p><strong>Update (9/1):</strong>Not quite &#8220;focus-group tested ammunition,&#8221; but in a sort of meta-dogfooding, I took a stab at articulating &#8221;<a href='http://ben.balter.com/2011/09/01/why-wordpress/'>Why WordPress</a>.&#8221; Edits welcome.</p>\n\n<p>Notes:</p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>Penenberg, Adam L. (2009-09-25). <a href='http://www.amazon.com/Viral-Loop-Facebook-Businesses-Themselves/dp/1401323499'>ViralLoop: From Facebook to Twitter</a>, How Today (p. 220). Hyperion. Kindle Edition. <span>21</span></p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p>This could arguably be, because the automobile industry has seen little innovation in the past 40 years. Beyond keyless entry and GPS, cars today are in many ways functionally equivalent to their 1970′s counterparts. <span>22</span></p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p><em>See e.g,</em><a href='http://www.petitiononline.com/ada4305/petition.html'>Facebook</a>, <a href='http://www.aolnews.com/2011/02/07/gawker-redesign-does-not-exactly-thrill-the-internet/'>Gawker</a>, <a href='http://www.businessweek.com/magazine/content/10_40/b4197036693152.htm'>Twitter</a>. <span>26</span></p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li><li id='fn:4'>\n<p>Full disclosure, some may argue that I myself risk falling off the bleeding edge of the technology adoption curve, after all, I text in <a href='http://developer.apple.com/'>beta</a>, browse in <a href='http://tools.google.com/dlpage/chromesxs'>canary</a>, and publish in <a href='http://wordpress.org/download/svn/'>trunk</a>. <span>30</span></p>\n<a href='#fnref:4' rev='footnote'>&#8617;</a></li><li id='fn:5'>\n<p><em>See, e.g.,</em> Facebook using PHP, Twitter using Hadoop, and Google supporting Android and Chrome. <span>31</span></p>\n<a href='#fnref:5' rev='footnote'>&#8617;</a></li><li id='fn:6'>\n<p><em>See, e.g., <a href='http://en.wikipedia.org/wiki/Bloodletting'>bloodletting</a>. <span>33</span>&lt;/li&gt;&lt;/ol&gt;&lt;/div&gt;</em></p>\n<a href='#fnref:6' rev='footnote'>&#8617;</a></li></ol></div>"}