{"author":"Benjamin J. Balter","title":"Fair Use, Excerpting, and Copying Content in the Internet Ecosystem\n","excerpt":null,"layout":"post","category":["Law","Technology"],"tags":["blogging","copywright","fair use","journalism","plagiarism"],"post_format":[],"url":"/2011/04/27/fair-use-excerpting-and-copying-content-in-the-internet-ecosystem/","date":"2011-04-27 00:00:00 -0400","id":"/2011/04/27/fair-use-excerpting-and-copying-content-in-the-internet-ecosystem","categories":["posts"],"next":"[![Subpoena](http://farm1.staticflickr.com/157/391427627_62f2a23df4_n.jpg){.alignright}][1]Bluehost, the [web hosting service][2] which powers more than [1.9 million][3] websites globally, making it one of the [top 20][3] largest hosting companies in the world and approximately [2% of the internet's traffic][4], recently came under fire for its decision to depart from well-established [internet standards][5] and reveal the identity of one of its subscribers, over what [later proved][6] to be an [unfounded suit][7].\n\nFrom a technical standpoint, Bluehost is one of the good guys. I've hosted sites with them since 2005 and looking back at the past six months, I've enjoyed a 99.79% uptime, with an average response time just under a second. But that's half the equation. Web hosting is not simply a cost-benefit analysis of price to uptime and responsiveness. There's a third factor there: trust.\n\nWhy does a hosting company require trust? In December, a [fake news release][8] was [published][9] on a Bluehost powered site by an anonymous satirical group, stating that after \"a recent internal and thorough company review,\" Koch Industries, an oil processing company, would be \"restructuring its support of climate change research and advocacy initiatives.\"\n\nThe problem occurred, however, when Bluehost was over eager to comply with Koch's subpoena demanding the identity of the anonymous poster, [arguing][4], \"[w]e are not in the business of harboring, you know, felons and crooks. We are not about that. This isn't WikiLeaks… [w]e comply with the law here.\"\n\nBluehost knew that the customer wanted to be anonymous (they had opted into Bluehost's domain protection program), however, the law here depends on Bluehost providing their client with knowledge of the subpoena, so that a timely objection can be heard by the issuing judge. In the [words of the site's own counsel][10]:\n\nThe judge ruled that [Bluehost's customer,] Youth for Climate Truth had a First Amendment right to issue a satirical press release and website – in which the group impersonated Koch and announced that the company had reversed its position on climate change – in an effort to call attention to Koch's [notorious bankrolling of efforts to deny climate change][11].\n\nThe U.S. District Court for the District of Utah rejected all of Koch's legal claims, which alleged trademark infringement, unfair competition, cybersquatting, computer hacking and breach of the company website's terms of use. The judge also issued an order barring Koch from using any identifying information it had already obtained about our clients via subpoena.\n\nThe problem here arises not from Koch trying to use its legal muscle to silence political satire, but from Bluehost's over willingness to comply with a request to identify the anonymous satirist.\n\nIn Bluehost's defense, the suit came at the height of the WIkileaks debacle, a time when the industry's top names were [identifying otherwise anonymous customers][12], but at the same time, as political interactions move increasingly online, our marketplace of ideas relies increasingly on hosting companies and internet services providers to remain good political citizens (not simply corporate ones).\n\nWhile technology may lend voice to otherwise marginalized political groups, it does not come without risk. In a shared hosting environment like Bluehost, \"your\" website, is not necessarily \"your\" website. Will we begin to see subpoena response times along the list of benchmarks and features when evaluating hosting companies? Probably not. But if you are planning on leveraging shared servers — be they Bluehost, Twitter, or YouTube — to blog about anything more than say, [DC Summer Interns][13], perhaps you should take a look at your hosting company's legal record before you click submit.\n\n [1]: http://www.flickr.com/photos/timsamoff/391427627/\n [2]: http://en.wikipedia.org/wiki/Web_hosting_service\n [3]: http://en.wikipedia.org/wiki/Bluehost\n [4]: http://www.necn.com/01/05/11/Koch-Industries-sues-over-bogus-website-/landing_scitech.html?&blockID=3&apID=b76a38541f994e489206850f0db50d02\n [5]: http://pubcit.typepad.com/clpblog/2010/07/two-new-cases-on-internet-anonymity.html\n [6]: http://www.sltrib.com/sltrib/money/51780456-79/koch-company-judge-federal.html.csp\n [7]: http://pubcit.typepad.com/files/kochindustries.pdf\n [8]: http://www.scribd.com/doc/45044630/Koch-Industries-on-Climate-Science\n [9]: http://www.nytimes.com/2011/02/14/business/media/14link.html?_r=1\n [10]: http://pubcit.typepad.com/clpblog/2011/05/federal-court-dismisses-koch-brothers-trademark-suit-over-climate-change-prank.html\n [11]: http://www.greenpeace.org/usa/en/campaigns/global-warming-and-energy/polluterwatch/koch-industries/\n [12]: http://ben.balter.com/2011/01/11/twitter-goes-to-bat-for-wikileaks/\n [13]: http://dcinterns.blogspot.com/","previous":"<p>I am gave a brief <a href='http://www.meetup.com/wordpressdc/events/16887732/'>lightning talk at April&#8217;s WordPress DC Meetup</a> on the basics of HTML and PHP (&#8220;coding for dummies&#8221;). The goal: learn how to avoid breaking your website if you edit it. Below are the <a href='#deck'>slides</a> and <a href='#recording'>recording</a>.</p>\n\n<p><strong>In invite you to <a href='#deck'>watch</a>, but in short, the Cliff&#8217;s Notes are:</strong></p>\n\n<ul>\n<li>\n<p>The process</p>\n\n<ul>\n<li>The server executes PHP and outputs HTML, CSS, JavaScript, etc.<img alt='' src='http://ben.balter.com/wp-content/uploads/2011/04/infographic-300x138.png' /></li>\n\n<li>The user&#8217;s browser takes that output and renders a visual representation of the page</li>\n</ul>\n</li>\n\n<li>\n<p>Client-side Languages</p>\n\n<ul>\n<li>HTML – Static (unchanging) content; provides structure</li>\n\n<li>CSS – Provides style and form</li>\n\n<li>JavaScript – Provides interactivity</li>\n</ul>\n</li>\n\n<li>\n<p>PHP – Wrapped with &#8221;<code>php</code>&#8221; and &#8221;<code>?&gt;</code>&#8221;</p>\n\n<ul>\n<li>Variable - Text, a number, true/false, or a group of variable; identified by &#8221;<code>$</code>&#8221;</li>\n\n<li><code>If</code> Statement – performs an action <em>if</em> a statement is true</li>\n\n<li><code>While</code> Loop – performs an action <em>while</em> a statement is true</li>\n\n<li><code>For</code> / <code>Foreach</code> – combines elements of <code>while</code> and <code>if</code></li>\n\n<li>Functions – predefined set of actions; always followed by &#8221;<code>( )</code>&#8221;</li>\n\n<li>Don&#8217;t forget semicolons</li>\n</ul>\n</li>\n</ul>\n<hr />\n<p><strong>Deck</strong></p>\n\n<p><strong>Recording</strong>(I&#8217;m first up)</p>\n\n<p><strong>Links to Resources Mentioned</strong></p>\n\n<ul>\n<li>\n<p>HTML</p>\n\n<ul>\n<li><a href='http://code.google.com/edu/submissions/html-css-javascript/'>Google: HTML, CSS, &amp; js from the Ground Up</a></li>\n\n<li><a href='http://htmldog.com'>HTML Dog</a></li>\n\n<li><a href='http://www.w3.org/wiki/HTML/Training'>W3 Learning Wiki</a></li>\n\n<li><a href='http://www.w3.org/wiki/HTML/Elements'>W3 Element Wiki</a></li>\n</ul>\n</li>\n\n<li>\n<p>Text Editor</p>\n\n<ul>\n<li><a href='http://notepad-plus-plus.org/'>Notepad++</a> (Windows)</li>\n\n<li><a href='http://www.barebones.com/products/textwrangler/'>TextWrangler</a>, <a href='http://www.panic.com/coda/'>Coda</a> (Mac)</li>\n</ul>\n</li>\n\n<li>\n<p>FTP Client (to connect to server)</p>\n\n<ul>\n<li><a href='http://winscp.net/eng/index.php'>WinSCP</a>, <a href='http://notepad-plus-plus.org/'>Notepad++</a> (Windows)</li>\n\n<li><a href='http://cyberduck.ch/'>CyberDuck</a>, <a href='http://www.panic.com/coda/'>Coda</a> (Mac)</li>\n</ul>\n</li>\n\n<li>\n<p>WordPress</p>\n\n<ul>\n<li><a href='http://codex.wordpress.org/Editing_wp-config.php#Debug'>Define( WP_DEBUG, true);</a> in wp-config.php</li>\n\n<li><a href='http://wordpress.org/extend/plugins/debug-bar/'>Debug bar</a> plugin</li>\n\n<li><a href='http://codex.wordpress.org/'>WordPress Codex</a></li>\n</ul>\n</li>\n</ul>\n\n<p><em>Thanks to all who came out or tuned into the live stream. Comments? Questions? I&#8217;d love to hear your thoughts <a href='#comments'>below</a> or feel free to <a href='http://ben.balter.com/contact/'>contact me</a>.</em></p>","content":"<p><img alt='' src='http://ben.balter.com/wp-content/uploads/2011/04/2146845610_ebd95e5f4e_b-300x200.jpg' />The Internet&#8217;s <em>laissez-faire</em> Internet ecosystem of liberal excerpting is often at odds with both <a href='http://www.washingtonpost.com/wp-dyn/content/article/2009/07/31/AR2009073102476.html'>traditional</a> <a href='http://www.niemanlab.org/2009/08/gawker-and-the-washington-post-a-case-study-in-fair-use/'>media</a> and <a href='http://ilt.eff.org/index.php/Copyright:_Fair_Use'>the law</a>, but the bigger concerns for aspiring bloggers should be contributing to an ongoing dialog, rather than muddling it.</p>\n\n<p>I was recently asked by an aspiring &#8220;content producer,&#8221; what the &#8220;rules&#8221; were for copying or excerpting content from other sites. From their questions, it quickly became clear to me, that they were missing the point of having a website altogether. <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup></p>\n\n<p>Not getting in hot water with <a href='http://www.hulu.com/watch/13576/hot-fuzz-chase'>the fuzz</a> is important, but it is simply one checkbox among many, relegated to the same category of subdued importance as spelling or grammar. The predominant rule in online publishing should not be fair use or copyright, but rather whether the author is adding value to the blogosphere. True, space on the Internet may be relatively cheap, but your reader&#8217;s time is not.</p>\n\n<p>It seems Internet copyright law has become somewhat of a digital <a href='http://redvsblue.com/archive/episode.php?id=89'>Chupacabra</a> — the subject of endless urban legend and fact-less speculation. Despite <a href='http://www.llrx.com/features/bloggersbeware.htm'>widespread misunderstanding</a>, in practice, both the contours of fair use law and the cultural norms of the net lay clear guidelines for bloggers and content producers. Put another way, <em>the law&#8217;s the easy part</em>. Worry about the content and the law will take care of itself.</p>\n\n<h3 id='the_culture'>The Culture</h3>\n\n<p>Much like its roots in academia, the cornerstone of the Internet is the ability to contribute to an ongoing dialog by building on the ideas of others. With few exceptions, if your use of another&#8217;s work does not <em>add value</em>to the discussion, you may be fine legally, but practically, you&#8217;re just wasting space on the Internet. Criticism, commentary, and the synthesis of ideas not only enjoy fair use protections, but more importantly, give visitors a reason to read your content, drives traffic to your site, and justifies its existence. Likewise, facts and ideas are usually fair game, as are promotional materials and logos if you are discussing a specific company or product, but the reason for such an exception is not to give bloggers fodder for an easy blog post, but rather the exception is designed as a stimulus package for the marketplace of ideas.</p>\n\n<p>The culture of the internet is not that it&#8217;s okay to <em>copy</em> others, but that it&#8217;s okay to <em>criticize</em> others, and if in doing so you quote or reference their work, that&#8217;s considered okay. So if you have something to say, where exactly does the law draw the line? <sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup></p>\n\n<h3 id='is_it_copyrighted'>Is it copyrighted?</h3>\n\n<p>If a work is no longer subject to copyright claims (and thus falls in the <a href='http://www.law.duke.edu/cspd/comics/zoomcomic.html'>public domain</a>), the discussion of fair use becomes a moot point. Such a determination does not, strictly speaking turn on the inclusion of the copyright symbol. <sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup> Instead, a work is <a href='http://www.unc.edu/~unclng/public-d.htm'>in the public domain</a> if it was created:</p>\n\n<ul>\n<li>by the federal government, at any time,</li>\n\n<li>between 1964-1977 without a copyright notice.</li>\n\n<li>between 1923-1963 with a copyright notice, if the copyright was not renewed,</li>\n\n<li>between 1923-1963 without a copyright notice, or</li>\n\n<li>before 1923.</li>\n</ul>\n\n<h3 id='is_it_fair_use'>Is it fair use?</h3>\n\n<p>Even if a work merits copyright protection, it can still be used in many cases. The concept of <em>fair use</em> came about in late 1970′s following the Copyright Act of 1976. <sup id='fnref:4'><a href='#fn:4' rel='footnote'>4</a></sup> Simply put, the Copyright act states, &#8221;<em>purposes such as criticism, comment, news reporting, teaching (including multiple copies for classroom use), scholarship, or research, is not an infringement of copyright.</em>&#8221; While there is no cut-and-dry rule as to when use infringes on the author&#8217;s copyright, the determination as to whether a given excerpt constitute fair uses is governed by four-factor <a href='http://en.wikipedia.org/wiki/Balancing_test'>balancing test</a>: <sup id='fnref:5'><a href='#fn:5' rel='footnote'>5</a></sup></p>\n\n<ol>\n<li>the purpose and character of the use, including whether such use is of a commercial nature or is for nonprofit educational purposes;</li>\n\n<li>the nature of the copyrighted work;</li>\n\n<li>the amount and substantiality of the portion used in relation to the copyrighted work as a whole; and</li>\n\n<li>the effect of the use upon the potential market for or value of the copyrighted work.</li>\n</ol>\n\n<p>Some factors that may tip the fair-use scale in an excerpter&#8217;s favor are whether its use was commercial, <sup id='fnref:6'><a href='#fn:6' rel='footnote'>6</a></sup> transformative, <sup id='fnref:7'><a href='#fn:7' rel='footnote'>7</a></sup> or parody, <sup id='fnref:8'><a href='#fn:8' rel='footnote'>8</a></sup> the amount copied, <sup id='fnref:9'><a href='#fn:9' rel='footnote'>9</a></sup> and the effect on the market for the original <sup id='fnref:10'><a href='#fn:10' rel='footnote'>10</a></sup>.</p>\n\n<p>In short, so long as you link back to the original source, and contribute something to the idea, you&#8217;re probably fine legally, but that misses the point. Don&#8217;t copy and paste an entire post from someplace else, but a few sentences to a few paragraphs are cool <em>if it&#8217;s in the context of you making a point</em>. Just like writing a paper for college, be sure to block quote for paragraphs and use quotation marks for sentences, and cite even if you paraphrase, but it still needs to be about your ideas. The Internet may provide users with free e-mail or free information, but it does not provide bloggers with free copy, nor should it.</p>\n\n<p>The law aside, readers want you to digest and put ideas in your own voice. Take a paragraph from one post, a paragraph from another, and build a common thread between them – that&#8217;s the bigger hurdle. Give readers a reason to come to your site. Give your site a reason to exist, and nine times out of ten, the law will be on your side.</p>\n\n<p>[Photo courtesy <a href='http://www.flickr.com/photos/talllguy/2146845610/'>tallguy</a>]</p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>Questions asked included: If there&#8217;s no copyright symbol, is it still copyrighted?; If it&#8217;s posted online, can I just copy it because its it&#8217;s in the public domain?; Can I use it if I&#8217;m not selling it?; and It&#8217;s okay to use if I credit the original author, right?.</p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p>It should be noted that <a href='http://ben.balter.com/fine-print/'>I&#8217;m not an attorney</a> and my writing should not be substituted for qualified legal advice.</p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p>This is a common misconception. While once true, under the <a href='http://en.wikipedia.org/wiki/Berne_Convention_for_the_Protection_of_Literary_and_Artistic_Works'>Berne Convention</a> the author of any content published today is assumed to retain copyright claims.</p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li><li id='fn:4'>\n<p>Codified into law as <a href='http://www.law.cornell.edu/uscode/17/107.html'>17 U.S.C. § 107</a>.</p>\n<a href='#fnref:4' rev='footnote'>&#8617;</a></li><li id='fn:5'>\n<p><a href='http://caselaw.lp.findlaw.com/scripts/getcase.pl?court=usvol=510`invol=569'>Campbell v. Acuff-Rose Music, Inc.</a>, 510 U.S. 569, 577-78 (1994).</p>\n<a href='#fnref:5' rev='footnote'>&#8617;</a></li><li id='fn:6'>\n<p>Harper Row v. Nation Enters., 471 U.S. 539, 562 (1985)</p>\n<a href='#fnref:6' rev='footnote'>&#8617;</a></li><li id='fn:7'>\n<p><em>Campbell</em>, 510 U.S. at 578-79.</p>\n<a href='#fnref:7' rev='footnote'>&#8617;</a></li><li id='fn:8'>\n<p><em>Id.</em> at 580-81</p>\n<a href='#fnref:8' rev='footnote'>&#8617;</a></li><li id='fn:9'>\n<p>Harper Row, Publishers, Inc. v. Nation Enters., 471 U.S. 539, 565 (1985)</p>\n<a href='#fnref:9' rev='footnote'>&#8617;</a></li><li id='fn:10'>\n<p>Sony Corporation of America v. Universal City Studios, Inc., 464 U.S. 417, 433 (1984).</p>\n<a href='#fnref:10' rev='footnote'>&#8617;</a></li></ol></div>"}