{"author":"Benjamin J. Balter","title":"Advanced Workflow Management Tools for WP Document Revisions\n","excerpt":null,"layout":"post","category":["Business","Technology"],"tags":["collaboration","community","document management","enterprise","journalism","metadata","notifications","open source","plugin","wordpress","workflow"],"post_format":[],"url":"/2011/10/24/advanced-workflow-management-tools-for-wp-document-revisions/","date":"2011-10-24 00:00:00 -0400","id":"/2011/10/24/advanced-workflow-management-tools-for-wp-document-revisions","categories":["posts"],"next":"As Aaron Shapiro over at Fast Company [cogently argues][1], \"*it's because you're not providing them the right opportunity. The talent you want would be happy to work in an un-air-conditioned garage in New Mexico if it meant the chance to change the world*.\"\n\nSpecifically he points out:\n\n*   **Every element of their work will be pored over by multiple layers of bureaucracy.** Even if that's how the rest of the company operates, it can't spill into the digital department. In a technology environment, new products and businesses spring up daily and a new endeavor can go from conception to launch in a matter of months. Reining in the momentum will be read as inaction and a clear signal the company isn't willing to grasp the new way of the world.\n*   **Mediocre is good enough.** While clocking out at 5 p.m. is attractive to some, it will discourage digital talent. They want to be expected to do something great. They want to be pushed. They care about their work. Their leadership, and those they rely on to get things done, must match their appetite for success.\n*   **Trial and error is condemned.** The freedom to try out new ideas allows employees to take initiative, make decisions, and learn from their mistakes. It also demonstrates an attractive and inspiring entrepreneurial spirit.\n*   **Your company is structured so it takes a lifetime to get to the top, and as such there are no digital experts in company-wide leadership positions. **Digital talent–often in their 20s and 30s–need to see a clear path for uninhibited career development that's based on merit, not years spent, and that's beyond the confines of the digital department. If they don't, they won't see a reason to stay with the company in the long term.\n*   **Your offices are cold, impersonal and downright stodgy.** It may sound like it conflicts with the \"you don't need to be in Silicon Valley point,\" but appreciate the nuance. A traditional office layout is designed to communicate power among certain individuals and barriers between departments. This does not support the collaborative ethos which is intrinsic to the web. Companies should do everything possible to provide the digital team friendlier, open office space. A location in a hip, young neighborhood (which surely exists in every mid- to large-sized city) is also a big plus.\n\nI think the argument could be extended to hiring 20-somethings more broadly ([I'm looking at your Federal Government][2]), but a great read, nonetheless.\n\n[via [Fast Company][1]]\n\n [1]: http://www.fastcompany.com/1779120/embargo-1027-why-digital-talent-doesn-t-want-to-work-at-your-company\n [2]: http://www.nextgov.com/nextgov/ng_20100423_7313.php","previous":"<p>The White House&#8217;s Office of Management and Budget recently released a<a href='http://explore.data.gov/Federal-Government-Finances-and-Employment/Federal-Executive-Branch-Internet-Domains/k9h8-e98h'>list of all domains</a> owned and operated by federal executive agencies. Leveraging a previous tool I had built called <a href='https://github.com/benbalter/Site-Inspector'>Site Inspector</a> which provides information about a domain and its technical capabilities, I imported the list into the content management system WordPress, and created a plugin called <a href='https://github.com/benbalter/Domain-Inventory'>Domain Inventory</a>to scan each domain and curate the results. A summary of my preliminary results appears below, as well as a link to the browsable dataset.</p>\n\n<p><strong>The project tracks each Federal Executive .Gov by:</strong></p>\n\n<ul>\n<li><strong>Agency</strong>(as provided in the data.gov list)</li>\n\n<li><strong>Server status</strong> (response code, if it is reachable, etc.)</li>\n\n<li><strong>Non-WWW support</strong> (is www. required to access the site)</li>\n\n<li><strong>IPv6 Support</strong> (is it reachable via next generation technology)</li>\n\n<li><strong>CDN Provider</strong> (do they use a content distribution network, if so what)</li>\n\n<li><strong>CMS</strong> (do they use a content management system, if so what)</li>\n\n<li><strong>Cloud Provider</strong> (are they hosted in the cloud, if so by whom)</li>\n\n<li><strong>Analytics Source</strong> (do they track visitors, if so how)</li>\n\n<li><strong>Script Library</strong> (do they use common javascript libraries)</li>\n\n<li><strong>HTTPs Support</strong> (is the site browsable via the secure HTTPS protocol)</li>\n</ul>\n\n<p><strong>Key Highlights of the Preliminary Results:</strong></p>\n\n<ul>\n<li>Only 73% of domains are <a href='http://dotgov.benbalter.com/status/live/'>live and in use</a></li>\n\n<li><em>Of live domains</em> 80% are accessible <a href='http://dotgov.benbalter.com/nonwww/yes/'>without typing the www. prefix</a>.</li>\n\n<li>Only 10 sites fully support the federally mandated <a href='http://dotgov.benbalter.com/ipv6/yes/'>IPv6 standard</a>.</li>\n\n<li>87 domains use the <a href='http://dotgov.benbalter.com/cdn/akamai/'>Akamai</a> content distribution network.</li>\n\n<li>12 are believed to be in the cloud, including 10 in <a href='http://dotgov.benbalter.com/cloud/amazon/'>Amazon</a>, and 2 in <a href='http://dotgov.benbalter.com/cloud/rackspace/'>Rackspace</a>.</li>\n\n<li>103 use some form of analytics, with <a href='http://dotgov.benbalter.com/analytics/google-analytics/'>Google Analytics</a> being the most popular, found on 86 domains.</li>\n\n<li>Drupal is<a href='http://dotgov.benbalter.com/cms/drupal/'>by far the most popular CMS</a>, powering nearly twice as many domains as all other CMSs combined.</li>\n\n<li><a href='http://dotgov.benbalter.com/cms/wordpress/'>WordPress</a> is the second most popular primary CMS (17), followed by Microsoft <a href='http://dotgov.benbalter.com/cms/sharepoint/'>SharePoint</a> (13).</li>\n\n<li>93% of <em>live</em> domains use <a href='http://dotgov.benbalter.com/cms/none/'>no detectable CMS</a>, or use a custom-built solution.</li>\n</ul>\n\n<p>Slightly more than half of live servers are powered by</p>\n\n<p><a href='http://dotgov.benbalter.com/server_software/commercial/'>commercial software.</a></p>\n\n<p><strong>The full, browsable dataset:<a href='http://dotgov.benbalter.com'>http://dotgov.benbalter.com</a></strong></p>\n\n<p><em>Please note: This data is to be treated as preliminary and is provided &#8220;as is&#8221; with no guarantee as to its validity. The source code for all tools used, including the resulting data, is available in <a href='https://github.com/benbalter/Domain-Inventory'>GitHub</a>. If you find a systemic error, I encourage you to fork the code and I will try my best to recrawl the list to improve the data&#8217;s accuracy.</em></p>\n\n<p><strong>Update (10/4)</strong>: Updated the above statistics (and underlying data) based on an updated domain list published on data.gov and recrawled using the same tools. The above numbers now use the number of <em>live</em> sites (rather than total number of domains) as the denominator for percentages, and excludes approximately 300 domains which simply redirects to other .govs.</p>","content":"<p>Looking for even more advanced control of your workflow? <a href='http://ben.balter.com/2011/08/29/wp-document-revisions-document-management-version-control-wordpress/' title='WP Document Revisions — Document Management &amp; Version Control for WordPress'>WP Document Revisions</a>gained a huge feature today with the addition of integrated support for the popular workflow plugin <a href='http://editflow.org'>Edit Flow</a>. Beginning with <a href='http://wordpress.org/extend/plugins/wp-document-revisions/'>version 1.1</a>, WP Document Revisions will detect Edit Flow, if installed, and will automatically pull <a href='http://wordpress.org/extend/plugins/edit-flow/screenshots/'>Edit Flow&#8217;s advanced workflow management tools</a> into the proven WP Document Revisions experience you already know and use. Specifically:</p>\n\n<ul>\n<li><strong>E-Mail Notifications and User Groups</strong> allow you to keep track of activity via e-mail and manage alerts based on existing teams. Subscribe individual users or entire groups to receive a document&#8217;s updates.</li>\n\n<li><strong>Custom Document Metadata</strong> allows organizations to store additional information alongside your documents in a sleek, intuitive manner. Supports a virtually unlimited number of checkboxes, dates, locations, text, users, and numeric fields.</li>\n\n<li><strong>Collaborative Team Chat</strong>allows users to comment on and discuss individual documents, pulling the conversation out of your inbox and back into your workflow.</li>\n\n<li><strong>Evolved Workflow State Integration</strong> allows for more granular control of Workflow states (&#8220;Document Status&#8221; in EditFlow parlance), including setting a document&#8217;s initial status and better integration with the native WordPress experience.</li>\n\n<li><strong>Advanced Snapshots</strong> of your team&#8217;s progress via filterable calendar and budget views. See all documents in a particular step in your workflow, in a particular category, in a particular week, or by a particular user.</li>\n</ul>\n\n<p>Ideal for teams of any size looking to fine tune their WP Document Revisions experience without the hassle of <a href='https://github.com/benbalter/WP-Document-Revisions-Code-Cookbook'>coding a custom implementation</a>, the addition of Edit Flow support offers a unique suite of powerful and intuitive workflow management tools right out of the box.</p>\n\n<p>Want one feature but not another? Each can be individually enabled or disabled via Edit Flow&#8217;s settings panel. For more information, see the <a href='http://editflow.org/'>Edit Flow homepage</a> or simply <a href='http://wordpress.org/extend/plugins/edit-flow/'>download and install the plugin</a> to begin — no additional setup necessary.</p>"}