{"author":"Benjamin J. Balter","title":"Late-Night Infomercials: Guaranteed to Extend the 4th Amendment or Your Money Back","excerpt":"Online accounts may now be afforded greater protection following the Sixth Circuit's ruling in United States v. Warshak. The court, upholding a temporary injunction on e-mail searches extended the fourth amendment's warrant requirements to messages stored on third-party servers.","layout":"post","category":["Law","Technology"],"tags":["cloud computing","digital due process","privacy"],"post_format":[],"url":"/2010/12/20/late-night-infomercials/","date":"2010-12-20 00:00:00 -0500","id":"/2010/12/20/late-night-infomercials","categories":["posts"],"next":"![Policeman Checks Cellphone][1]\n\nWhen drafting and interpreting the fourth amendment, neither the founding fathers, nor the countless legal scholars that followed them could have ever imagined that one day technology would allow us to walk down the street with our entire life chronicled in our pocket. The growing popularity of the cloud coupled with increasing power of smart phones has resulted in what not too long ago was tool for placing and receiving calls, today, in actuality, is a portal to one's entire digital life. Imagine if a routine traffic stop, say, for failing to signal properly, would place in the state's hands every e-mail you have ever sent, contact you have ever met, or financial transaction you have ever completed (not to mention your current [Angry Birds][2] score!). Regardless of how Orwellian it may sound, the California Supreme Court [ruled in favor of just such an outcome][3].\n\nIn *[People v. Diaz][4]*, the court ruled that a warrentless search of text messages on a cell phone confiscated subsequent to a lawful arrest did infact, constitute a valid search. While the dissent realized that mobile phones were increasingly becoming the hubs of our digital world, noting that the decision gave \"*carte blanche, with no showing of exigency, to rummage at leisure through the wealth of personal and business information that can be carried on a mobile phone or handheld computer merely because the device was taken from an arrestee's person,*\" I do not believe they fully grasped the gravity of the ruling. [^1]\n\n![][6][Much like Ben Stiller and Owen Wilson's characters in the movie Zoolander][7], the dissent's analysis is based on the assumption that information  \"can be carried on\" or \"in\" one's mobile phone, a reality which simply is not the case in today's increasingly cloud-centric world.\n\nToday, and even more so tomorrow, information will not be \"carried on\" a phone, but rather, that phone will merely be the vehicle used to access information stored elsewhere, information that would otherwise carry the highest expectation of privacy. Put another way, the device holds, both literally and metaphorically, the address, keys, and means to access one's digital home, a breach of privacy that would not be tolerated if it occurred in a more tangible sense.\n\nIn a world where in reality, nearly every e-mail I have ever sent or received can be accessed by opening a folder on my phone virtually indistinguishable [^2] from any neighboring folder that contains locally stored information, the majority's interpretation grants the state access to nearly everything  one says or does on a daily basis. Put another way, how much information do you think *won't* be accessible from your mobile phone in 5 years? 10 years? 20? Just scroll through your home screen. [^3]\n\nThe majority's decision was well argued by legal minds much wiser than my own, but even reading through the verbiage of the opinion, discussing the nature of containers and cavities as they relate to what is \"in\" the phone, it leads one to believe that their analysis is handicapped by [outdated concepts of storage and space][10]. [^4]\n\nWhile it may not be practical to install [Faraday cages][12] in every police station to ferret out what information can be gleamed from a mobile device without it querying a remote server (if there is any information at all), the majority's opinion fails to take into account the reality of how mobile phones are used today, let alone, how they will be most likely be used in the not-to-distant future. While the courts sort out [what fourth amendment protections are extended into the digital world][13], I for one, will be sure to put a password on my phone next time I cross the California state line. [^5]\n\n[photo: [Thomas Hawk][15]]\n\nNotes:\n\n[^1]: While the question has been pondered to some extent, for example, in Professor Kerr's 2006 paper [Searches and Seizures in a Digital World][16], or Professor Gershowitz's 2008 paper, [the iPhone Meets the Fourth Amendment][17], technology has come a long way, even in the past two years, and will continue to evolve in the years to come. [18]\n[^2]: Even for the technologically adept, today, it is hard to tell exactly what information exists \"on\" my phone, and what information exists \"in\" the cloud. The subject and sender of an incoming e-mail may be pushed to my iPhone automatically, for example, but the body or attachments may not download until I access the message itself. Today's calendar entries may be cached on the device (I wouldn't consider my calendar \"stored\" on my device — it's not the master copy), but yesterday's and tomorrow's agendas are both retrieved on demand from a distant server unrelated to any hypothetical search to which I may me subject. [19]\n[^3]: Beyond the obvious (e-mail, phone, contact, calendars), there's [dinner reservations][20], [car rentals][21], [TV viewing habits][22], [financial data][23], [recent purchases][24], even [desktop browsing history][25] — it's like winning the lottery of personal information. [26]\n[^4]: It's worth noting that the word \"server\" is not mentioned once in the opinion, yet the phrase \"storage capacity\" is used no less than five times — a concept that [even as early as 2007 was considered a thing of the past][27]. [28]\n[^5]: A password may only delay the inevitable. *See *Gershowitz, Adam M.,* [Password Protected? Can a Password Save Your Cell Phone from the Search Incident to Arrest Doctrine?][29] *(August 31, 2010). [30]\n\n [1]: http://cdn.benbalter.com/wp-content/uploads/2011/01/policeman.jpg \"Policeman Checks Cellphone\"\n [2]: http://en.wikipedia.org/wiki/Angry_Birds\n [3]: http://arstechnica.com/tech-policy/news/2011/01/warrantless-cell-phone-search-gets-a-green-light-in-california.ars?comments=1#comments-bar\n [4]: http://www.courtinfo.ca.gov/opinions/documents/S166600.PDF\n [5]: #note-2020-1 \"While the question has been pondered to some extent, for example, in Professor Kerr's 2006 paper Searches and Seizures in a Digital World, or Professor Gershowitz's 2008 paper, the iPhone Meets the Fourth Amendment, technology has come a long way, even in the past two years, and will continue to evolve in the years to come.\"\n [6]: http://cdn.benbalter.com/wp-content/uploads/2011/01/zoolander-300x188.jpg \"Zoolander\"\n [7]: http://www.youtube.com/watch?v=_m_PncKuDao&feature=related#t=1m16s\n [8]: #note-2020-2 \"Even for the technologically adept, today, it is hard to tell exactly  what information exists \"on\" my phone, and what information exists \"in\"  the cloud. The subject and sender of an incoming e-mail may be pushed to  my iPhone automatically, for example, but the body or attachments may  not download until I access the message itself. Today's calendar entries  may be cached on the device (I wouldn't consider my calendar \"stored\"  on my device — it's not the master copy), but yesterday's and  tomorrow's agendas are both retrieved on demand from a distant server  unrelated to any hypothetical search to which I may me subject.\"\n [9]: #note-2020-3 \"Beyond the obvious (e-mail, phone, contact, calendars), there's dinner reservations, car rentals, TV viewing habits, financial data, recent purchases, even desktop browsing history — it's like winning the lottery of personal information.\"\n [10]: http://movieclips.com/sgNVB-zoolander-movie-computer-experts/\n [11]: #note-2020-4 \"It's worth noting that the word \"server\" is not mentioned once in the  opinion, yet the phrase \"storage capacity\" is used no less than five  times — a concept that even as early as 2007 was considered a thing of the past.\"\n [12]: http://en.wikipedia.org/wiki/Faraday_cage\n [13]: http://ben.balter.com/2010/12/20/late-night-infomercials/\n [14]: #note-2020-5 \"A password may only delay the inevitable. See Gershowitz, Adam M., Password Protected? Can a Password Save Your Cell Phone from the Search Incident to Arrest Doctrine? (August 31, 2010).\"\n [15]: http://www.flickr.com/photos/thomashawk/61076493/\n [16]: http://papers.ssrn.com/sol3/papers.cfm?abstract_id=697541\n [17]: http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1084503\n \n \n [20]: http://itunes.apple.com/us/app/opentable/id296581815?mt=8\n [21]: http://www.zipcar.com/iphone/\n [22]: http://www.engadget.com/2010/11/15/comcast-xfinity-remote-app-for-iphone-ipad-launches-video-stre/\n [23]: http://www.mint.com/features/iphone/\n [24]: http://www.amazon.com/gp/feature.html?ie=UTF8&docId=1000291661\n [25]: http://www.mozilla.com/en-US/mobile/home/\n \n [27]: http://mashable.com/2007/05/14/yahoo-mail-unlimited/\n \n [29]: http://ssrn.com/abstract=1669403","previous":"<p><a href='http://www.thedailyshow.com/watch/wed-july-12-2006/headlines---internet'><img alt='' src='http://www.thedailyshow.com/watch/wed-july-12-2006/headlines---internet' /></a>The Internet backbone (big <a href='http://www.thedailyshow.com/watch/wed-july-12-2006/headlines---internet'>tube</a>) provider, Level 3, which makes up much of the behind-the-scenes magic that delivers Netflix streaming movies, revealed that in recent negotiations, internet service (smaller tube) provider Comcast <a href='http://voices.washingtonpost.com/posttech/2010/11/comcast_hit_with_two_net_neutr.html'>demanded Level 3 pay an additional fee</a> in exchange for Comcast <em>continuing</em> to allow its customers access to Netflix videos, effectively erecting a series of tollgates on the information superhighway.</p>\n\n<p>It&#8217;s likely no coincidence that Comcast&#8217;s decision comes just a week after Netflix began offering <a href='http://blog.netflix.com/2010/11/new-plan-for-watching-instantly-plus.html'>streaming-only plans</a> (hinting at the firm&#8217;s broader push toward streaming video in the near future) and Level 3′s subsequent announcement of a partnership with Netflix to be its <a href='http://www.wired.com/epicenter/2010/11/comcast-tollbooth/'>primary carrier of streaming video</a>.</p>\n\n<p>In Comcast&#8217;s defense, their move makes <em>some</em> sense from a business standpoint. After all, during peak hours, just 2% of Netflix users (via Level 3) account for <a href='http://www.slate.com/id/2273314/'>20% of all bandwidth used</a> in North America. In Comcast&#8217;s own words:</p>\n\n<blockquote>\n<p><span>W</span>hen one provider… push<span>es</span> the burden of massive traffic growth onto the other provider and its customers, we believe this is not fair.</p>\n</blockquote>\n\n<p>The problem with the &#8220;it&#8217;s the customer&#8217;s fault for using our service&#8221; argument, the <a href='http://www.nytimes.com/2009/09/03/technology/companies/03att.html?_r=1'>same argument used by AT&amp;T</a> not too long ago, is that, if they haven&#8217;t already, service providers need to realize the Internet is here to stay. We as consumers like browsing the net. We like images. We like YouTube videos. We like interactive content. We like streaming stuff, and tomorrow we may like holograms or virtual reality or whatever the next cool, shiny thing is. Consumers simply can&#8217;t get enough rich, bandwidth-intensive content, and if you&#8217;re an internet service provider, you can&#8217;t complain when your customers use your service to do just that.</p>\n\n<p>True, this may simply be <a href='http://www.wired.com/threatlevel/2008/03/isp-quarrel-par/'>another petty dispute</a> between service providers as <a href='http://twitter.com/#!/ceciliakang/statuses/9730130310078464'>Comcast claims</a>, but the bigger problem with Comcast&#8217;s decision, however, is that Comcast is not simply a <em>service</em> provider (tubes), but with the <a href='http://mediadecoder.blogs.nytimes.com/2010/11/29/netflix-partner-says-comcast-toll-threatens-online-video-delivery/'>impending NBC merger</a>, also a <em>content</em> provider (the stuff in those tubes). This decision marks this first practical case where a service provider is actually taking steps to single out and discriminate against their competitor&#8217;s content. As Level 3′s Chief Legal Officer <a href='http://www.marketwatch.com/story/level-3-communications-issues-statement-concerning-comcasts-actions-2010-11-29?reflink=MW_news_stmp'>put it</a>:</p>\n\n<blockquote>\n<p>Comcast is putting up a tollbooth at the borders of its broadband internet-access network, enabling it to unilaterally decide how much to charge for content which competes with its own cable TV and Xfinity-delivered content.</p>\n</blockquote>\n\n<p>The Level-3/Comcast arrangement spells bleak hope for any future in which the Internet&#8217;s information democratization ethos continues – perhaps a commercialized future <a href='http://io9.com/5610328/how-the-googleverizon-proposal-could-kill-the-internet-in-5-years'>not too dissimilar from today&#8217;s tiered broadcast/cable TV system</a> — and a future unequivocally bad for consumers, regardless of what the FCC may or may not decide <a href='http://voices.washingtonpost.com/posttech/2010/11/lawmakers_push_fcc_to_vote_on.html'>later this month</a>.</p>\n\n<p>Consider this: as Comcast&#8217;s customers increasingly <a href='http://lifehacker.com/5667680/ditching-cable-for-the-web-how-much-can-you-save-buying-renting-or-streaming-tv'>look to their computers for video content</a> rather than their cable box, Comcast can either squeeze that lost revenue out of its customers by bringing an <a href='http://www.businessinsider.com/comcast-internet-access-2010-11'>end to all-you-can-eat Internet</a>, in which case we&#8217;ll see an increase in our cable bill, or they can make up that lost revenue on the other end, by charging contest providers (like Level 3) a surcharge, forcing those services to offset their increased overhead by passing along the cost in the form of monthly fees, in which case we&#8217;ll see it on our Netflix/iTunes/Facebook bill instead. Either way, the decision forecasts an inevitable flow of money from our pockets to Comcast&#8217;s.</p>\n\n<p>Any time the nation&#8217;s <a href='http://www.comcast.com/About/PressRelease/PressReleaseDetail.ashx?PRID=887'>largest</a> anything makes a &#8221;<a href='http://www.comcast.net/articles/finance/20101130/US.Level.3.Comcast/'>take it or leave it</a>&#8221; offer demanding a fee for an otherwise mutually beneficial relationship like <a href='http://en.wikipedia.org/wiki/Peering'>peering</a>, the transaction deserves a certain degree of scrutiny, especially when it creates a catch-22 in that company&#8217;s favor. Is Comcast <em>trying</em> to kill the Internet? Probably not. <em>Will</em> they? I guess we&#8217;re going to have to wait and see.</p>\n\n<p><em>Views represent <a href='http://ben.balter.com/fine-print/'>my own</a>.</em></p>\n\n<p><span>photo: <a href='http://www.flickr.com/photos/gnackgnackgnack/3592493739/'>gnackgnackgnack</a></span></p>\n\n<p><span />: http://ben.balter.com/wp-content/uploads/2010/11/3592493739_6b0b0d3f45_b.jpg</p>","content":"<p>Despite some users&#8217; <a href='http://blogs.wsj.com/digits/2010/12/13/the-top-50-gawker-media-passwords/'>lax approach to safeguarding their identities</a>, online accounts may now be afforded greater protection following the Sixth Circuit&#8217;s ruling in <em><a href='http://www.ca6.uscourts.gov/opinions.pdf/10a0377p-06.pdf'>United States v. Warshak</a>.</em> The court, which upheld a temporary injunction on a fraud investigation involving the all-too-familiar <a href='http://blogs.forbes.com/kashmirhill/2010/12/15/your-email-now-warrants-greater-privacy-thanks-to-sex-pill-peddling-dude/'>late-night &#8220;Smilin&#8217; Bob&#8221; informercials</a>, extended the fourth amendment&#8217;s warrant requirements to messages stored on third-party servers. The Sixth Circuit wrote:</p>\n\n<blockquote>\n<p>&#8221;<span>T</span>he ISP is the functional equivalent of a post office or a telephone company… <span>T</span>he police may not storm the post office and intercept a letter, and they are likewise forbidden from using the phone system to make a clandestine recording of a telephone call—unless they get a warrant, that is.&#8221; <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup></p>\n</blockquote>\n\n<p>Prior to the ruling, the government could (<a href='http://www.google.com/transparencyreport/governmentrequests/'>and regularly did</a>) obtain e-mails stored on third-party hosts like Gmail, without first needing to obtain a search warrant. In its decision, the district court declared the 1986 Stored Communications Act (SCA) <a href='http://www.ca6.uscourts.gov/opinions.pdf/10a0377p-06.pdf'>2</a> unconstitutional on the grounds that it allowed what was tantamount to a traditional search, but without the required showing of probable cause. The court noted, &#8221;<em><span>g</span>iven the fundamental similarities between e-mail and traditional forms of communication, it would defy common sense to afford e-mails lesser Fourth Amendment protection.</em>&#8221; <a href='http://blogs.forbes.com/kashmirhill/2010/12/15/your-email-now-warrants-greater-privacy-thanks-to-sex-pill-peddling-dude/'>3</a></p>\n\n<p>The SCA, written long before GMail&#8217;s all-you-can-eat storage was ever dreamed, required a warrant for any message stored on a third-party server for fewer than 180 days, but simply required a subpoena or court order for older messages or messages that had been previously downloaded by the user, thus denying the subject of the investigation both notice and the subsequent opportunity to contest the search itself. <sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup></p>\n\n<p>For the most part, <a href='http://ben.balter.com/2010/10/10/does-every-cloud-have-a-silver-lining/' title='Does Every Cloud Have a Silver Lining?'>the decision makes sense</a>. As e-mail moves from download-and-delete <a href='http://en.wikipedia.org/wiki/Post_Office_Protocol'>POP-based</a> messages stored solely on a user&#8217;s computer to the nearly limitless <a href='http://en.wikipedia.org/wiki/Internet_Message_Access_Protocol'>IMAP</a>, <a href='http://en.wikipedia.org/wiki/Microsoft_Exchange_Server'>Exchange</a>, or <a href='http://en.wikipedia.org/wiki/Webmail'>Web-based</a> messaging that increasingly lives in the unseen cloud, neither opportunity to download nor time spent on server are very compelling standards to determine the level of privacy that should be afforded to a message or the showing of cause that should be required to compel a host to disclose its contents.</p>\n\n<p>The decision, which <a href='http://volokh.com/2010/12/14/sixth-circuit-rules-that-e-mail-protected-by-the-fourth-amendment-warrant-requirement/'>tips a circuit split</a> further in favor of extending the fourth amendment, should, at least in theory, lay the groundwork to grant such protections to other forms of information stored in the cloud. Such information may include calendars or contacts on the more obvious end of the spectrum, but may arguable be construed to cover wholesale cloud services like AWS, Salesforce, Rackspace, and Azure, a possibility not to be taken lightly following the <a href='http://www.huffingtonpost.com/2010/12/01/wikileaks-website-loses-h_n_790526.html'>WikiLeaks hosting scramble</a>.</p>\n\n<p>Surely the decision does not settle the issue outright, but it is the latest in a long march of much-needed rulings further blurring the legal distinctions between the world online and the world off, and as persuasively written as it is, is likely to prove influential as both law and technology continue to evolve side by side.</p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p><em>United States v. Warshak</em>, 08-3997, 2010 WL 5071766 (6th Cir. Dec. 14, 2010). <span>16</span></p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p><em>See generall</em>y <a href='http://docs.google.com/viewer?a=v&amp;q=cache:IYzfdrim0owJ:www.fletc.gov/training/programs/legal-division/downloads-articles-and-faqs/downloads/other/obtaining_electronic.pdf/download+&amp;hl=en&amp;gl=us&amp;pid=bl&amp;srcid=ADGEESgpYeTPUFAijEyb4BnY4_wzFLwSJmRNv8yL2ZD8EkhQTjt7oXv9kELuYHG7A202xJ9_MGwvgVDwjviAEh0zW76gZQAbieBYwR6cnNUyD83txcScrGTU0qDUME590QPAMej6hmSy&amp;sig=AHIEtbTf4jZconLMbkMO_hVK8xQ92bqZNQ'>Obtaining Electronic Evidence</a>, Federal Law Enforcement Training Center (July 2003)</p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li></ol></div>"}