{"title":"SoftWare Automation &#038; Technology (SWAT) Team, Office of Administration","organization":"Executive Office of the President","section":"Experience","from":"September 2011","to":"January 2012","location":"Washington, D.C.","category":"resume","robots":"noindex, nofollow","layout":"default","url":"/0001/10/01/software-automation-technology-swat-team/","date":"0001-10-01 00:00:00 -0500","id":"/0001/10/01/software-automation-technology-swat-team","categories":["resume"],"next":"*   Assisted with drafting, stakeholder outreach, and coordination of the release of [the President’s Digital Government Strategy][1], a fundamental reimagination of the role of technology in the public sector\n*   In response to presidential mandate requiring the release of open source software, coordinated and led negotiation of contract for code-sharing services including creation of records management plans under both the Federal Records and Presidential Records Acts\n*   Briefed senior White House officials on legal implications and licensing consideration surrounding the creation of government-funded open-source software collaborations\n*   Prepared US Chief Information Officer for public appearances including speech writing, messaging, and creation of multiple HTML5-based presentations\n*   Developed technical roadmap, prototyped, and implemented [first-of-its-kind mechanism][2] for agencies to report progress on the Digital Government Strategy\n\n [1]: http://www.whitehouse.gov/sites/default/files/omb/egov/digital-government/digital-government.html\n [2]: https://github.com/GSA/digital-strategy","previous":"<ul>\n<li>Negotiated agency-wide, federal service agreements with the web’s top service providers including FISMA-compliant cloud hosting, social media, data manipulation, source code collaboration, and geospacial firms.</li>\n\n<li>Drafted website privacy policy, comment moderation policy, third-party privacy notices, and API terms of service for agency’s reimagined web presence.</li>\n\n<li>Created legal and technical roadmaps to ensure compliance of new media platforms with White House Office of Management and Budget memorandums M-10-22 and M-10-23 governing federal agencies’ use of website tracking technologies and third-party services.</li>\n\n<li>Supported New Media Team’s procurement efforts, including scope of work, impact statement, and limited source justification drafting.</li>\n\n<li>Received Superior Achievement Award for customer service, quality performance, and overall contribution to the agency mission.</li>\n\n<li>Led adoption, implementation, and analysis of Google Analytics website visitor tracking statistics.</li>\n\n<li>Developed more than 30 in-house software tools including <a href='http://github.com/fcc'>open-source website auditing and site-mapping software</a> instrumental to evaluation of online presence spanning more than 1.2 million pages.</li>\n</ul>","tags":[],"content":"<ul>\n<li>Created enterprise business solutions to automate and streamline business processes in support of the President of the United States as part of the White House’s first-ever agile software development team.</li>\n\n<li>In close coordination with the Office of Federal Financial Management, lead development of <a href='https://max.gov/unclesamslist/'>prototypical government-wide, open-source classifieds system</a> for sharing of federal real and other properties among executive agencies.</li>\n\n<li>Regularly met with and presented to C-level executives and key stakeholders to develop and support mission-critical applications including public data collection, White House comment line, goods and services tracking, and employee on-boarding and off-boarding.</li>\n\n<li>Developed application to catalog blackberry SMS and PIN messages to aid E-Discovery team and assure compliance with Federal Records Act, Presidential Records Act, and Freedom of Information Act.</li>\n\n<li>Assisted information assurance teams with application certification and accreditation.</li>\n</ul>"}