{"title":"We've been trained to make paper","excerpt":"If the internet is the primary medium by which content is consumed, shouldn't that be the primary medium for which content is prepared?","author":"Benjamin J. Balter","layout":"post","comments":true,"category":"Technology","tags":["collaboration","Word","workflow","git","GitHub","markdown"],"published":true,"related_posts":[{"url":"/2010/09/12/wordpress-resume-plugin/","id":"/2010/09/12/wordpress-resume-plugin","title":"WordPress Resume Plugin"},{"url":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party/","id":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party","title":"New Media Flak: Megaphone vs. Cocktail Party"},{"url":"/2010/10/10/does-every-cloud-have-a-silver-lining/","id":"/2010/10/10/does-every-cloud-have-a-silver-lining","title":"Does Every Cloud Have a Silver Lining?"},{"url":"/2010/11/06/removing-the-barriers-to-organizational-agility/","id":"/2010/11/06/removing-the-barriers-to-organizational-agility","title":"Removing the Barriers to Organizational Agility\n"},{"url":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing/","id":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing","title":"What Fourteen-Century Apple Pie Teaches Us About Sharing\n"},{"url":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds/","id":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds","title":"Will Federal Contracting Officers Soon Have Their Heads in the Clouds?\n"},{"url":"/2010/11/29/free-trade-in-china-just-google-it/","id":"/2010/11/29/free-trade-in-china-just-google-it","title":"Free Trade in China? Just Google it."},{"url":"/2010/11/29/twitter-mentions-as-comments/","id":"/2010/11/29/twitter-mentions-as-comments","title":"Twitter Mentions as Comments WordPress Plugin\n"},{"url":"/2010/12/01/the-internet-is-series-of-tubes/","id":"/2010/12/01/the-internet-is-series-of-tubes","title":"The Internet is Series of Tubes (oh, and Tollgates too)\n"},{"url":"/2010/12/20/late-night-infomercials/","id":"/2010/12/20/late-night-infomercials","title":"Late-Night Infomercials: Guaranteed to Extend the 4th Amendment or Your Money Back"}],"url":"/2012/10/19/we-ve-been-trained-to-make-paper/","date":"2012-10-19 00:00:00 +0000","id":"/2012/10/19/we-ve-been-trained-to-make-paper","categories":["Technology"],"next":"/2012/12/15/why-wordpress-next-version-should-just-give-it-a-rest-already","previous":"/2012/10/15/open-source-is-not-a-verb","content":"<p>We&#8217;ve been trained wrong. We&#8217;ve been trained that content creation starts by firing up a desktop word processor — a piece of software, mind you, that still does its best to generate a digital representation of a physical piece of paper — margins, page breaks, and all. Yet this quintessential workplace-place training simply fails to remain relevant in a world where we carry a computer in our pockets at all times. Our training now tells us to create content for the least-likely way it&#8217;s consumed: on paper. We&#8217;re stuck in an anachronistic workflow.</p>\n\n<p>It&#8217;s not uncommon for example, for a team to need to write or edit a document together. Take the typical collaborative publishing process, which generally goes something like this:</p>\n\n<ol>\n<li>Draft content in Microsoft Word</li>\n\n<li>Save to shared folder or e-mail around for comments and changes</li>\n\n<li>Manually (and opaquely) reconsile changes one-by-one</li>\n\n<li>Repeat steps 2-3 until satisfied with the document</li>\n\n<li><strong>Convert to web-friendly format</strong></li>\n\n<li>Publish</li>\n</ol>\n\n<p>See what we did there? We&#8217;re still writing content for print, and then only once we&#8217;re completely done, begin to prepare it for web. That&#8217;s broken. That&#8217;s like building an entire car, and then at the last minute, deciding it should actually, in fact, be a plane. If the internet is the primary medium by which content is consumed, shouldn&#8217;t that be the primary medium for which content is written?</p>\n\n<h3 id='using_the_wrong_tools'>Using the wrong tools</h3>\n\n<p>Microsoft Word was designed with one purpose in mind: to make paper. Think about it. It&#8217;s essential elements arose in the early 80&#8217;s. There&#8217;s print-centric buttons like left and right align front and center, but new-fangled internety things like hyperlinks or rich media are buried deep inside these labyrinthian sub-menus. Sure, it&#8217;s industry standard, but it&#8217;s an industry-standard workflow that arose before the age of the web (and hasn&#8217;t really changed since).</p>\n\n<p>Yet the majority of the documents we create today rarely, if ever embody physical space. They don&#8217;t care about the things Microsoft Word cares about — margin width, page breaks, or other properties that assume four sharp corners — and more importantly, they don&#8217;t handle mobile responsiveness, machine-readability, or other web-specific features.</p>\n\n<h3 id='merely_a_snapshot'>Merely a snapshot</h3>\n\n<p>And then there&#8217;s the problem of collaborating. I can&#8217;t count the number of times I&#8217;ve been e-mailed a document entitled <code>foo-document_2012_10_15_clean_fixed_revised_final2</code> or told that it&#8217;s &#8220;on the share drive&#8221; or asked &#8220;are you out yet?&#8221;. Without expensive software, that document&#8217;s just a snapshot in time. There&#8217;s no context. <em>What updates does this version have that weren&#8217;t in the last? Wait is this even the most recent version? Who made the last three revisions? What happened with that change I submitted - did you accept it? Why not? Can we discuss? Can two people edit it at the same time? Not to mention — I have a crazy idea — can I go off and experiment in a parallel version?</em></p>\n\n<p>Geeks solved this problem a long time ago. It&#8217;s called version control. We built it in the 70&#8217;s. We start with content, you edit it, I edit it, and we get better content. It&#8217;s really that simple, and better yet, it&#8217;s free. It handles curating the master copy, keeps track of each and every change (down to the character mind you), and even provides a transparent forum to discuss those changes in the context in which they occur. <a href='https://github.com/benbalter/benbalter.github.com/commits/master/posts/_posts/2012-10-19-we-ve-been-trained-to-make-paper.md'>Take a look for yourself</a>.</p>\n\n<h3 id='jailbreaking_content'>Jailbreaking content</h3>\n\n<p>So why doesn&#8217;t everyone use this &#8220;version control&#8221;? Because we&#8217;re trained wrong. We&#8217;ve got to break free of these proprietary, print-only formats. We&#8217;ve got to stop shuttling changes back-and-forth via e-mail or with obscure file names. We&#8217;ve got to unprogram ourselves for an age of print.</p>\n\n<p>And here&#8217;s why: <em>.doc files are like tiny micro-jails for our content.</em> Proprietary document formats tend to commingle the text we provide with the commands the software needs to recreate it, and it stores all this in a complicated and inaccessible binary format. That&#8217;s what makes it proprietary. We put text in — one of the most basic things computers understand — and we get this big mess back that can only be opened by that software. Imagine if the most common way to get water was to buy a can of Coke and run in through a Brita filter. It doesn&#8217;t need to be so complicated.</p>\n\n<h3 id='break_the_habit'>Break the habit</h3>\n\n<p>Let&#8217;s just concentrate on what matters: the content. When you separate design from content, things get a lot cleaner and a lot easier to work with. From now on, instead of clicking the little blue &#8220;W&#8221; out of habit, ask &#8220;does this really need to be a piece of paper?&#8221; If not, all of a sudden you can now use the best collaboration tools that mankind has made to date, rather than publishing tools that were made for a bygone generation.</p>\n\n<p>And it&#8217;s not that hard. You can just click &#8220;edit&#8221; below (as an example), or the next project that comes across your plate, give git a try:</p>\n\n<ol>\n<li><a href='https://gist.github.com/3914310'>Learn</a> Markdown - it takes 30 seconds. Honestly.</li>\n\n<li><a href='https://github.com/signup/free'>Signup</a> for a GitHub account - it&#8217;s free!</li>\n\n<li>Install <a href='http://mac.github.com/'>GitHub for Mac</a> (or <a href='http://windows.github.com/'>GitHub for Windows</a>) and <a href='http://mouapp.com/'>Mou</a></li>\n\n<li>Create a repository and go to work</li>\n</ol>\n\n<p>Granted some of the tools can be a bit rough around the edges at times, they are getting better, and like lots of other open-source technologies before it, as we move from paper-first to a web-only distribution, the time is ripe for a more evolved, text-centric, distributed workflow to become mainstream. <em>Stop making paper, start collaborating.</em></p>"}