{"author":"Benjamin J. Balter","title":"New Media Flak: Megaphone vs. Cocktail Party","excerpt":"A recent back and forth in the opinion pages of GW's paper of note brought to light an emerging divide in publicists' approaches to social media.","layout":"post","category":["Business","Technology"],"tags":["generation gap","gw","pr","social media","twitter"],"post_format":[],"url":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party/","date":"2010-09-13 00:00:00 -0400","id":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party","categories":["posts"],"next":"[][1]Today's New York Times article [outlining law enforcement officials' attempts to expand their digital wiretapping authority][2], offers interesting insight into the law enforcement world of tomorrow.  In the not too distant future, TV's crime-process dramas may take on a very different feel.  Gone will be the days of [gun-toting detectives busting down doors, search warrant in hand][3]. Instead, as our lives become increasingly digital, investigations will be conducted by [keyboard-wielding lab techs submitting automated requests to service providers][4].  Don't be surprised if the next CSI spinoff is CSI: Inbox Inspectors Division.\n\nBut why does this shift matter?  Simply put, in [the cloud][5], there is no door for the police to kick in.  While the law is clear in that your physical files and those computer files stored on your computer itself enjoy the protections of the fourth amendment, those stored in the cloud do not, and the standards of proof required differ dramatically.[^6]\n\n![][7]\n\nConsider this: you are the target of a criminal investigation and the police believe that six months ago you e-mailed an accomplice to discuss the crime. Depending on your e-mail settings and which service you use (e.g., if the \"[leave downloaded messages on server][8]\" option is checked), the police may need only offer \"specific and articulable facts\" that they suspect the e-mail is related to the crime.[^9] That same e-mail stored on your computer (e.g., if the setting is not checked), would require a search warrant and showing of probable cause, and thus would be afforded significantly greater protections under the law.[^10]\n\nHowever, the typical \"*if you don't want it public, don't put it on the internet*\" argument doesn't apply here.  While that may be true for [photos and updates posted to social networking sites][11], as more and more of our lives (and [commercial dealings][12]) are pushed to the cloud, we're loosing our abilities to have a digital private sphere.[^13]\n\nThe good news is that it's in service providers' interest to instill confidence in the integrity of your data by [disclosing when information is shared with authorities][14] and by [pushing for legal reform ][15]to better safeguard personal data stored in the cloud. The bad news, beyond more [painfully tacky computer search scenes][16], is that before we know it, our perception of privacy may be forced to evolve.\n\nThunderstorms occur when divergent forces collide in clouds. It is becoming increasingly clear that cloud computing is in our extended forecast, but whether the imminent [digital due process][17] storm the cloud foreshadows will contain a silver privacy lining remains to be seen.\n\nPhoto credit: [garyhayes][18]\n\n [1]: http://ben.balter.com/wp-content/uploads/2010/09/4502026170_4bf31f04e6.jpg\n [2]: http://www.nytimes.com/2010/09/27/us/27wiretap.html?_r=1&ref=technology \"NYT: U.S. Tries to Make It Easier to Wiretap the Internet\"\n [3]: http://www.hulu.com/watch/53368/swat-best-of-breaches \"Hulu: Best of Swatch Breaches\"\n [4]: http://www.youtube.com/watch?v=6Z70BmmSkMY&feature=related \"CSI Miami IP Address Lookup\"\n [5]: http://en.wikipedia.org/wiki/Cloud_computing \"Wikipedia: Cloud Computing\"\n [^6]: *Compare* Fed. R. Crim. P. 41(e)(2)(B) *with* 18 U.S.C.A. § 2703(d) (West).\n [7]: http://ben.balter.com/wp-content/uploads/2010/09/4502026170_4bf31f04e6.jpg \"Cloud Computing - 500px\"\n [8]: http://office.microsoft.com/en-us/outlook-help/leave-e-mail-messages-on-your-e-mail-server-HA001150793.aspx\n [^9]: 18 U.S.C.A. § 2703(d) (West).\n [^10]: *See generall*y [Obtaining Electronic Evidence][21], Federal Law Enforcement Training Center (July 2003).\n [11]: http://youropenbook.org/ \"Your Open Book\"\n [12]: http://www.google.com/apps/intl/en/business/customers.html \"Google Business Customers\"\n [^13]: Take Google, as an example, who, to their credit, is a [front-runner in the push toward digital due process][23], testifying on the Hill just last week. Without signing up for a Google account, through the use of cookies, Google can compile a relatively accurate profile of [what Web sites you visit][24] and [how often you visit them][25], what [products you purchase][26], and [where you go][27]. And if you sign-up for a near-ubiquitous Google account, you introduce the cloud to [what others are saying about you][28], [what you read][29], [files stored on your computer][30], and even [your medical history][31], not to mention with [whom][32] [you][33] [communicate][34], what [you're doing][35], and [where you are right now][36]. \n [14]: http://www.google.com/transparencyreport/governmentrequests/ \"Google Government Inqueries\"\n [15]: http://digitaldueprocess.org/index.cfm?objectid=37940370-2551-11DF-8E02000C296BA163 \"Digital Due Process\"\n [16]: http://www.youtube.com/watch?v=hkDD03yeLnU \"YouTube: CSI Blog Search\"\n [17]: http://digitaldueprocess.org/\n [18]: http://www.flickr.com/photos/garyhayes/4502026170/\n [21]: http://docs.google.com/viewer?a=v&q=cache:IYzfdrim0owJ:www.fletc.gov/training/programs/legal-division/downloads-articles-and-faqs/downloads/other/obtaining_electronic.pdf/download+&hl=en&gl=us&pid=bl&srcid=ADGEESgpYeTPUFAijEyb4BnY4_wzFLwSJmRNv8yL2ZD8EkhQTjt7oXv9kELuYHG7A202xJ9_MGwvgVDwjviAEh0zW76gZQAbieBYwR6cnNUyD83txcScrGTU0qDUME590QPAMej6hmSy&sig=AHIEtbTf4jZconLMbkMO_hVK8xQ92bqZNQ\n [23]: http://googlepublicpolicy.blogspot.com/2010/09/digital-due-process-time-is-now.html \"Google Policy Blog: Digital Due Process the Time is Now\"\n [24]: http://google.com \"Google.com\"\n [25]: http://google.com/analytics \"Google Analytics\"\n [26]: http://checkout.google.com \"Google Checkout\"\n [27]: http://maps.google.com \"Google Maps\"\n [28]: http://alerts.google.com \"Google Alerts\"\n [29]: http://books.google.com \"Google Books\"\n [30]: http://desktop.google.com \"Google Desktop\"\n [31]: http://google.com/health/ \"Google Health\"\n [32]: http://google.com/talk \"Google Talk\"\n [33]: http://gmail.com \"Gmail\"\n [34]: http://google.com/voice/ \"Google Voice\"\n [35]: http://google.com/calendar/ \"Google Calendar\"\n [36]: http://mobile.google.com \"Google Mobile\"","previous":"<p>As I began to set up my own site, I was not a huge fan of the options out there for adding a resume or CV to a WordPress blog. Many personal Web sites used lackluster TinyMCE formatting (bold, italic, bullets, nothing else) or simply stuffed pre-styled HTML into an existing page. I can&#8217;t even begin to fathom the workflows some people must go through every time they want to update their resume.<sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> A few purpose-built plugins offered a slightly more streamlined approach, but cluttered the backend with unnecessary and unfamiliar menus, and spawned legions of database tables to store the data.</p>\n\n<p><em>Enter WP Resume…</em></p>\n\n<p>WP Resume is an out-of-the-box solution to get your resume online and keep it updated. Built on WordPress 3.0&#8217;s custom post type functionality, it offers a uniquely familiar approach to publishing. If you&#8217;ve got a WordPress site, you already know how to use WP Resume.</p>\n\n<p><strong>Features include:</strong></p>\n\n<ul>\n<li>Support for sections (e.g., education, experience), organizations (e.g., somewhere state university, Cogs, Inc.), positions (e.g., bachelor of arts, chief widget specialist), and details (e.g., grew bottom line by 15%, president of the sustainability club)</li>\n\n<li>Follows best practices in resume layout and design</li>\n\n<li>One click install, just start adding content</li>\n\n<li>Drag and drop ordering of resume elements</li>\n\n<li>Built on existing WordPress code, utilizing a single custom post type and two custom taxonomies</li>\n\n<li>The WYSIWYG editing experience you know and love</li>\n\n<li>Revisioning</li>\n\n<li>Integrates with your theme like they were made for each other</li>\n\n<li>Custom URL</li>\n\n<li>Does not use pretentious accents on the word &#8220;resume&#8221;</li>\n\n<li>Extremely original title</li>\n</ul>\n\n<p><img alt='' src='http://cdn.benbalter.com/wp-content/uploads/2010/09/wp_resume-300x223.png' />The hardest part of getting your resume online should be doing the work listed on it, not wrestling the publishing platform. Simply put, WP Resume steps aside and lets your experience shine.</p>\n\n<p>Interested? You can <a href='http://ben.balter.com/resume/'>see it in action</a>, or if you&#8217;re ready to take the plunge, <a href='http://wordpress.org/extend/plugins/wp-resume/'>download it from the WordPress plugin repository</a>, and <a href='http://wordpress.org/extend/plugins/wp-resume/installation/'>try it today</a>. There&#8217;s even a <a href='http://tech.journalism.cuny.edu/documentation/wp-resume/'>great walkthrough put together by the good folks at CUNY Graduate School of Journalism.</a> Bugs, questions, comments, feedback? I&#8217;d love to hear about your experience with WP Resume in the comments below.</p>\n\n<p><em>Enjoy using WP Resume? Feel free to <a href='http://ben.balter.com/donate/' title='Donate'>make a small donation</a> to support the software&#8217;s continued development.</em></p>\n\n<p><em>[Photo: <a href='http://www.flickr.com/photos/shawnmichael/4246330043/'>shawnmichael</a>]</em></p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>I imagine it would resemble a highly digitized <a href='http://www.youtube.com/watch?v=qybUFnY7Y8w'>Rube Goldberg Machine</a></p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li></ol></div>","content":"<p>A recent <a href='http://media.www.gwhatchet.com/media/storage/paper332/news/2010/09/07/Opinions/gwtoday.Stop.Damaging.Gws.Reputation-3928003.shtml'>back</a> and <a href='http://media.www.gwhatchet.com/media/storage/paper332/news/2010/09/13/Opinions/Conor.Rogers.jguiffre.Pls.Refudiate-3930388.shtml'>forth</a> in the opinion pages of GW&#8217;s paper of note brought to light an emerging divide in publicists&#8217; approaches to social media. One the one hand, GW&#8217;s primary Twitter account, @GWTweets, casts the University in a stoic, buttoned-up light, with little, if any interactions with members of the rather active online community (<em>e.g.</em>, mentions, @replies, or ReTweets). @GWToday on the other hand, the <em>de facto</em>hub of the campus&#8217;s Twitter scene, and arguably a <a href='http://www.socialmediahighered.com/'>significant presence in higher education&#8217;s social media world</a>, has historically taken a more cavalier approach to serving as the University&#8217;s digital face. But which approach is &#8220;best&#8221;?</p>\n\n<p><img alt='' src='http://cdn.benbalter.com/wp-content/uploads/2010/09/3708549622_42a7d7e450_o-1024x363.jpg' /></p>\n\n<p>Technology has the bad habit of upsetting social norms, and as much as we try, there&#8217;s nothing we can do to stop it.<sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> Organizations looking to establish a presence on Twitter cannot afford to treat social media like other media they may have encountered. Social media is not a megaphone for a flaks to broadcast the press releases they would otherwise post elsewhere, but rather a cocktail party that provide organizations with the unique opportunity to loosen their tie, grab a drink, and work the room.</p>\n\n<p>There is a generation of communications directors and public affairs vice presidents out there that see the liberalizing power of social media as a <em>liability</em>, rather than an <em>opportunity</em>. Personal interaction with stakeholders, be they students at a university or just those who enjoy <a href='http://twitter.com/jimmyjohns'>delicious, delicious sandwiches</a>,<sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> allow organizations to connect with the people most passionate about their brand in a very real way. Just as it is second nature for city dwellers to walk past solicitors handing out pamphlets on the street corner, as the culture surrounding the technology continues to evolve so too will Twitter community begin to ostracize those members who refuse to join the ongoing digital dialog.</p>\n\n<p>Simply put, Twitter is not a dumping ground for pre-vetted paper.<sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup> The occasional typo or personal quip doesn&#8217;t hurt a company&#8217;s reputation, but rather humanizes it. So long as @GWToday (or any corporate handle for that matter) falls short of sharing a <a href='http://search.twitter.com/search?q=nom+twitpic'>picture of what they&#8217;re having for lunch</a>, we can only hope that they continue to be the model for establishing an online presence, rather than the exception.</p>\n\n<p><em>[Photo: <a href='http://www.flickr.com/photos/tranchis/3708549622/'>tranchis</a>]</em></p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>Without too much of a history lesson, see, e.g., Abraham Lincoln overseeing the Civil War from the telegraph office ushering in a new era of hands-on presidential leadership; home telephones giving rise to entire industries dedicated to interrupting families&#8217; dinners; Blackberrys changing business e-mail etiquette.</p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p>Jimmy John&#8217;s often frat-boy-esq vocabulary may push the limits of informal interactions with stakeholders, but none-the-less serves to promote their brand.</p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p>Thank the internet gods that TwitterFeed‘s RSS to Twitter conversion service didn&#8217;t catch on.</p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li></ol></div>"}