{"author":"Benjamin J. Balter","title":"How I Learned to Stop Worrying and Love the Code\n","excerpt":"I am gave a brief lightning talk at April's WordPress DC Meetup on the basics of HTML and PHP (\"coding for dummies\"). The goal: learn how to avoid breaking your website if you edit it. Below are the slides and recording.\n","layout":"post","category":["Technology"],"tags":["code","open source","presentation","wordpress"],"post_format":[],"url":"/2011/04/12/love-the-code/","date":"2011-04-12 00:00:00 -0400","id":"/2011/04/12/love-the-code","categories":["posts"],"next":"![][1]The Internet's *laissez-faire* Internet ecosystem of liberal excerpting is often at odds with both [traditional][2] [media][3] and [the law][4], but the bigger concerns for aspiring bloggers should be contributing to an ongoing dialog, rather than muddling it.\n\nI was recently asked by an aspiring \"content producer,\" what the \"rules\" were for copying or excerpting content from other sites. From their questions, it quickly became clear to me, that they were missing the point of having a website altogether. [^1]\n\nNot getting in hot water with [the fuzz][6] is important, but it is simply one checkbox among many, relegated to the same category of subdued importance as spelling or grammar. The predominant rule in online publishing should not be fair use or copyright, but rather whether the author is adding value to the blogosphere. True, space on the Internet may be relatively cheap, but your reader's time is not.\n\nIt seems Internet copyright law has become somewhat of a digital [Chupacabra][7] — the subject of endless urban legend and fact-less speculation. Despite [widespread misunderstanding][8], in practice, both the contours of fair use law and the cultural norms of the net lay clear guidelines for bloggers and content producers. Put another way, *the law's the easy part*. Worry about the content and the law will take care of itself.\n\n### The Culture\n\nMuch like its roots in academia, the cornerstone of the Internet is the ability to contribute to an ongoing dialog by building on the ideas of others. With few exceptions, if your use of another's work does not *add value *to the discussion, you may be fine legally, but practically, you're just wasting space on the Internet. Criticism, commentary, and the synthesis of ideas not only enjoy fair use protections, but more importantly, give visitors a reason to read your content, drives traffic to your site, and justifies its existence. Likewise, facts and ideas are usually fair game, as are promotional materials and logos if you are discussing a specific company or product, but the reason for such an exception is not to give bloggers fodder for an easy blog post, but rather the exception is designed as a stimulus package for the marketplace of ideas.\n\nThe culture of the internet is not that it's okay to *copy* others, but that it's okay to *criticize* others, and if in doing so you quote or reference their work, that's considered okay. So if you have something to say, where exactly does the law draw the line? [^2]\n\n### Is it copyrighted?\n\nIf a work is no longer subject to copyright claims (and thus falls in the [public domain][10]), the discussion of fair use becomes a moot point. Such a determination does not, strictly speaking turn on the inclusion of the copyright symbol. [^3] Instead, a work is [in the public domain][12] if it was created:\n\n*   by the federal government, at any time,\n*   between 1964-1977 without a copyright notice.\n*   between 1923-1963 with a copyright notice, if the copyright was not renewed,\n*   between 1923-1963 without a copyright notice, or\n*   before 1923.\n\n### Is it fair use?\n\nEven if a work merits copyright protection, it can still be used in many cases. The concept of *fair use* came about in late 1970′s following the Copyright Act of 1976. [^4] Simply put, the Copyright act states, \"*purposes such as criticism, comment, news reporting, teaching (including multiple copies for classroom use), scholarship, or research, is not an infringement of copyright.*\" While there is no cut-and-dry rule as to when use infringes on the author's copyright, the determination as to whether a given excerpt constitute fair uses is governed by four-factor [balancing test][14]: [^5]\n\n1.  the purpose and character of the use, including whether such use is of a commercial nature or is for nonprofit educational purposes;\n2.  the nature of the copyrighted work;\n3.  the amount and substantiality of the portion used in relation to the copyrighted work as a whole; and\n4.  the effect of the use upon the potential market for or value of the copyrighted work.\n\nSome factors that may tip the fair-use scale in an excerpter's favor are whether its use was commercial, [^6] transformative, [^7] or parody, [^8] the amount copied, [^9] and the effect on the market for the original [^10].\n\nIn short, so long as you link back to the original source, and contribute something to the idea, you're probably fine legally, but that misses the point. Don't copy and paste an entire post from someplace else, but a few sentences to a few paragraphs are cool *if it's in the context of you making a point*. Just like writing a paper for college, be sure to block quote for paragraphs and use quotation marks for sentences, and cite even if you paraphrase, but it still needs to be about your ideas. The Internet may provide users with free e-mail or free information, but it does not provide bloggers with free copy, nor should it.\n\nThe law aside, readers want you to digest and put ideas in your own voice. Take a paragraph from one post, a paragraph from another, and build a common thread between them – that's the bigger hurdle. Give readers a reason to come to your site. Give your site a reason to exist, and nine times out of ten, the law will be on your side.\n\n\\[Photo courtesy [tallguy][21]\\]\n\n[^1]:  Questions asked included: If there's no copyright symbol, is it still copyrighted?; If it's posted online, can I just copy it because its it's in the public domain?; Can I use it if I'm not selling it?; and It's okay to use if I credit the original author, right?. \n[^2]: It should be noted that [I'm not an attorney][23] and my writing should not be substituted for qualified legal advice. \n[^3]: This is a common misconception. While once true, under the [Berne Convention][25] the author of any content published today is assumed to retain copyright claims. \n[^4]: Codified into law as [17 U.S.C. § 107][27].\n[^5]: [Campbell v. Acuff-Rose Music, Inc.][29], 510 U.S. 569, 577-78 (1994).\n[^6]: Harper Row v. Nation Enters., 471 U.S. 539, 562 (1985)\n[^7]: *Campbell*, 510 U.S. at 578-79. \n[^8]: *Id.* at 580-81 \n[^9]: Harper Row, Publishers, Inc. v. Nation Enters., 471 U.S. 539, 565 (1985) \n[^10]: Sony Corporation of America v. Universal City Studios, Inc., 464 U.S. 417, 433 (1984). \n\n [1]: http://ben.balter.com/wp-content/uploads/2011/04/2146845610_ebd95e5f4e_b-300x200.jpg \"Copier\"\n [2]: http://www.washingtonpost.com/wp-dyn/content/article/2009/07/31/AR2009073102476.html\n [3]: http://www.niemanlab.org/2009/08/gawker-and-the-washington-post-a-case-study-in-fair-use/\n [4]: http://ilt.eff.org/index.php/Copyright:_Fair_Use\n [5]: #note-2020-1 \"Questions asked included: If there's no copyright symbol, is it still copyrighted?; If it's posted online, can I just copy it because its it's in the public domain?; Can I use it if I'm not selling it?; and It's okay to use if I credit the original author, right?.\"\n [6]: http://www.hulu.com/watch/13576/hot-fuzz-chase\n [7]: http://redvsblue.com/archive/episode.php?id=89\n [8]: http://www.llrx.com/features/bloggersbeware.htm\n [9]: #note-2020-2 \"It should be noted that I'm not an attorney and my writing should not be substituted for qualified legal advice.\"\n [10]: http://www.law.duke.edu/cspd/comics/zoomcomic.html\n [11]: #note-2020-3 \"This is a common misconception. While once true, under the Berne Convention the author of any content published today is assumed to retain copyright claims.\"\n [12]: http://www.unc.edu/~unclng/public-d.htm\n [13]: #note-2020-4 \"Codified into law as 17 U.S.C. § 107.\"\n [14]: http://en.wikipedia.org/wiki/Balancing_test\n [15]: #note-2020-5 \"Campbell v. Acuff-Rose Music, Inc., 510 U.S. 569, 577-78 (1994).\"\n [16]: #note-2020-6 \"Harper Row v. Nation Enters., 471 U.S. 539, 562 (1985)\"\n [17]: #note-2020-7 \"Campbell, 510 U.S. at 578-79.\"\n [18]: #note-2020-8 \"Id. at 580-81\"\n [19]: #note-2020-9 \"Harper Row, Publishers, Inc. v. Nation Enters., 471 U.S. 539, 565 (1985)\"\n [20]: #note-2020-10 \"Sony Corporation of America v. Universal City Studios, Inc., 464 U.S. 417, 433 (1984).\"\n [21]: http://www.flickr.com/photos/talllguy/2146845610/\n [23]: http://ben.balter.com/fine-print/\n [25]: http://en.wikipedia.org/wiki/Berne_Convention_for_the_Protection_of_Literary_and_Artistic_Works\n [27]: http://www.law.cornell.edu/uscode/17/107.html\n [29]: http://caselaw.lp.findlaw.com/scripts/getcase.pl?court=usvol=510`invol=569","previous":"<p><a href='http://xkcd.com/801/'><img alt='Golden Hammer' class='aligncenter' src='http://imgs.xkcd.com/comics/golden_hammer.png' /></a></p>\n\n<p>My biggest gripe with <a href='http://wordpress.org'>WordPress</a>, the open-source <a href='http://en.wikipedia.org/wiki/Content_management_system'>content management system</a> that silently works behind the scenes to power <a href='http://w3techs.com/technologies/overview/content_management/all'>more than 13%</a> of the Internet, is that it sets far too high a bar with which other applications must compete. I cannot count the number of times that I have used a proprietary or commercial system and silently thought to myself, &#8221;<em>WordPress can do this so much better</em>.&#8221; <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup></p>\n\n<p>This ritual saw no deviation, when I sat down to setup <a href='http://en.wikipedia.org/wiki/Microsoft_SharePoint'>SharePoint</a> in support of my <a href='http://pcjl.org'>law journal</a>‘s upcoming publication workflow. Like Alice stumbling down the rabbit hole, it quickly became apparent that in the counterintuitive world of Sharepoint, each step was going to be more and more alien than the last. And then it dawned on me: a corollary of <a href='http://www.youtube.com/watch?v=8DfztIIqbTI#t=1m3s'>Uncle Ben&#8217;s law</a>, <em>with great power does not have to come great complexity</em>.</p>\n\n<p>WordPress does many things right. It is an incredibly versatile tool, but like a body builder with a heart of gold, it is as friendly and approachable as it is powerful. WordPress has <a href='http://core.trac.wordpress.org/browser/trunk?rev=3'>more than eight years of rock-solid experience</a> storing, organizing, sorting, and searching all sorts of user-generated content. Its got a set of slick attachment functions to allow users to safely and securely upload and store their non-WordPress files in WordPress. For the past three years, it even has a proto-version control system in the form of its much-envied <a href='http://codex.wordpress.org/Revision_Management'>post revisions</a>. <sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> And it does all this through an interface so dumb-simple that <a href='http://www.thegrandparentsblog.com/'>even your grandparents could start their own site</a>. It seems like a no brainer then, to marry these tools to create a WordPress-based document management system.</p>\n\n<p>Imagine a workflow management and version control system <a href='http://lists.automattic.com/pipermail/wp-hackers/2011-March/038727.html'>building on WordPress&#8217;s existing core competencies</a>. By treating documents as a custom post type, users can leverage the power of WordPress&#8217;s extensive attachment, revision, taxonomy, and URL rewriting functionalities. Document permalinks can be routed through the traditional rewrite structure such that the latest revision of a file always remains at a static, authenticated URL, and users can toggle the visibility of documents (both internally and externally) as they currently do with post statuses and permissions. Similarly, file locking can extend WordPress&#8217;s autosave functionality (as a ping), revision logs can extend WordPress&#8217;s existing revision relationship and can be outputted as a traditional RSS feed, etc.</p>\n\n<p><img alt='' src='http://ben.balter.com/wp-content/uploads/2011/04/wireframe.png' /></p>\n\n<p>As seen in the above wireframe, document revisions would be inextricably linked to the essential WordPress experience. If you know WordPress, you know document revisions. Why reinvent the wheel when you have the best wheel the world has ever seen, and a passionate global community dedicated to improving it? This approach would not simply be limited to traditional documents. Images, PDFs, code — anything the user wants to collaborate with others on, or have a secure revision history can be thrown at it. Academics, lawyers, government folks, the possibilities are endless.</p>\n\n<p>To be fair, WordPress has been arguably overextended in some cases, <sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup> but I do not believe that to be the case here. Sure any WordPress enthusiast may be guilty of the <a href='http://xkcd.com/801'>bolt-cutter mentality</a> every now and then, but I believe, if anything, it is enterprise stakeholders&#8217; tendency to gravitate toward bloated, commercial systems that is more akin to Wolf Blitzer&#8217;s boat house, and a big reason why is because with the exception of an unnamed <sup id='fnref:4'><a href='#fn:4' rel='footnote'>4</a></sup> content management system&#8217;s poorly executed attempt at document management, no open-source alternatives exist.</p>\n\n<p>I am working on submitting this idea as a proposed <a href='http://www.google-melange.com/gsoc/homepage/google/gsoc2011'>Google Summer of Code</a> project, <sup id='fnref:5'><a href='#fn:5' rel='footnote'>5</a></sup> with the goal of giving WordPress parity with commercial and proprietary applications and hopefully injecting some open-source goodness into government and other enterprise environments, but before I do, I would love to hear your thoughts. <a href='http://ben.balter.com/contact/'>Get in touch</a>, or <a href='#comments'>leave a comment below</a>.</p>\n\n<p><strong>Update (8/29)</strong>: The final result of the project is an <a href='http://ben.balter.com/2011/08/29/document-management-version-control-for-wordpress/'>Open Source Document Management and Version Control System</a> for WordPress. An overview of its top-level features including a screencast of a typical use case is available on the <a href='http://ben.balter.com/2011/08/29/document-management-version-control-for-wordpress/'>WP Document Revisions</a> page.</p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p><em>See, e.g.,</em><a href='http://www.emc.com/domains/documentum/index.htm'>Documentum</a>, <a href='http://www.liferay.com/'>Liferay</a>, <a href='http://code.google.com/p/soc/wiki/MelangeIntro'>Melange</a>, and <a href='http://www.mediaite.com/online/worse-than-previously-thought-gawker-content-management-system-hacked/'>Gawker&#8217;s CMS</a>.</p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p>Nearly three years ago, at the time of the feature&#8217;s inception, <a href='http://wordpress.org/news/2008/07/wordpress-26-tyner/'>WordPress founder Matt Mullenweg noted</a>, &#8221;<em>With the power of modern computers, it&#8217;s silly that we still use save and editing metaphors from the time when the most common method of storage was floppy disks… now we&#8217;re taking that to another level by allowing you to view who made what changes when… through a super-easy interface, much like Wikipedia or a version control system.</em>&#8221;</p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p><em>See, e.g.,</em>WordPress as an <a href='http://net.tutsplus.com/tutorials/wordpress/build-a-wordburner-email-newsletter-manager-using-wordpress-and-feedburner/'>e-mail newsletter</a>, <a href='http://publisherblog.automattic.com/2008/02/13/wp-contact-manager/'>contact manager</a>, <a href='http://slipfire.com/wp-crm/'>CRM</a>, <a href='http://wordpress.org/extend/plugins/wp-task-manager/'>task list</a>, <a href='http://wordpress.org/extend/plugins/wp-invoice/'>invoice system</a>, <a href='http://wordpress.org/extend/plugins/job-manager/'>job bank</a>, or <a href='http://wordpress.org/extend/plugins/great-real-estate/'>real estate directory</a>.</p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li><li id='fn:4'>\n<p>Let&#8217;s just call it &#8220;Frupal&#8221; for the sake of discussion.</p>\n<a href='#fnref:4' rev='footnote'>&#8617;</a></li><li id='fn:5'>\n<p>In hindsight, I probably shouldn&#8217;t have ripped on Melange. <em>See supra note 1.</em></p>\n<a href='#fnref:5' rev='footnote'>&#8617;</a></li></ol></div>","content":"<p>I am gave a brief <a href='http://www.meetup.com/wordpressdc/events/16887732/'>lightning talk at April&#8217;s WordPress DC Meetup</a> on the basics of HTML and PHP (&#8220;coding for dummies&#8221;). The goal: learn how to avoid breaking your website if you edit it. Below are the <a href='#deck'>slides</a> and <a href='#recording'>recording</a>.</p>\n\n<p><strong>In invite you to <a href='#deck'>watch</a>, but in short, the Cliff&#8217;s Notes are:</strong></p>\n\n<ul>\n<li>\n<p>The process</p>\n\n<ul>\n<li>The server executes PHP and outputs HTML, CSS, JavaScript, etc.<img alt='' src='http://ben.balter.com/wp-content/uploads/2011/04/infographic-300x138.png' /></li>\n\n<li>The user&#8217;s browser takes that output and renders a visual representation of the page</li>\n</ul>\n</li>\n\n<li>\n<p>Client-side Languages</p>\n\n<ul>\n<li>HTML – Static (unchanging) content; provides structure</li>\n\n<li>CSS – Provides style and form</li>\n\n<li>JavaScript – Provides interactivity</li>\n</ul>\n</li>\n\n<li>\n<p>PHP – Wrapped with &#8221;<code>php</code>&#8221; and &#8221;<code>?&gt;</code>&#8221;</p>\n\n<ul>\n<li>Variable - Text, a number, true/false, or a group of variable; identified by &#8221;<code>$</code>&#8221;</li>\n\n<li><code>If</code> Statement – performs an action <em>if</em> a statement is true</li>\n\n<li><code>While</code> Loop – performs an action <em>while</em> a statement is true</li>\n\n<li><code>For</code> / <code>Foreach</code> – combines elements of <code>while</code> and <code>if</code></li>\n\n<li>Functions – predefined set of actions; always followed by &#8221;<code>( )</code>&#8221;</li>\n\n<li>Don&#8217;t forget semicolons</li>\n</ul>\n</li>\n</ul>\n<hr />\n<p><strong>Deck</strong></p>\n\n<p><strong>Recording</strong>(I&#8217;m first up)</p>\n\n<p><strong>Links to Resources Mentioned</strong></p>\n\n<ul>\n<li>\n<p>HTML</p>\n\n<ul>\n<li><a href='http://code.google.com/edu/submissions/html-css-javascript/'>Google: HTML, CSS, &amp; js from the Ground Up</a></li>\n\n<li><a href='http://htmldog.com'>HTML Dog</a></li>\n\n<li><a href='http://www.w3.org/wiki/HTML/Training'>W3 Learning Wiki</a></li>\n\n<li><a href='http://www.w3.org/wiki/HTML/Elements'>W3 Element Wiki</a></li>\n</ul>\n</li>\n\n<li>\n<p>Text Editor</p>\n\n<ul>\n<li><a href='http://notepad-plus-plus.org/'>Notepad++</a> (Windows)</li>\n\n<li><a href='http://www.barebones.com/products/textwrangler/'>TextWrangler</a>, <a href='http://www.panic.com/coda/'>Coda</a> (Mac)</li>\n</ul>\n</li>\n\n<li>\n<p>FTP Client (to connect to server)</p>\n\n<ul>\n<li><a href='http://winscp.net/eng/index.php'>WinSCP</a>, <a href='http://notepad-plus-plus.org/'>Notepad++</a> (Windows)</li>\n\n<li><a href='http://cyberduck.ch/'>CyberDuck</a>, <a href='http://www.panic.com/coda/'>Coda</a> (Mac)</li>\n</ul>\n</li>\n\n<li>\n<p>WordPress</p>\n\n<ul>\n<li><a href='http://codex.wordpress.org/Editing_wp-config.php#Debug'>Define( WP_DEBUG, true);</a> in wp-config.php</li>\n\n<li><a href='http://wordpress.org/extend/plugins/debug-bar/'>Debug bar</a> plugin</li>\n\n<li><a href='http://codex.wordpress.org/'>WordPress Codex</a></li>\n</ul>\n</li>\n</ul>\n\n<p><em>Thanks to all who came out or tuned into the live stream. Comments? Questions? I&#8217;d love to hear your thoughts <a href='#comments'>below</a> or feel free to <a href='http://ben.balter.com/contact/'>contact me</a>.</em></p>"}