{"author":"Benjamin J. Balter","title":"CFPB Accepts First Citizen-Submitted Code on Behalf of Federal Government\n","excerpt":null,"layout":"post","categories":["Technology"],"tags":[".govs","cfpb","code","federal","git","github","gov 2.0","government","open government","open source"],"post_format":[],"related_posts":[{"url":"/2010/09/12/wordpress-resume-plugin/","id":"/2010/09/12/wordpress-resume-plugin","title":"WordPress Resume Plugin"},{"url":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party/","id":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party","title":"New Media Flak: Megaphone vs. Cocktail Party"},{"url":"/2010/10/10/does-every-cloud-have-a-silver-lining/","id":"/2010/10/10/does-every-cloud-have-a-silver-lining","title":"Does Every Cloud Have a Silver Lining?"},{"url":"/2010/11/06/removing-the-barriers-to-organizational-agility/","id":"/2010/11/06/removing-the-barriers-to-organizational-agility","title":"Removing the Barriers to Organizational Agility\n"},{"url":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing/","id":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing","title":"What Fourteen-Century Apple Pie Teaches Us About Sharing\n"},{"url":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds/","id":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds","title":"Will Federal Contracting Officers Soon Have Their Heads in the Clouds?\n"},{"url":"/2010/11/29/free-trade-in-china-just-google-it/","id":"/2010/11/29/free-trade-in-china-just-google-it","title":"Free Trade in China? Just Google it."},{"url":"/2010/11/29/twitter-mentions-as-comments/","id":"/2010/11/29/twitter-mentions-as-comments","title":"Twitter Mentions as Comments WordPress Plugin\n"},{"url":"/2010/12/01/the-internet-is-series-of-tubes/","id":"/2010/12/01/the-internet-is-series-of-tubes","title":"The Internet is Series of Tubes (oh, and Tollgates too)\n"},{"url":"/2010/12/20/late-night-infomercials/","id":"/2010/12/20/late-night-infomercials","title":"Late-Night Infomercials: Guaranteed to Extend the 4th Amendment or Your Money Back"}],"url":"/2012/04/15/cfpb-accepts-first-citizen-submitted-pull-request-on-behalf-of-federal-government/","date":"2012-04-15 00:00:00 +0000","id":"/2012/04/15/cfpb-accepts-first-citizen-submitted-pull-request-on-behalf-of-federal-government","next":"/2012/04/19/hackshackers-swells-to-more-than-10000-members","previous":"/2012/04/10/whats-missing-from-cfpbs-awesome-new-source-code-policy","content":"<p>&#8220;Fix typo.&#8221; Not quite &#8220;one small step for man,&#8221; but a significant first nonetheless. These simple words, typed by an open-source developer operating under the pseudonym &#8220;iceeey,&#8221; may represent the first collaborative effort between the federal government and the broader open-source community, and surely represents a tangible win for the open-government movement as a whole.</p>\n\n<p>The Consumer Financial Protection Bureau (CFPB) is in a unique position. As the youngest federal agency, they have the opportunity to reimagine many day-to-day business processes for an internet era, and to share that innovation across government. One such process is the means by which federal employees apply for and receive subsidies to offset the cost of public transportation to and from work. Having created an application that alleviated the need to shuttle time-consuming, paper-based forms from building to building within their own agency, the Bureau sought to package up the solution, and publicly release the source code for other federal agencies to use and expand upon. The logic was simple: solve the problem once, solve it everywhere.</p>\n\n<p>But the code was not simply made available for government employees to access. The code was placed on <a href='http://github.com/'>GitHub</a> – a popular source code sharing service – for anyone to download and explore, and within days of CFPB publishing its <a href='http://www.consumerfinance.gov/blog/the-cfpbs-source-code-policy-open-and-shared/'>recently announced Source Code Policy</a>, someone did just that.GitHub user &#8220;iceeey&#8221; <a href='https://github.com/cfpb/transit_subsidy/pull/1'>submitted a proposed change</a> – known in developer parlance as &#8220;forking the project&#8221; and submitting a &#8220;pull request&#8221; — correcting a misspelling on the form initially presented to new employees (&#8220;roundtrip&#8221; was accidentally spelled &#8220;rountrip&#8221;).</p>\n\n<p>Admittedly a minor change (&#8220;one small step for grammar?&#8221;), but notable for the underlying first that it represents: the opportunity to create efficiencies across government by partnering with the broader community of civically engaged developers.</p>\n\n<p>Open-source software (software for which the underlying source code is made publicly available) as a vehicle for a more open and more efficient government is nothing new. Behind the scenes, countless agencies rely on open-source software for various business functions, and many have even chosen to publicly publish the source code underlying the applications that they themselves have built in-house to tackle unique challenges. But this seemingly innocuous missing &#8220;d&#8221; and its subsequently submitted fix represents the first time a federal agency has directly collaborated with open-source developers to better its own day-to-day tools.</p>\n\n<p>Iceeey has <a href='https://github.com/cfpb/transit_subsidy/pull/2'>already submitted his second pull request</a> (&#8220;more typos&#8221; he joked with an emoticon smiley), and I hope more agencies and more open-source developers will follow suit. Such collaborations empower agencies to do more with less; put better, more robust tools in the hands of federal employees as they carry out agency mission; and undoubtedly represent a giant-leap forward for a more open and more efficient government.</p>"}