{"author":"Benjamin J. Balter","title":"Why WordPress","excerpt":"WordPress is different. WordPress is about content. WordPress is about simplicity. Out of the box, it's a clean, lean, and mean semantic publishing platform that makes broadcasting your ideas as effortless as possible.\n","layout":"post","category":["Technology"],"tags":["open source","wordpress"],"post_format":[],"url":"/2011/09/01/why-wordpress/","date":"2011-09-01 00:00:00 -0400","id":"/2011/09/01/why-wordpress","categories":["posts"],"next":"The White House's Office of Management and Budget recently released a[ list of all domains][1] owned and operated by federal executive agencies. Leveraging a previous tool I had built called [Site Inspector][2] which provides information about a domain and its technical capabilities, I imported the list into the content management system WordPress, and created a plugin called [Domain Inventory ][3]to scan each domain and curate the results. A summary of my preliminary results appears below, as well as a link to the browsable dataset.\n\n**The project tracks each Federal Executive .Gov by:**\n\n*   **Agency **(as provided in the data.gov list)\n*   **Server status** (response code, if it is reachable, etc.)\n*   **Non-WWW support** (is www. required to access the site)\n*   **IPv6 Support** (is it reachable via next generation technology)\n*   **CDN Provider** (do they use a content distribution network, if so what)\n*   **CMS** (do they use a content management system, if so what)\n*   **Cloud Provider** (are they hosted in the cloud, if so by whom)\n*   **Analytics Source** (do they track visitors, if so how)\n*   **Script Library** (do they use common javascript libraries)\n*   **HTTPs Support** (is the site browsable via the secure HTTPS protocol)\n\n**Key Highlights of the Preliminary Results:**\n\n*   Only 73% of domains are [live and in use][4]\n*   *Of live domains* 80% are accessible [without typing the www. prefix][5].\n*   Only 10 sites fully support the federally mandated [IPv6 standard][6].\n*   87 domains use the [Akamai][7] content distribution network.\n*   12 are believed to be in the cloud, including 10 in [Amazon][8], and 2 in [Rackspace][9].\n*   103 use some form of analytics, with [Google Analytics][10] being the most popular, found on 86 domains.\n*   Drupal is[ by far the most popular CMS][11], powering nearly twice as many domains as all other CMSs combined.\n*   [WordPress][12] is the second most popular primary CMS (17), followed by Microsoft [SharePoint][13] (13).\n*   93% of *live* domains use [no detectable CMS][14], or use a custom-built solution.\n\nSlightly more than half of live servers are powered by\n\n[commercial software.][15]\n\n**The full, browsable dataset:[ http://dotgov.benbalter.com][16]**\n\n*Please note: This data is to be treated as preliminary and is provided \"as is\" with no guarantee as to its validity. The source code for all tools used, including the resulting data, is available in [GitHub][3]. If you find a systemic error, I encourage you to fork the code and I will try my best to recrawl the list to improve the data's accuracy.*\n\n**Update (10/4)**: Updated the above statistics (and underlying data) based on an updated domain list published on data.gov and recrawled using the same tools. The above numbers now use the number of *live* sites (rather than total number of domains) as the denominator for percentages, and excludes approximately 300 domains which simply redirects to other .govs.\n\n [1]: http://explore.data.gov/Federal-Government-Finances-and-Employment/Federal-Executive-Branch-Internet-Domains/k9h8-e98h\n [2]: https://github.com/benbalter/Site-Inspector\n [3]: https://github.com/benbalter/Domain-Inventory\n [4]: http://dotgov.benbalter.com/status/live/\n [5]: http://dotgov.benbalter.com/nonwww/yes/\n [6]: http://dotgov.benbalter.com/ipv6/yes/\n [7]: http://dotgov.benbalter.com/cdn/akamai/\n [8]: http://dotgov.benbalter.com/cloud/amazon/\n [9]: http://dotgov.benbalter.com/cloud/rackspace/\n [10]: http://dotgov.benbalter.com/analytics/google-analytics/\n [11]: http://dotgov.benbalter.com/cms/drupal/\n [12]: http://dotgov.benbalter.com/cms/wordpress/\n [13]: http://dotgov.benbalter.com/cms/sharepoint/\n [14]: http://dotgov.benbalter.com/cms/none/\n [15]: http://dotgov.benbalter.com/server_software/commercial/\n [16]: http://dotgov.benbalter.com","previous":"<blockquote>\n<p>&#8220;In 1876, the president of Western Union brushed off Alexander Graham Bell&#8217;s telephone as little more than an &#8221;<em>electric toy</em>,&#8221; and the company called Bell&#8217;s proposal to put one in every home &#8221;<em>utterly out of the question</em>.&#8221; Oxford University professor Erasmus Wilson predicted that when the 1878 Paris Exhibition closed, the electric light would &#8221;<em>close with it and no more will be heard of it</em>.&#8221; A Michigan banker advised his client not to invest in Henry Ford&#8217;s company in 1903 because &#8221;<em>the horse is here to stay, but the automobile is only a novelty</em>.&#8221; …If there is one constant through out time, it&#8217;s that conventional wisdom often misses the mark, especially in the early days of technological transformation.&#8221; <sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup></p>\n</blockquote>\n\n<p>I&#8217;ve never heard any individual, upon being asked what they thought of a recent automobile purchase respond, &#8221;<em>well, it&#8217;s got this weird ‘new car&#8217; smell, so it&#8217;s going to take some getting used to</em>.&#8221; <sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> Yet for many, such is the typical reaction to experiencing a new technology. <sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup></p>\n\n<p>What is it about technological progress that sends many running for their digital security blankets? <sup id='fnref:4'><a href='#fn:4' rel='footnote'>4</a></sup> For some reason, much of the resistance appears to be <a href='http://opensource.sys-con.com/node/692407'>uniformed doubt</a> (<em>e.g.</em>, &#8220;It&#8217;s different&#8221;), rather than <a href='http://www.infoworld.com/d/security-central/gartner-seven-cloud-computing-security-risks-853'>calculated avoidance</a> (<em>e.g.</em>, &#8220;It&#8217;s less secure because you can&#8217;t prevent X&#8221;). To be fair, the business world, and even more so CIO&#8217;s, see avoiding uncertainty and minimizing risk as a core competency, but I don&#8217;t think that&#8217;s the whole story.</p>\n\n<p>The rapid pace of innovation has rendered many stakeholders and decision makers out of the loop when it comes to where a given technology stands in relation to their current practices, and for good reason: disruptive technology poses a risk not only on a organization level, but on a personal level as well.</p>\n\n<ul>\n<li><strong>From a practical standpoint</strong>, all other things remaining constant, a firm&#8217;s move to the cloud, for example, <a href='http://searchnetworking.techtarget.com/news/1381193/IT-job-security-fears-over-cloud-computing-Network-jobs-still-vital'>brings into question the security of the sysadmin</a> that has spent years building up a fiefdom of server farms.</li>\n\n<li><strong>From a skills standpoint</strong>, there&#8217;s a whole generation out there that grew up on the Internet, and many of those in a position to make purchasing decisions or recommendation are simply not part of it. A young upstart consultant coming in and showing up the veteran can potentially be a recurring (and realistic) <a href='http://www.lexjansen.com/pharmasug/2000/techtech/tt16.pdf'>nightmare for many baby boomers</a>.</li>\n\n<li><strong>From a professional standpoint</strong>, at its most basic level, risk is taken by individuals (who propose a new system, procedure, etc.), which in many organizations may have an incentive to adopt a &#8220;don&#8217;t rock the boat&#8221; mentality for their own career&#8217;s sake, rather than <a href='http://en.wikipedia.org/wiki/Betamax'>risk being wrong</a>.</li>\n</ul>\n\n<p>If technological innovation were simply a matter of calculated risk and switching costs, one would expect firms to be <em>equally</em> as unlikely to upgrade an existing technology as they would be to switch to a new one. Mathematically, upgrading in-house servers to the next version of Microsoft Exchange may<a href='http://www.google.com/apps/intl/en/business/messaging_value.html'>far outweigh</a> a move to the cloud. Yet, large firms have been <a href='http://googleenterprise.blogspot.com/2009/07/paving-road-to-apps-adoption-in-large.html'>slow to make the change</a>.</p>\n\n<p>There&#8217;s a whole world out there of distributed, open innovation that, with the exception of a few startups, <sup id='fnref:5'><a href='#fn:5' rel='footnote'>5</a></sup> has been widely ignored by IT departments, and as Yochai Benkler argues in <em><a href='http://www.amazon.com/Wealth-Networks-Production-Transforms-Markets/dp/0300110561'>The Wealth of Networks</a>,</em> if history suggests anything, it is that the proprietary model is on its way to the endangered species list.</p>\n\n<p>So what&#8217;s the answer? How can open source fanatics and other early adopters rescue the change averse from their self-perpetuated anachronisms?</p>\n\n<ul>\n<li><strong>Talk about <em>solutions</em> not technology</strong> – Geeks love shiny new things. It&#8217;s in our DNA. Yet rarely are geeks the one making the decisions. Decision makers could often care less which acronym powers something, but rather than dumb things down (&#8220;this thingy talks to that thingy&#8221;), translate the situation in terms of <a href='http://www.mindtools.com/pages/article/newPPM_82.htm'>organizational change</a> (&#8220;it will wholly eliminate the need for paper forms&#8221;). Rarely does technology change without the organization following suit. <a href='http://www.amazon.com/Solution-Selling-Creating-Difficult-Markets/dp/0786303158'>Approach the situation as a human problem</a>, not a technical one.</li>\n\n<li><strong>Move past &#8221;</strong><strong><em>If it ain&#8217;t broke, don&#8217;t fix it&#8221;** – &#8221;<em>It&#8217;s good enough&#8221; should never be a persuasive argument for stagnation. Just because something has been used in the past, does not mean that it should. <sup id='fnref:6'><a href='#fn:6' rel='footnote'>6</a></sup> &lt;/em&gt;In software development, changes fit into one of two categories: bugs and enhancements. Saying that something &#8220;works&#8221; ignores exactly half of the equation.</em></em></strong></li>\n\n<li><strong>Broadcast excellence</strong>- If you ask me why an organization should use SharePoint, I have at my fingertips <a href='http://sharepoint.microsoft.com/en-us/product/benefits/Pages/default.aspx'>focus-group tested ammunition</a>. Ask my why you should use WordPress, and I&#8217;m <a href='https://encrypted.google.com/webhp?oei=4HNeTqaVEsb50gGCldE7#sclient=psy&amp;hl=en&amp;newwindow=1&amp;site=webhp&amp;source=hp&amp;q=Why+Wordpress%3F+site%3Awordpress.org&amp;pbx=1&amp;oq=Why+Wordpress%3F+site:wordpress.org&amp;aq=f&amp;aqi=&amp;aql=&amp;gs_sm=e&amp;gs_upl=3748l3748l0l4002l1l1l0l0l0l0l128l128l0.1l1l0&amp;qscrl=1&amp;bav=on.2,or.r_gc.r_pw.&amp;fp=4bf87fb63526ad5b&amp;biw=1123&amp;bih=733'>left to pretty much fend for myself</a>. Curators of innovative technology need to make themselves known, and give those empowered to affect change, the tools to do so.</li>\n</ul>\n\n<p>The future&#8217;s coming. That&#8217;s for sure. Change is inevitable. Firms looking to seek a competitive advantage will begin to look past &#8221;<em>it has to be expensive and complicated</em>&#8221; and start looking toward open-source software, not as a misfit alternative, but as a viable player in the software space, but before that can happen the open-source community must step it up, and strive to be the serious competitor they wish to be treated as.</p>\n\n<p><strong>Update (9/1):</strong>Not quite &#8220;focus-group tested ammunition,&#8221; but in a sort of meta-dogfooding, I took a stab at articulating &#8221;<a href='http://ben.balter.com/2011/09/01/why-wordpress/'>Why WordPress</a>.&#8221; Edits welcome.</p>\n\n<p>Notes:</p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>Penenberg, Adam L. (2009-09-25). <a href='http://www.amazon.com/Viral-Loop-Facebook-Businesses-Themselves/dp/1401323499'>ViralLoop: From Facebook to Twitter</a>, How Today (p. 220). Hyperion. Kindle Edition. <span>21</span></p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p>This could arguably be, because the automobile industry has seen little innovation in the past 40 years. Beyond keyless entry and GPS, cars today are in many ways functionally equivalent to their 1970′s counterparts. <span>22</span></p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p><em>See e.g,</em><a href='http://www.petitiononline.com/ada4305/petition.html'>Facebook</a>, <a href='http://www.aolnews.com/2011/02/07/gawker-redesign-does-not-exactly-thrill-the-internet/'>Gawker</a>, <a href='http://www.businessweek.com/magazine/content/10_40/b4197036693152.htm'>Twitter</a>. <span>26</span></p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li><li id='fn:4'>\n<p>Full disclosure, some may argue that I myself risk falling off the bleeding edge of the technology adoption curve, after all, I text in <a href='http://developer.apple.com/'>beta</a>, browse in <a href='http://tools.google.com/dlpage/chromesxs'>canary</a>, and publish in <a href='http://wordpress.org/download/svn/'>trunk</a>. <span>30</span></p>\n<a href='#fnref:4' rev='footnote'>&#8617;</a></li><li id='fn:5'>\n<p><em>See, e.g.,</em> Facebook using PHP, Twitter using Hadoop, and Google supporting Android and Chrome. <span>31</span></p>\n<a href='#fnref:5' rev='footnote'>&#8617;</a></li><li id='fn:6'>\n<p><em>See, e.g., <a href='http://en.wikipedia.org/wiki/Bloodletting'>bloodletting</a>. <span>33</span>&lt;/li&gt;&lt;/ol&gt;&lt;/div&gt;</em></p>\n<a href='#fnref:6' rev='footnote'>&#8617;</a></li></ol></div>","content":"<p>WordPress is <em><a href='http://wordpress.org/about/philosophy/'>different</a></em>. WordPress is about content. WordPress is about simplicity. Out of the box, it&#8217;s a clean, lean, and mean semantic publishing platform that makes broadcasting your ideas as effortless as possible.</p>\n\n<ul>\n<li><strong>Proven</strong> – WordPress powers <a href='http://techcrunch.com/2011/08/19/wordpress-now-powers-22-percent-of-new-active-websites-in-the-us/'>nearly a quarter</a> of new sites today, is the content management system (CMS) of choice for <a href='http://trends.builtwith.com/cms'>more than two thirds</a> of the top million sites making it the most popular on the web, and is trusted by content publishers both large and small including CNN and the NY Times. With more than <a href='http://en.wordpress.com/stats/'>50 million sites globally</a> and eight years of proven history, you know you&#8217;re getting the best software for the job.</li>\n\n<li><strong>Ease of use</strong> – At the core of WordPress is a <a href='http://codex.wordpress.org/Administration_Screens'>dumb-simple interface</a> similar to the desktop publishing software you use today. With no coding experience or expert knowledge necessary, the learning curve is<a href='http://codex.wordpress.org/Writing_Posts'>often about as short as typing in your site&#8217;s URL and logging in</a>. In fact, most users are able to pick up the basics without any training at all. Interfaces are polished and easy to use, and are the result of years of refinement. It&#8217;s the power of a Microsoft Word with the intuitiveness of an iPhone.</li>\n\n<li><strong>Built for Publishing</strong>- WordPress makes sharing content and attracting readers to your site a breeze. Whether pushing content to social networks, ensuring that your website is provided in the <a href='http://codex.wordpress.org/Search_Engine_Optimization_for_WordPress'>optimal format to appear at the top of search results</a> the moment you hit publish, or providing visitors the ability to <a href='http://codex.wordpress.org/WordPress_Feeds'>subscribe to specific content sub-feeds</a> in their favorite feed reader (or even via e-mail), WordPress is not simply a website, but rather a content-publishing platform. With a single click, you have a powerful megaphone to broadcast your message to the world</li>\n\n<li><strong>Community Support</strong> – WordPress is supported by a <a href='http://codex.wordpress.org/Contributing_to_WordPress'>vibrant community of users</a> who have already solved many of the toughest challenges to sharing information today. The latest version of WordPress has been download <a href='http://wordpress.org/download/counter/'>more than five million times</a> since it was release a month ago, and the prior version was downloaded more than 32 million times. With a library of <a href='http://wordpress.org/extend/'>more than 20,000 free, open-source plug-ins and themes</a> growing each day, and hundreds of core contributors each release cycle, the WordPress community is an ecosystem built around the platform&#8217;s viability and proven success.</li>\n</ul>\n\n<h3 id='content_is_king'>Content Is King</h3>\n\n<ul>\n<li><strong>Your Entire Workflow</strong> - Although it may sound a bit counter intuitive for some that saw the letters QWERTY together for the first time on an <a href='http://en.wikipedia.org/wiki/IBM_Selectric_typewriter'>IMB Selectric</a>, WordPress can actually take the place of your entire workflow from the initial draft to the time you hit publish – spelling, grammar, collaboration, and review – there&#8217;s no need for e-mails back-and-forth or expensive desktop software.</li>\n\n<li><strong>Beyond Black and White</strong>- Everything that makes webpages feel rich – pictures, videos, music, documents – can feel right at home in WordPress. With a drag-and-drop <a href='http://codex.wordpress.org/Uploading_Files'>file uploader</a> that uses the latest technology to ensure your file efortlessly makes it to the web page every time, and a <a href='http://codex.wordpress.org/Media_Add_New_Screen'>media browser to help you store, organize and find the files</a> you&#8217;re looking for, WordPress hosts the files that make your pages pop.</li>\n\n<li><strong>Distraction Free Writing</strong> - Between E-Mail, IMs, Texts, Tweets, and Status Updates, we have enough distractions as is today. Your publishing platform should not be one of them. While writing WordPress literally fades away letting you concentrate on your ideas themselves, not how you&#8217;re getting them out there.</li>\n\n<li><strong>Never Lose a Word</strong> - WordPress <a href='http://codex.wordpress.org/Revision_Management#Autosaves'>automatically saves your work</a> as you type so you don&#8217;t have to worry if your computer crashes or you make a mistake. Want to go back to a previous version? Not a problem. Every time you hit save, <a href='http://codex.wordpress.org/Revision_Management'>WordPress creates a snapshot</a> that you can restore with a single click.</li>\n\n<li><strong>Time Travel</strong> - Okay, not really, but it&#8217;s pretty close. WordPress lets you schedule posts for some time in the future or lets you backdate a post for some time in the past so that you can write when its convenient for you.</li>\n\n<li><strong>Publish Anywhere</strong> - The internet&#8217;s every, so why shouldn&#8217;t your workflow be? WordPress has <a href='http://wordpress.org/extend/mobile/'>mobile applications</a> for Android, iOS, Blackberry, Nokia, Windows Phone 7, even WebOS. Wherever you are, control of your site is <em>literally</em> at your fingertips. Your phone not listed? No fret. You can even <a href='http://codex.wordpress.org/Post_to_your_blog_using_email'>post to your site by e-mail</a>.</li>\n</ul>\n\n<h3 id='a_supercharged_v8_under_the_hood'>A Supercharged V8 Under the Hood</h3>\n\n<ul>\n<li><strong>The Right Tuxedo for Any Content</strong> – Your content deserves the best. The site should conform to your content, not the other way around. WordPress comes with a <a href='http://codex.wordpress.org/Using_Themes'>full theme system</a> which makes designing everything from the simplest site to the most complicated portal a piece of cake. Have a new design every day. Your ideas should look as good as what they say.</li>\n\n<li><strong>Obsessively Organized</strong> - It doesn&#8217;t matter how much content you have, if your visitors can&#8217;t find it. WordPress organizes your content by day, by month, by year, by author, by category — any way you can describe it — and dynamically creates browsable archives so things always stay up to date.</li>\n\n<li><strong>Killer Search Inside and Out</strong>- WordPress has killer search baked in. Every word you write is fully searchable through a single box at the top of each page and if your users choose to use an external search engine like Google, rest assured, WordPress will present your content in a way that all but ensures it makes it to the top of the results every time.</li>\n\n<li><strong>Even the URLs are Beautiful</strong>- Ever go to a site and look up to the URL bar only to see a string of letter and number gobbledygook? WordPress realizes that websites are built for people, not computers. Every URL is <a href='http://codex.wordpress.org/Using_Permalinks'>intuitively written for humans</a> and describes what your content says, not where it sits in a database.</li>\n\n<li><strong>Typography Nerds Rejoice</strong> - To do it right, publishing on the web can be a pain without the right tools. Every time you hit publish <a href='http://codex.wordpress.org/How_WordPress_Processes_Post_Content'>WordPress silently typesets each and every letter for seamless web production</a>. Where many other CMSs let the details fall by the wayside, WordPress uses the <a href='http://photomatt.net/tools/texturize'>Texturize</a> engine to intelligently converts web-unfriendly characters like quotes, apostrophes, ellipses, em and en dashes, multiplication symbols, and ampersands into typographically correct HTML entities.</li>\n\n<li><strong>¡Bienvenidos a WordPress!</strong> - WordPress has been translated to more than <a href='http://codex.wordpress.org/WordPress_in_Your_Language'>60 different languages</a>, so however you say &#8220;publish&#8221;, you&#8217;ll be saying it in no time flat.</li>\n\n<li><strong>Drag and Drop Administration</strong> - Weren&#8217;t a computer science major in college? No degree required, promise. Most of what users see from <a href='http://codex.wordpress.org/Appearance_Menus_Screen'>menus</a> to the <a href='http://codex.wordpress.org/Appearance_Widgets_Screen'>dynamic functionality on each page</a> can be fully customized with simple drag-and-drop controls on the back end.</li>\n\n<li><strong>Multiple Personalities</strong> - Got a bunch of users? Not a problem. WordPress lets you <a href='http://codex.wordpress.org/Roles_and_Capabilities'>define different roles for different users</a> – just like in real life – and lets you assign privileges accordingly. Users can register themselves (if you want), and can submit content for your review.</li>\n</ul>\n\n<h3 id='user_tested_geek_approved'>User Tested, Geek Approved</h3>\n\n<ul>\n<li><strong>Out-of-the-box Power</strong> - WordPress provides extensive functionality right out-of-the-box and often little customization is needed to adapt the software for your unique use. Many other CMSs rely on you to hunt down, install, and configure a long-list of add-ons just to get many of the features WordPress considers core (comments, RSS feeds, revisions, etc.) and relies on developers to undertake significant coding efforts to provide the functionality you need. WordPress does the heavy lifting so you don&#8217;t have to. Why reinvent the wheel when you already have the best wheel in the world?</li>\n\n<li><strong>Open and Transparent</strong>- WordPress is built by a dedicated community of professional developers, academics, and enthusiasts with the source code released to the world to take apart, build upon, and improve. It&#8217;s hallmark is a rapid development cycle, meaning frequent updates and always up-to-date software, all with no licensing fees or direct costs. And with an extensive international community professional support is always wherever you are.</li>\n\n<li><strong>It&#8217;s Your Data</strong> - Some publishing platforms like to lock you in with proprietary data formats. Not here. WordPress relies on open standards to allow you to take your data with you, and even comes with tools to seamlessly import from many popular sources. It&#8217;s your data, and you should do what you want with it.</li>\n\n<li><strong>It&#8217;s Your Software</strong> - WordPress is designed to be installed on your own web server, in the cloud, or in a shared hosting account. You have complete control. Unlike commercial software or third-party hosted services, you can be sure of being able to access and modify everything related to your site. You can even install WordPress on your personal computer, or on a corporate intranet.</li>\n\n<li><strong>Power One Site or Millions</strong> - WordPress offers multi-site technology. It is the same technology that powers over 20 million sites on <a href='http://wordpress.com/'>WordPress</a><a href='http://wordpress.com/'>.</a><a href='http://wordpress.com/'>com</a> and global sites like CNN and the New York Times. Multi-site technology allows users to have full administrative control over their own site, without any security concerns. Each site can have its own look-and-feel (themes), its own functionality (plug-ins), and manage its own users, while at the same time, network-wide policies and security updates can be deployed at the click of a button.</li>\n</ul>\n\n<h3 id='your_cio_will_love_it'>Your CIO will Love it</h3>\n\n<ul>\n<li><strong>Your Site is Your Castle</strong>- WordPress has more than eight years of history powering stable, <a href='http://codex.wordpress.org/Hardening_WordPress'>secure websites</a>. Vulnerabilities are discovered quickly because of the wide user-base and dedicated open-source community, patches are rapidly developed by the dedicated security team, and often released in the span of hours from the time they are reported. WordPress comes with an<a href='http://codex.wordpress.org/Updating_WordPress#Automatic_Update'>integrated core-update system</a>, so patches are deployed at the click of a mouse. WordPress<a href='http://codex.wordpress.org/Data_Validation'>sanitizes all user input</a>, restricts URL access, has an extensive user permissioning system, and never stores passwords in an unecryptable format. WordPress uses WordPress.com&#8217;s 20 million users to beta test releases before they come out, so that by the time new versions are released, stakeholders can be confident in their stability.</li>\n\n<li><strong>Extensive APIs</strong> - WordPress&#8217;s core relies on its own<a href='http://codex.wordpress.org/Plugin_API'>extensive API interface</a> (commonly known as <a href='http://en.wikipedia.org/wiki/Eating_your_own_dog_food'>dogfooding</a>) which consequently allows developers to quickly and effectively customize the application to their unique needs. Many aspects of the essential WordPress experience can be overridden or modified by user-generated <a href='http://codex.wordpress.org/Plugin_API/Action_Reference'>hooks and filters</a>. These APIs help WordPress integrate seamlessly with existing systems, a necessity in a stove-pipe rich environments.</li>\n\n<li><strong>Enterprise Ready</strong> - Any challenge the agency faces, chances are, someone else has already tackled it and provided the code free of charge. WordPress has been adapted to countless enterprise environments, and provides support for Active Directory authentication, user management, work-flow integration, and scheduled backups, among other enterprise-centric features.</li>\n\n<li><strong>Interoperability</strong> - Want to connect WordPress to another system? WordPress uses <a href='http://www.xmlrpc.com/'>XML-RPC</a>, an open XML standard that allows different systems in different environments to talk to one another. XML-RPC is designed to be as simple as possible, while at the same time allowing for complex tasks to be performed.</li>\n\n<li><strong>Maintenance so simple you&#8217;ll wonder why you did it the other way</strong>- Installing and upgrading WordPress is a piece of cake. WordPress&#8217;s <a href='http://codex.wordpress.org/Installing_WordPress#Famous_5-Minute_Install'>famous five minute install</a> is the envy of the industry, and with <a href='http://codex.wordpress.org/Dashboard_Updates_Screen'>one click updates</a>, you&#8217;ll know you always be using the best. Try it and you&#8217;ll wonder why all software isn&#8217;t this easy.</li>\n\n<li><strong>Trust, but Verify</strong> - Not everyone is evil, but keep those who are in check by limiting which html tags are kosher on your weblog. The default html tags allowed by WordPress are a sane choice to let people use html in their comments and posts, without compromising the safety of your data or server.</li>\n\n<li><strong>Standards Complaint… and then some</strong> - The WordPress team has gone to great lengths to ensure every bit of WordPress generated code is in full compliance with the standards of the <a href='http://w3.org/'>W3C</a>. This is important not only for interoperability with today&#8217;s browser but also for forward compatibility with the tools of the next generation. Your web site is a beautiful thing, and you should demand nothing less.</li>\n\n<li><strong>More than a Blog… Much, Much More</strong>- Anyone who says WordPress is a mere blogging platform is covering for the fact that they haven&#8217;t been following the CMS&#8217;s explosive growth over the past couple years. Saying WordPress is only a blogging platform is like saying BMW is <a href='http://www.logoblog.org/bmw_logo.php'>only a propeller manufacturer</a>. In fact, the majority of the time, <a href='http://max.limpag.com/article/wordpress-open-source-cms-2011/'>WordPress isn&#8217;t even used as a blog</a>. With built in support for custom post types and custom taxonomies, if you can dream it, WordPress can make it a reality.</li>\n</ul>"}