{"author":"Benjamin J. Balter","title":"WordPress Resume Plugin","excerpt":"WP Resume is an out-of-the-box solution to get your resume online and keep it updated. Built on WordPress 3.0's custom post type functionality, it offers a uniquely familiar approach to publishing. If you've got a WordPress site, you already know how to use WP Resume.\n","layout":"post","category":["Technology"],"tags":["career","job","online reputation","open source","plugin","Resume","wordpress"],"post_format":[],"url":"/2010/09/12/wordpress-resume-plugin/","date":"2010-09-12 00:00:00 -0400","id":"/2010/09/12/wordpress-resume-plugin","categories":["posts"],"next":"A recent [back][1] and [forth][2] in the opinion pages of GW's paper of note brought to light an emerging divide in publicists' approaches to social media.  One the one hand, GW's primary Twitter account, @GWTweets, casts the University in a stoic, buttoned-up light, with little, if any interactions with members of the rather active online community (*e.g.*, mentions, @replies, or ReTweets).  @GWToday on the other hand, the *de facto *hub of the campus's Twitter scene, and arguably a [significant presence in higher education's social media world][3], has historically taken a more cavalier approach to serving as the University's digital face. But which approach is \"best\"?\n\n![][4]\n\nTechnology has the bad habit of upsetting social norms, and as much as we try, there's nothing we can do to stop it.[^5]  Organizations looking to establish a presence on Twitter cannot afford to treat social media like other media they may have encountered.  Social media is not a megaphone for a flaks to broadcast the press releases they would otherwise post elsewhere, but rather a cocktail party that provide organizations with the unique opportunity to loosen their tie, grab a drink, and work the room.\n\nThere is a generation of communications directors and public affairs vice presidents out there that see the liberalizing power of social media as a *liability*, rather than an *opportunity*.  Personal interaction with stakeholders, be they students at a university or just those who enjoy [delicious, delicious sandwiches][6],[^7] allow organizations to connect with the people most passionate about their brand in a very real way. Just as it is second nature for city dwellers to walk past solicitors handing out pamphlets on the street corner, as the culture surrounding the technology continues to evolve so too will Twitter community begin to ostracize those members who refuse to join the ongoing digital dialog.\n\nSimply put, Twitter is not a dumping ground for pre-vetted paper.[^8] The occasional typo or personal quip doesn't hurt a company's reputation, but rather humanizes it. So long as @GWToday (or any corporate handle for that matter) falls short of sharing a [picture of what they're having for lunch][9], we can only hope that they continue to be the model for establishing an online presence, rather than the exception.\n\n*\\[Photo: [tranchis][10]\\]*\n\n [1]: http://media.www.gwhatchet.com/media/storage/paper332/news/2010/09/07/Opinions/gwtoday.Stop.Damaging.Gws.Reputation-3928003.shtml\n [2]: http://media.www.gwhatchet.com/media/storage/paper332/news/2010/09/13/Opinions/Conor.Rogers.jguiffre.Pls.Refudiate-3930388.shtml\n [3]: http://www.socialmediahighered.com/\n [4]: http://cdn.benbalter.com/wp-content/uploads/2010/09/3708549622_42a7d7e450_o-1024x363.jpg \"Megaphone\"\n [^5]: Without too much of a history lesson, see, e.g., Abraham Lincoln overseeing the Civil War from the telegraph office ushering in a new era of hands-on presidential leadership; home telephones giving rise to entire industries dedicated to interrupting families' dinners; Blackberrys changing business e-mail etiquette.\n [6]: http://twitter.com/jimmyjohns\n [^7]: Jimmy John's often frat-boy-esq vocabulary may push the limits of informal interactions with stakeholders, but none-the-less serves to promote their brand.\n [^8]: Thank the internet gods that TwitterFeed‘s RSS to Twitter conversion service didn't catch on.\n [9]: http://search.twitter.com/search?q=nom+twitpic\n [10]: http://www.flickr.com/photos/tranchis/3708549622/\n [11]: http://en.wikipedia.org/wiki/Abraham_Lincoln_and_the_Civil_War#Conducting_the_war_effort\n [14]: http://twitterfeed.com/","previous":"<p>Described by the US Chief Technology Officer as &#8220;the baddest of the badass innovators,&#8221; serve as entrepreneur in residence reimagining the role of technology in brokering the relationship between citizens and government.</p>","content":"<p>As I began to set up my own site, I was not a huge fan of the options out there for adding a resume or CV to a WordPress blog. Many personal Web sites used lackluster TinyMCE formatting (bold, italic, bullets, nothing else) or simply stuffed pre-styled HTML into an existing page. I can&#8217;t even begin to fathom the workflows some people must go through every time they want to update their resume.<sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> A few purpose-built plugins offered a slightly more streamlined approach, but cluttered the backend with unnecessary and unfamiliar menus, and spawned legions of database tables to store the data.</p>\n\n<p><em>Enter WP Resume…</em></p>\n\n<p>WP Resume is an out-of-the-box solution to get your resume online and keep it updated. Built on WordPress 3.0&#8217;s custom post type functionality, it offers a uniquely familiar approach to publishing. If you&#8217;ve got a WordPress site, you already know how to use WP Resume.</p>\n\n<p><strong>Features include:</strong></p>\n\n<ul>\n<li>Support for sections (e.g., education, experience), organizations (e.g., somewhere state university, Cogs, Inc.), positions (e.g., bachelor of arts, chief widget specialist), and details (e.g., grew bottom line by 15%, president of the sustainability club)</li>\n\n<li>Follows best practices in resume layout and design</li>\n\n<li>One click install, just start adding content</li>\n\n<li>Drag and drop ordering of resume elements</li>\n\n<li>Built on existing WordPress code, utilizing a single custom post type and two custom taxonomies</li>\n\n<li>The WYSIWYG editing experience you know and love</li>\n\n<li>Revisioning</li>\n\n<li>Integrates with your theme like they were made for each other</li>\n\n<li>Custom URL</li>\n\n<li>Does not use pretentious accents on the word &#8220;resume&#8221;</li>\n\n<li>Extremely original title</li>\n</ul>\n\n<p><img alt='' src='http://cdn.benbalter.com/wp-content/uploads/2010/09/wp_resume-300x223.png' />The hardest part of getting your resume online should be doing the work listed on it, not wrestling the publishing platform. Simply put, WP Resume steps aside and lets your experience shine.</p>\n\n<p>Interested? You can <a href='http://ben.balter.com/resume/'>see it in action</a>, or if you&#8217;re ready to take the plunge, <a href='http://wordpress.org/extend/plugins/wp-resume/'>download it from the WordPress plugin repository</a>, and <a href='http://wordpress.org/extend/plugins/wp-resume/installation/'>try it today</a>. There&#8217;s even a <a href='http://tech.journalism.cuny.edu/documentation/wp-resume/'>great walkthrough put together by the good folks at CUNY Graduate School of Journalism.</a> Bugs, questions, comments, feedback? I&#8217;d love to hear about your experience with WP Resume in the comments below.</p>\n\n<p><em>Enjoy using WP Resume? Feel free to <a href='http://ben.balter.com/donate/' title='Donate'>make a small donation</a> to support the software&#8217;s continued development.</em></p>\n\n<p><em>[Photo: <a href='http://www.flickr.com/photos/shawnmichael/4246330043/'>shawnmichael</a>]</em></p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>I imagine it would resemble a highly digitized <a href='http://www.youtube.com/watch?v=qybUFnY7Y8w'>Rube Goldberg Machine</a></p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li></ol></div>"}