{"title":"Securing the Status Quo","excerpt":"The Effect of Federal IT Security Policies on Innovation","author":"Benjamin J. Balter","layout":"post","comments":true,"categories":["Technology"],"tags":["FISMA","Cybersecurity","policy","government"],"published":true,"related_posts":[{"url":"/2010/09/12/wordpress-resume-plugin/","id":"/2010/09/12/wordpress-resume-plugin","title":"WordPress Resume Plugin"},{"url":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party/","id":"/2010/09/13/new-media-flak-megaphone-vs-cocktail-party","title":"New Media Flak: Megaphone vs. Cocktail Party"},{"url":"/2010/10/10/does-every-cloud-have-a-silver-lining/","id":"/2010/10/10/does-every-cloud-have-a-silver-lining","title":"Does Every Cloud Have a Silver Lining?"},{"url":"/2010/11/06/removing-the-barriers-to-organizational-agility/","id":"/2010/11/06/removing-the-barriers-to-organizational-agility","title":"Removing the Barriers to Organizational Agility\n"},{"url":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing/","id":"/2010/11/08/what-fourteen-century-apple-pie-teaches-us-about-sharing","title":"What Fourteen-Century Apple Pie Teaches Us About Sharing\n"},{"url":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds/","id":"/2010/11/15/will-federal-contracting-officers-soon-have-their-heads-in-the-clouds","title":"Will Federal Contracting Officers Soon Have Their Heads in the Clouds?\n"},{"url":"/2010/11/29/free-trade-in-china-just-google-it/","id":"/2010/11/29/free-trade-in-china-just-google-it","title":"Free Trade in China? Just Google it."},{"url":"/2010/11/29/twitter-mentions-as-comments/","id":"/2010/11/29/twitter-mentions-as-comments","title":"Twitter Mentions as Comments WordPress Plugin\n"},{"url":"/2010/12/01/the-internet-is-series-of-tubes/","id":"/2010/12/01/the-internet-is-series-of-tubes","title":"The Internet is Series of Tubes (oh, and Tollgates too)\n"},{"url":"/2010/12/20/late-night-infomercials/","id":"/2010/12/20/late-night-infomercials","title":"Late-Night Infomercials: Guaranteed to Extend the 4th Amendment or Your Money Back"}],"url":"/2012/12/26/securing-the-status-quo/","date":"2012-12-26 00:00:00 +0000","id":"/2012/12/26/securing-the-status-quo","next":"/2012/12/27/introducing-jekyllbot","previous":"/2012/12/16/deprecate-management","content":"<h1 id='the_effect_of_federal_it_security_policies_on_innovation'>The Effect of Federal IT Security Policies on Innovation</h1>\n<div class='maruku_toc'><ul style='list-style: none;'><li><a href='#i_the_current_it_security_regime'>I. The Current IT Security Regime</a><ul style='list-style: none;'><li><a href='#a_the_federal_information_security_management_act'>A. The Federal Information Security Management Act</a></li><li><a href='#b_the_privacy_act'>B. The Privacy Act</a></li><li><a href='#c_formal_guidance'>C. Formal Guidance</a></li></ul></li><li><a href='#ii_mere_security_theater'>II. Mere Security Theater</a></li><li><a href='#iii_problems_with_existing_information_security_policy'>III. Problems with Existing Information Security Policy</a><ul style='list-style: none;'><li><a href='#a_difficulty_implementing'>A. Difficulty Implementing</a></li><li><a href='#b_ambiguity'>B. Ambiguity</a></li><li><a href='#c_a_culture_of_indifference'>C. A Culture of Indifference</a></li><li><a href='#d_a_disinterested_public'>D. A Disinterested Public</a></li><li><a href='#e_lack_of_accountability'>E. Lack of Accountability</a></li></ul></li><li><a href='#iv_the_toll_on_taxpayers'>IV. The Toll on Taxpayers</a><ul style='list-style: none;'><li><a href='#a_administrative_costs'>A. Administrative Costs</a></li><li><a href='#b_opportunity_costs'>B. Opportunity Costs</a></li></ul></li><li><a href='#v_streamlining_our_nations_information_security'>V. Streamlining our Nations Information Security</a><ul style='list-style: none;'><li><a href='#a_carrots_not_sticks'>A. Carrots, not Sticks</a></li><li><a href='#b_reduce_duplication_of_efforts'>B. Reduce Duplication of Efforts</a></li><li><a href='#b_modular_administration'>B. Modular Administration</a></li><li><a href='#c_a_grace_period_for_pilot_programs'>C. A Grace Period for Pilot Programs</a></li></ul></li><li><a href='#conclusion'>Conclusion</a></li></ul></div>\n<p>The United States Federal Government is the single largest purchases of information security products.<sup id='fnref:1'><a href='#fn:1' rel='footnote'>1</a></sup> In FY 2011 alone, a mere 24 agencies<sup id='fnref:2'><a href='#fn:2' rel='footnote'>2</a></sup> reported a combined IT security budget of $13.3 billion, employing the equivalent of some 84,426 full time employees with major responsibilities for information security.<sup id='fnref:3'><a href='#fn:3' rel='footnote'>3</a></sup> The gravity of the ongoing threat to our nations cybersecurity has been described in the starkest of terms at the highest levels of government. Describing our current situation, President Obama remarked that [t]he status quo is no longer acceptable<sup id='fnref:4'><a href='#fn:4' rel='footnote'>4</a></sup>, members of congress from both parties have characterized the risk as a catastrophe in the making,<sup id='fnref:5'><a href='#fn:5' rel='footnote'>5</a></sup> and Secretary of Defense Leon Panetta warned of an imminent digital Pearl Harbor.<sup id='fnref:6'><a href='#fn:6' rel='footnote'>6</a></sup></p>\n\n<p>Yet, despite all these histrionics, successful attacks against the nations most hardened systems are perpetrated each day. In 2005, for example, a lone hacker in the United Kingdom was able to remotely render more than 300 computers at an American Naval Station completely inoperable, by simply deleting a single file.<sup id='fnref:7'><a href='#fn:7' rel='footnote'>7</a></sup> In 2011, foreign intruders gained access to more than 24,000 files including those concerning the military&#8217;s most sensitive systems surveillance technologies, satellite communications systems, and network security protocols,<sup id='fnref:8'><a href='#fn:8' rel='footnote'>8</a></sup> and as recently as October of 2012, the Chinese government attempted to infect computers within the White House office responsible for maintaining the Presidents nuclear launch codes.<sup id='fnref:9'><a href='#fn:9' rel='footnote'>9</a></sup></p>\n\n<p>At the same time, the government computer systems that agencies rely on for many internal processes are often years behind the technology readily available to consumers who can run entire websites form the smartphone resting within their pocket. Whereas once the federal government pushed the capabilities of information systems &#8212; using the first computers to calculate projectile trajectories during the cold war or interconnecting the first machines to give rise to what is today the Internet &#8212; today government and innovation are far from synonymous. Over the past few decades the IT industry has undergone a radical transformation towards consumerization, a transformation that has largely left the public sector behind. Whereas once deploying a technology solution would require months of upfront planning and investment, today lean, iterative, and decentralized solutions dominate the marketplace &#8212; technologies ill suited for adoption within the governments paperwork-laden security regime.</p>\n\n<p>Current government security restrictions rightful seek to protect large, mission-critical systems. Yet such efforts often come at the cost of significantly hindering the adoption of smaller, less vital system, many of which &#8212; such as blogs or social media tools &#8212; can have a greater impact on the day-to-day life of average Americans. The availability of cheaper, leaner solutions, now commonplace in the private sector, can not only provide government with a unique opportunity to meet citizens demands to do more with less, but can also empower it to expand service offerings into new verticals such as transacting additional citizen services online, or offering greater transparency within existing offerings. To unlock the potential of emerging technologies, security requirements for pilot programs should be relaxed so that agencies are empowered to follow private sector best practices to rapidly bring prototypical solutions to market and are given the freedom to tap existing third-party, often free services.</p>\n<!-- more -->\n<h2 id='i_the_current_it_security_regime'>I. The Current IT Security Regime</h2>\n\n<p>The federal governments current information security policy is defined primarily by two key documents, the Federal Information Security Management Act and the Privacy Act, and is operationalized through a patchwork of recommendations and requirements as outlined by the Federal Acquisition Register, the National Institute of Standards and Technology, and the Office of Management and Budget.</p>\n\n<h3 id='a_the_federal_information_security_management_act'>A. The Federal Information Security Management Act</h3>\n\n<p>The Federal Information Security Act (FISMA) is designed to provide a comprehensive framework for ensuring the effectiveness of information security controls over information resources that support Federal operations and assets.<sup id='fnref:10'><a href='#fn:10' rel='footnote'>10</a></sup> By harmonizing overlapping agency requirements, eliminating obsolete mandates, and updating outmoded provisions, the Act sought to unify congresss attempts over the past decade to address information security needs piecemeal through a scattered mosaic of legislation.<sup id='fnref:11'><a href='#fn:11' rel='footnote'>11</a></sup> Specifically, the acts purpose is protecting information and information systems from unauthorized access, use, disclosure, disruption, modification, or destruction to maintain the integrity, confidentiality, and availability of such information.<sup id='fnref:12'><a href='#fn:12' rel='footnote'>12</a></sup> FISMA has several components. First, it designates the Office of Management and Budget (OMB) director as having the authority to oversee agency information security policies and practices, requires agencies to provide information security protections, and oversee agency compliance with FISMA by conducting annual reviews and producing reports to congress.<sup id='fnref:13'><a href='#fn:13' rel='footnote'>13</a></sup> To facilitate this end, FISMA empowers OMB with the ability to approve or deny any federal agency&#8217;s information security system.<sup id='fnref:14'><a href='#fn:14' rel='footnote'>14</a></sup> Second, FISMA requires that the National Institute for Standards and Technology (NIST) promulgate the security standards by which agencies must comply.<sup id='fnref:15'><a href='#fn:15' rel='footnote'>15</a></sup> NIST fulfills this obligation by producing Federal Information Processing Standards Publication (FIPS) 199. FIPS 199 specifies guidelines for defining the potential impact of a security breach (low, medium, high) resulting in the loss of confidentiality, integrity, or availability of government information.<sup id='fnref:16'><a href='#fn:16' rel='footnote'>16</a></sup> Third, FISMA requires, a certification and accreditation (C&#38;A) &#8212; measuring the efforts to define the appropriate risk on a system-by-system basis &#8212; and plan of action and milestones (POA&#38;M) &#8212; measuring the compliance with established methodologies for correcting discrepancies.<sup id='fnref:17'><a href='#fn:17' rel='footnote'>17</a></sup> Both metrics are design to measure the people, process, and technology aspects of security, but arguably fail to properly represent true operational security on a system-by-system basis.<sup id='fnref:18'><a href='#fn:18' rel='footnote'>18</a></sup> Finally, the fourth requirement, under FISMA, plans and procedures must ensure continuity of operations [(COOP)] for information systems.<sup id='fnref:19'><a href='#fn:19' rel='footnote'>19</a></sup> Such provisions generally include backup systems, transitions plans, and security controls to maintain continuity of operations during loss of power, disasters, or other potential interruptions of service.<sup id='fnref:20'><a href='#fn:20' rel='footnote'>20</a></sup> FISMA does not require security at all costs, but instead, includes cost-effectiveness among its considerations, specifying that implementing policies and procedures to cost-effectively reduce risks to an acceptable level.<sup id='fnref:21'><a href='#fn:21' rel='footnote'>21</a></sup></p>\n\n<h3 id='b_the_privacy_act'>B. The Privacy Act</h3>\n\n<p>The second major body of security legislation governing agency&#8217;s actions is the Privacy Act of 1974.<sup id='fnref:22'><a href='#fn:22' rel='footnote'>22</a></sup> The act, which was passed on December 31st 1974 and went into effect in September of the subsequent year, serves the dual purpose of preventing the disclosure of individuals private information by government agencies that collect it (<em>e.g,</em> names or other identifying information linked to education, financial transactions, medial history, and criminal or employment history), and enabling individuals to determine what information has been collected, as well as to verify its accuracy.<sup id='fnref:23'><a href='#fn:23' rel='footnote'>23</a></sup> Specifically, as outlined in the E-Government Act of 2002, agencies are required to conduct a Privacy Impact Assessment (PIA) prior to &#34;developing or procuring information technology or initiating a new collection of information in an identifiable form.<sup id='fnref:24'><a href='#fn:24' rel='footnote'>24</a></sup> For each new information collection, an agency must publish a PIA which addresses (1) What information is being collected; (2) why the information is being collected; (3) the intended use of the agency information; (4) with whom the information will be shared; (5) what notice or opportunities will be provided to individuals regarding what information is collected and with whom that information will be shared; (6) how the information will be secured, and (7) whether the information collection will create a system of records.<sup id='fnref:25'><a href='#fn:25' rel='footnote'>25</a></sup> PIAs are intended to be commensurate with the size of the information system being assessed, the sensitivity of information that is in an identifiable form in that system, and the risk of harm from unauthorized release of that information[.]<sup id='fnref:26'><a href='#fn:26' rel='footnote'>26</a></sup> The first step, then, for an agency wishing to deploy information technology, is to determine if such a system constitutes an information system under the act.</p>\n\n<p>The most recent definition of information system comes from the 1995 revision of the Paperwork Reduction Act (PRA).<sup id='fnref:27'><a href='#fn:27' rel='footnote'>27</a></sup> The PRA expanded the definition of information system from management information system to any discrete set of information resources organized for the collection, processing, maintenance, use, sharing, dissemination, or disposition of information.<sup id='fnref:28'><a href='#fn:28' rel='footnote'>28</a></sup> In this context, information resources include information and related resources, such as personnel, equipment, funds, and information technology.<sup id='fnref:29'><a href='#fn:29' rel='footnote'>29</a></sup> At the time of its drafting, information systems roughly corresponded with a physical machine (e.g., a computer). These physical boundaries made the task of privacy oversight relatively straightforward.<sup id='fnref:30'><a href='#fn:30' rel='footnote'>30</a></sup> It used to be in the 1960s and 1970s that government and large corporations centrally owned computers. With the emergence of the personal computer in the late 1970s and 1980s, this computing power was decentralized as the technology became affordable to the average consumer. This decentralizing trend continued into the 1990s with the explosion of mobile computing. Today however, we are seeing a shift back to a more centralized computing model. As hardware becomes commoditized, computing power is once again being aggregated into large datacenters, and becoming accessible much like a public utility.<sup id='fnref:31'><a href='#fn:31' rel='footnote'>31</a></sup> This blurring of physical lines &#8212; where multiple processes may live on the same physical machine, with many virtual machines being constantly created and destroyed &#8212; has the potential to significantly complicate an agency&#8217;s determination as to when an information system exists.</p>\n\n<p>The second threshold determination complicated by recent advances in technology is the creation of a system of records. The Privacy Act requires agencies to report the systems of records that they maintain, and for each system, to describe in detail, what information is collected, the purpose of the information collection, and to whom requests for records should be sent.<sup id='fnref:32'><a href='#fn:32' rel='footnote'>32</a></sup> Prior to establishing any new system of records, agencies are required to go through a lengthy approval process, and to publish a System of Records Notice (SORN) in the Federal Register.<sup id='fnref:33'><a href='#fn:33' rel='footnote'>33</a></sup> The term system of records is an artificial distinction, legislatively created to identify those groups of records to which the Privacy Act applies, and those to which it does not apply.<sup id='fnref:34'><a href='#fn:34' rel='footnote'>34</a></sup> The Act itself defines a system of records as a group of any records under the control of any agency from which information is retrieved by the name of the individual or by some identifying number, symbol, or other identifying particular assigned to the individual.<sup id='fnref:35'><a href='#fn:35' rel='footnote'>35</a></sup> This analysis involves examining the actual methods a given system uses to store and retrieve information.<sup id='fnref:36'><a href='#fn:36' rel='footnote'>36</a></sup></p>\n\n<p>Such an analysis is easy to apply to physical systems of records (e.g., records in a doctors office organized by patient name or social security number) or the first computerized databases that required strict, pre-defined indexes to efficiently retrieve a given record. Today however, most methods of storage and retrieval allow filtering records by any composite data element (e.g., SQL), and emerging methods of searching large amounts of data (e.g., MapReduce, Hadoop) have no index at all. This raises a question of how many retrievals of information using ones name or other unique identifier, even if not via a traditional index, are sufficient to create a system of records.<sup id='fnref:37'><a href='#fn:37' rel='footnote'>37</a></sup> Compounding the fact, industry best practices dictate that even the simplest systems &#8212; be they public facing systems like a website or internal business process systems to aid in agency functions &#8212; assign unique identifiers to each record to aid in retrieval. Clearly, the privacy act has not kept with the reality of how technology is actually used to support an agency&#8217;s mission.</p>\n\n<h3 id='c_formal_guidance'>C. Formal Guidance</h3>\n\n<p>The third source of agency responsibility comes from formal guidance promulgated by OMB and NIST. The Federal Acquisition Regulation (FAR) requires agencies to comply with OMB&#8217;s implementing policies including Appendix III of OMB Circular A-130, and guidance and standards from the Department of Commerce&#8217;s National Institute of Standards and Technology.<sup id='fnref:38'><a href='#fn:38' rel='footnote'>38</a></sup> Circular A-130 requires agencies to incorporate a system security plan within the information resource management (IRM) planning processes as required by the Paperwork Reduction Act. Such a plan must include established rules of behavior regarding each system, adequate training, personnel controls, incident response capabilities, continuity of support, technical security, and written agreements for any interconnections between systems. A-130 also outlines additional, more stringent requirements for major systems.</p>\n\n<p>NIST publishes its requirements as part of Federal Information Processing Standards (FIPS) 199 and Special Publication (SP) 800-53.<sup id='fnref:39'><a href='#fn:39' rel='footnote'>39</a></sup> FIPS 199 provides a framework for determining the level of risk associated with the potential impact to an organization or individuals for a given system across three metrics, confidentiality, integrity, and availability. This in turn, informs additional requirements depending on the appropriate security category assigned. SP 800-53 further outlines the various security controls agencies must implement for each system. Such controls include management controls &#8212; security assessment and authorization, risk assessment, system and services acquisition, and program management; operational controls &#8212; personnel security, physical and environmental security, contingency planning, configuration management, maintenance, systems and information integrity, media protection, incident response, and awareness and training; and technical controls &#8212; identification and authorization, access control, audit and accountability, and system and communications protection. Various other publications impose additional continuous monitoring requirements beyond the initiation certification and accreditation of the application.<sup id='fnref:40'><a href='#fn:40' rel='footnote'>40</a></sup></p>\n\n<h2 id='ii_mere_security_theater'>II. Mere Security Theater</h2>\n\n<p>The myriad guidance and labyrinthian requirements may do less to secure our nations information systems than policymakers hope. A number of critics have complained that the current security regime incentivizes agencies to perform a simple box checking paperwork exercise that does not keep up with an ever-expanding and ever-changing world of threats.<sup id='fnref:41'><a href='#fn:41' rel='footnote'>41</a></sup> &#160;This paperwork drill puts into place and measures paper-based processes, rather than technical processes, for implementing information security,<sup id='fnref:42'><a href='#fn:42' rel='footnote'>42</a></sup> and ultimately fails to address the root causes of network exploitation: inadequate software quality assurance.<sup id='fnref:43'><a href='#fn:43' rel='footnote'>43</a></sup> Even assuming 100% compliance with all FISMA requirements, many believe that agencies would fail short of bolstering actual information security.<sup id='fnref:44'><a href='#fn:44' rel='footnote'>44</a></sup> Tim Bennett, President of the Cyber Security Industry Alliance lamented that FISMA grades not how well agencies have increased their information security, but rather how well agencies increase their compliance with the FISMA mandated processes.<sup id='fnref:45'><a href='#fn:45' rel='footnote'>45</a></sup> The current FISMA reports say absolutely nothing about government security but rather is merely a measure of compliance with report generation.<sup id='fnref:46'><a href='#fn:46' rel='footnote'>46</a></sup> FISMA erroneously assumes an agency&#8217;s compliance with largely reactionary standards is an objective measure of information security. Instead, such an assumption incentivizes agencies to expend efforts on reporting, rather than securing the underlying security threats the reports represent. <sup id='fnref:47'><a href='#fn:47' rel='footnote'>47</a></sup> By focusing on security audits, rather than the actual security of the systems, FISMA provides a framework for Federal Chief Information Officers (CIOs) to quantify their progress in ways a large, non-technical bureaucracy can easily digest. Rather than drill down on the number or nature of attacks deflected, CIOs could simply report that they have achieved a specified level of FISMA compliance, and thus could justify their various budgets.<sup id='fnref:48'><a href='#fn:48' rel='footnote'>48</a></sup> Put another way, FISMA provides little incentive to address any security metric outside of those explicitly required of agencies by FISMA.<sup id='fnref:49'><a href='#fn:49' rel='footnote'>49</a></sup></p>\n\n<p>This focus on reporting requirements and audits, rather than actual information security may explain why cyber attacks increased some 250% between 2007 and 2009.<sup id='fnref:50'><a href='#fn:50' rel='footnote'>50</a></sup> The Community Emergency Response Team (CERT) estimates that 95% of intrusions exploited known software vulnerabilities to which counter measures were readily available.<sup id='fnref:51'><a href='#fn:51' rel='footnote'>51</a></sup> [G]iven the fluid nature of the technology industry, and the reliance on cash flow to support operations, software manufacturers face increased pressure to rush their products to market in order to better capitalize on the product&#8217;s innovation.<sup id='fnref:52'><a href='#fn:52' rel='footnote'>52</a></sup> This creates a race to the bottom in terms of software quality. Given strict budgets and timelines, agencies our forced to either cut desired functionality or skirt security requirements.</p>\n\n<p>Such a focus on reporting and managerial controls rather than on actual information security manifests itself on a near daily basis. Despite our nations best efforts at complying with codified security policy, thousands of computers on our military networks were infected by malware,<sup id='fnref:53'><a href='#fn:53' rel='footnote'>53</a></sup> unauthorized users in Iran were able to gain access to blueprints and other information about a helicopter in the Presidents fleet,<sup id='fnref:54'><a href='#fn:54' rel='footnote'>54</a></sup> and the State and Defense departments have lost more than six terabytes of information due to digital espionage, an amount equal to one-sixth of the information contained within the Library of Congress.<sup id='fnref:55'><a href='#fn:55' rel='footnote'>55</a></sup> As recently as last year, even, a single Army private was able to steal more than a quarter of a million classified State Department cables and nearly 100,000 intelligence reports.<sup id='fnref:56'><a href='#fn:56' rel='footnote'>56</a></sup> This deficiency however, is not limited to threats to national security. It is also personal. The Department of Defense was hit with a $4.9 billion class action suit as a result of the theft of the personal information of some 4.9 million uniform service members and their families,<sup id='fnref:57'><a href='#fn:57' rel='footnote'>57</a></sup> the Department of Veterans Affairs lost health records and other sensitive personal information for approximately 26.5 million veterans and their spouses, <sup id='fnref:58'><a href='#fn:58' rel='footnote'>58</a></sup> the Secretary of Defenses unclassified e-mail was hacked,<sup id='fnref:59'><a href='#fn:59' rel='footnote'>59</a></sup> and the Navy CIO had his personal information compromised not once or twice, but on six distinct occasions.<sup id='fnref:60'><a href='#fn:60' rel='footnote'>60</a></sup></p>\n\n<h2 id='iii_problems_with_existing_information_security_policy'>III. Problems with Existing Information Security Policy</h2>\n\n<p>Existing security policies fail to properly protect federal information systems. Empirically, agencies are unable to implement the security controls as defined by FISMA. This may be due, at least in part, to the ambiguity that the anachronistic policy is shackled with when faced with modern advances in technology. &#160;Even when requirements are clear, in the face of competing priorities, such obligations are often met with indifference by the agency, and unless a major attack brings cyber security to the forefront, such ambivalence is likely to remain within the public as well. Finally, Congress&#8217;s overall lack of attention renders accountability a challenge and as a result, compliance suffers further. As a result, the existing security regime may fall short of its promises.</p>\n\n<h3 id='a_difficulty_implementing'>A. Difficulty Implementing</h3>\n\n<p>Empirically, agencies struggle to meet the requirements asked of them by existing security policy. To date, none of the 24 major agencies<sup id='fnref:61'><a href='#fn:61' rel='footnote'>61</a></sup> have fully implemented the agency-wide information security programs required by FISMA.<sup id='fnref:62'><a href='#fn:62' rel='footnote'>62</a></sup> Seven of such agencies described their security as poor, nine as satisfactory, and only six as good.<sup id='fnref:63'><a href='#fn:63' rel='footnote'>63</a></sup> It should come as no surprise then, that the House Government Reform Committee rated government-wide FISMA compliance D+.<sup id='fnref:64'><a href='#fn:64' rel='footnote'>64</a></sup> In 2004, two years after the act was penned, 23% of federal IT systems lacked the risk assessment required, and one in four lacked the contingency plans necessary to ensure continuity of operations. Of those with plans, a mere 57% had ever been tested. Nine of the 24 agencies did not even have a complete inventory of their IT systems.<sup id='fnref:65'><a href='#fn:65' rel='footnote'>65</a></sup> Today, nearly a decade after FISMA was enacted, the numbers name similarly bleak. As the federal IT footprint continues to swell and budgets continue to tighten, in FY2011, only 33% of agencies reported compliance with FISMAs risk management requirements, and that same one in three ratio had programs compliant with the contingency planning requirements. Only one in four were complaint with configuration management, POA&#38;M, and identify and access management requirements. Thirteen percent had not even begun to implement continuous monitoring programs, and one in five still lacked an accurate IT inventory.<sup id='fnref:66'><a href='#fn:66' rel='footnote'>66</a></sup></p>\n\n<p>One example of agencies difficulty complying can be seen in the Department of Veterans Affairs (VA). In 2007, a hard drive containing nearly 200,000 veterans records went missing from a safe. The Office of the Inspector General concluded that VAs security plan did not comply with its own rules for securing data, and that the it improperly allowed an IT Specialist trusted with the data access to information beyond his clearance.<sup id='fnref:67'><a href='#fn:67' rel='footnote'>67</a></sup> After public disclosure, a lawsuit arose, and when the opinion was issued nearly two years later, the court noted that it had no reason to think that all of the alleged violations have been remedied. Robert T. Howard, Assistant Secretary for Information and Technology, stated before a Senate inquiry that the hard drive theft was a wake up call and that [a]s a result of that incident we began to create the environment needed to better protect the sensitive information entrusted to us.<sup id='fnref:68'><a href='#fn:68' rel='footnote'>68</a></sup> Despite the lesson learned, four years after the incident, the VA reported that only 55% of its portable devices had FISMA-mandated encryption.<sup id='fnref:69'><a href='#fn:69' rel='footnote'>69</a></sup> A related case involving the Bureau of Indian Affairs (BIA) resulted in an injunction requiring that various IT systems be disconnected from the Internet due to inadequate information security. The court noted that the agency&#8217;s FISMA compliance had lagged behind the expansion of the department&#8217;s Internet presence.<sup id='fnref:70'><a href='#fn:70' rel='footnote'>70</a></sup> Although anecdotal, both incidents confirm one thing: on the whole federal agencies are unable to adequately implement the requirements imposed on them by FISMA.</p>\n\n<h3 id='b_ambiguity'>B. Ambiguity</h3>\n\n<p>Even when agencies strive to comply with their information security obligations, FISMAs requirements are often drafted so ambiguously as to render knowing what constitutes those obligations impossible.<sup id='fnref:71'><a href='#fn:71' rel='footnote'>71</a></sup> In certain situations, for example, agencies are required to ensure the security of federal data maintained on third-party systems. Yet the scope of this obligation, defined as when such systems are operated on behalf of an agency<sup id='fnref:72'><a href='#fn:72' rel='footnote'>72</a></sup> are often ambiguous, and the acts legislative history, sheds no additional light on the phrase. The congressional report accompanying FISMA is written largely in broad terms, with platitudes about the importance of information security. The legislative history in fact shows virtually no congressional focus on the nitty-gritty of how the statute is to be implemented.<sup id='fnref:73'><a href='#fn:73' rel='footnote'>73</a></sup> Additionally, FISMA proves no mechanism for agencies to clarify such ambiguities. This can result in months (or longer) of inaction as bureaucrats and lawyers struggle to interpret a technical statutory scheme with which they may have little familiarity.<sup id='fnref:74'><a href='#fn:74' rel='footnote'>74</a></sup> Perhaps among the most telling signs of FISMAs troubling ambiguity is the birth of a Beltway industry specializing in FISMA compliance. As one security-consulting firm asserted, Information Security and Privacy regulations are purposely vague to ensure they cover a wide range of organizations over a long period of time without having to be amended by Congress.<sup id='fnref:75'><a href='#fn:75' rel='footnote'>75</a></sup> FISMA as currently drafted does not provide adequate guidance for agencies to properly implement its requirements.</p>\n\n<h3 id='c_a_culture_of_indifference'>C. A Culture of Indifference</h3>\n\n<p>Compounding the difficulties surrounding implementation is a cloud of indifference. Most agency employees likely view FISMAs requirements as unsexy. Workers are more motivated and more productive, and thus more effective when they feel as if the task at hand is worthwhile.<sup id='fnref:76'><a href='#fn:76' rel='footnote'>76</a></sup> Yet an agencys information security activities have no direct connection to its substantive policy goals. It is not a stretch to think agency employees may lack the sense that operationalizing the requirements of FISMA is important or particularly urgent. Where bureaucrats are unmotivated, inertia can easily overpower the impetus to make costly changes as agency employees seek to minimize the amount of FISMA work they must do.<sup id='fnref:77'><a href='#fn:77' rel='footnote'>77</a></sup> Put another way, without clear alignment with policy goals, implementation of FISMA may be destined to remain good enough for government work.</p>\n\n<p>The court in the BIA case noted earlier<sup id='fnref:78'><a href='#fn:78' rel='footnote'>78</a></sup> described a bureaucratic culture marked by indifference, confusion, and lack of accountability. In one passage, the court discussed a stunning lack of management and oversight in the context of the departmental IT security program. While technicians were aware of the security vulnerabilities, they made no effort to fix it. The court continued, Interior&#8217;s IT security planners have discussed [the necessary fix] only in concept [One DOI senior official testified that he was] not aware that we&#8217;ve actually put it down into a formalized, written plan.<sup id='fnref:79'><a href='#fn:79' rel='footnote'>79</a></sup> Such indifference not only threatens FISMA implementation, but also can render our nations information systems less secure.</p>\n\n<h3 id='d_a_disinterested_public'>D. A Disinterested Public</h3>\n\n<p>This indifference towards FISMA however, does not remain solely within agency walls. While an enormous security breach could trigger widespread public outrage &#8212; for example if individuals tax filings were compromised &#8212; it is likely the issue would come to the forefront of taxpayers minds. Absent such a breach however, public interest is likely to remain low.<sup id='fnref:80'><a href='#fn:80' rel='footnote'>80</a></sup> This lack of public interest can create a complacency culture within Congress as well. It is difficult to imagine that members of congress receive many constituent inquiries into the pace of FISMA adoption, or believe that their ability to seek reelection is tied closely with the day-to-day success of agency CIOs. While citizens may cast ballots in favor of any issue they choose, FISMA is unlikely to come out of the periphery and receive enough public attention to strongly influence congressional elections, and thus one can assume that congressional oversight of information security is low on both Congress and the publics list of priorities.<sup id='fnref:81'><a href='#fn:81' rel='footnote'>81</a></sup></p>\n\n<h3 id='e_lack_of_accountability'>E. Lack of Accountability</h3>\n\n<p>Between employee indifference, public apathy, and general congressional inattentiveness, agencies compliance with FISMA mandated requirements (or lack thereof) receives far less scrutiny than work considered core to the agency&#8217;s mission. As such, deficiencies may go underappreciated or wholly unnoticed.<sup id='fnref:82'><a href='#fn:82' rel='footnote'>82</a></sup> Even when the OMB reporting process uncovers such failures, it is unlikely that consequences would result. [T]he nature of the stick is so draconian and counterproductive to agency effectiveness that it is hard to imagine OMB ever fully imposing it. Federal IT has led to vast improvements in the way government agencies deliver citizen services and perform day-to-day operations, and to punish an agency by retarding its ability to take advantage of such advancements seems unlikely. Further, given the sheer number of delinquent agencies, bureaucrats may be able to take solace in a safety in number mentality. While it may be unlikely that OMB would withhold funding from one or two deviant bureaus, the possibility of OMB mass sanctions would be both politically inconceivable and functionally disastrous, effectively neutralizing any threat implicit within OMBs oversight role.<sup id='fnref:83'><a href='#fn:83' rel='footnote'>83</a></sup></p>\n\n<h2 id='iv_the_toll_on_taxpayers'>IV. The Toll on Taxpayers</h2>\n\n<p>Such a heavyweight information security policy affects taxpayers in two ways. First, it imparts a direct administrative cost as agencies divert man-hours from supporting agency mission to supporting the significant administrative burden. Second, it imparts an indirect cost, as agencies struggle to operationalize new technologies and approaches to delivering citizen services and transacting the business of the nation.</p>\n\n<h3 id='a_administrative_costs'>A. Administrative Costs</h3>\n\n<p>As noted earlier, FISMA and its associated implementation guidance impose a significant administrative burden on agencies. For example, assume for a moment a federal agency would like to establish a simple blog for a newly announced short-term initiative. The blog would have the ability for agency staff members to post updates on the initiative on a regular basis, would provide members of the public with the opportunity to post comments, a fairly standard practice among similar websites. In the private sector, even a non-technical content creator or subject-matter expert could simply navigate to one of the many companies that provide blog hosting as a service, enter a purchase card number, and have an entire website standing in a matter of minutes. In the public sector however, such is not the case.</p>\n\n<p>The program office initiating the request would have to contact the chief security officer to begin the FIPS-199 mandated process of determining the FISMA risk level, which in this hypothetical, after some work, we can assume will be low given the non-essential nature of the website. Next, the software and the facilities that host it will be required to undergo a C&#38;A process, even if another agencies has already done the same. This process may require a significant investment of time, if for example, the hosting company has not previously undergone an evasive third-party security audit, and may even require the agency to host the software within its own datacenter (thus adding to the overall cost), if the hosting company, presumably a small technology startup, is unwilling to do so. Once a primary datacenter and application is certified, COOP may also require a fallback, parallel website be concurrently established on a separate system (potentially doubling the cost imposed).</p>\n\n<p>Once technical requirements are met, significant legal requirements must be met as well. If, as in this hypothetical, the agency wishes to allow citizens who provide their name the opportunity to respond to each post (much like Facebook or most blogs on the Internet today), the agency will most likely be required to conduct a PIA, including the 30 and 60 day comment periods, receive OMB approval for the information collection under the PRA, and publish a SORN if comments are to be retrieved by the commenters name as is generally the case with blogs.</p>\n\n<p>Finally, the agency must establish a formal security plan and administrative controls. The security plan would outline rules of behavior, training, personnel controls, incident response, continuity of support, technical security, and if externally hosted as in the above example, an interconnection agreement with the third party hosting company. Last, the agency would have to design and fully implement SP 800 controls including management controls &#8212; security assessment and authorization, risk assessment, system and services acquisition, and program management; operational controls &#8212; personnel security, physical and environmental security, contingency planning, configuration management, maintenance, systems and information integrity, media protection, incident response, and awareness and training; and technical controls &#8212; identification and authorization, access control, audit and accountability, and system and communications protection.</p>\n\n<p>To fully comply with both the letter and spirit of current security requirements imposes a significant administrative cost on agencies. While such a heavy-handed procedure is proportional for our nations mission critical systems, a tension arises when that same procedure is applied to todays widely consumerized technologies.</p>\n\n<h3 id='b_opportunity_costs'>B. Opportunity Costs</h3>\n\n<p>Beyond the direct, administrative costs imposed by the governments existing security policy, there is also a hidden opportunity cost. Imagine, as in the above example, an agency looking to engage the public around a short, three-month policy initiative. Because the administrative overhead required by existing security policy may impose a three- to six-month lead-time on the agency before it could publish its first word, it is likely to forego the undertaking entirely. Such lost opportunities, however, on not simply limited to blogs. As the industry increasingly moves to a hosted service provider model (infrastructure as a service, platform as a service, and software as a service), such conflicts are going to become increasingly common, be they innovative new social networks, such as the code sharing service GitHub, or cloud-based business tools such as collaboration suite Basecamp or customer relationship manager Sales Force.</p>\n\n<p>Part of the private sectors success and recent explosion of web-based startups can be attributed, at least in part, to cloud computing&#8217;s ease of deployment and an emerging system oriented architecture. A single web developer can programmatically create and destroy servers on demand to meet scalability requirements, or simply to rapidly prototype a new application. At the same time, service providers are increasingly exposing their underlying data as application programming interfaces (APIs), allowing developers to loosely connect systems to rapidly bring products to market. Government developers however, are, without extensive administrative costs, precluded from fully taking advantage of these advances, and thus, the means by which citizens services are transacted, are often generations behind their private sector counterparts.</p>\n\n<h2 id='v_streamlining_our_nations_information_security'>V. Streamlining our Nations Information Security</h2>\n\n<p>The nations security policy is not inherently flawed, and for many, mission-critical IT systems, taxpayers should demand no less. For many, smaller, citizen-facing systems, however, a streamlined authorization process, could more rapidly deliver smarter, better tools with which government agency&#8217;s can transact the nations business, and do so in a secure and efficient manner.</p>\n\n<h3 id='a_carrots_not_sticks'>A. Carrots, not Sticks</h3>\n\n<p>OMB should seek to enforce FISMA compliance through incentives, rather than punishments. Agencies with exemplary security records should qualify for additional funding, resource, and personnel to induce others to follow their lead.<sup id='fnref:84'><a href='#fn:84' rel='footnote'>84</a></sup> Bureaucrats, by their nature, are hungry for additional funding. A concept analogously well established in the private sector, the prospect of greater resources at an agency CIOs disposal is a far greater motivator than simply seeking to avoid reprimand from OMB.<sup id='fnref:85'><a href='#fn:85' rel='footnote'>85</a></sup> Such incentives would not only encourage compliance with existing requirements, but would encourage CIOs to think critically about their security posture in hopes of a resource award, thus ameliorating the threat of mere box checking.</p>\n\n<h3 id='b_reduce_duplication_of_efforts'>B. Reduce Duplication of Efforts</h3>\n\n<p>Certifications and other collateral should be fully transferable between agencies. This would have two implications. First, when multiple agencies utilized a single information resource, OMB could determine which agency would bear the responsibility for ensuring FISMA compliance, saving the other agency (and taxpayers) significant time and effort.<sup id='fnref:86'><a href='#fn:86' rel='footnote'>86</a></sup> &#160;Second, an application certified by one agency, should be fully transferable to another agency. In the blog example used earlier, if one agency had gone through the certification process for the service provider, another agency would be able to piggyback on their efforts. Such an arrangement may require OMB to curate a collaborative commons of shared certifications and records made available to agencies.</p>\n\n<h3 id='b_modular_administration'>B. Modular Administration</h3>\n\n<p>OMB should create guidance to decouple the various components that make up an information system from the administrative assets that must accompany them. An agency website, for example, might consist of the cloud service provider, the generic software image from which the server is based, and the content management system which generates the output visitors see (collectively, often referred to as the technology stack). As many of these components are often reused between information systems (e.g., another website may share the same server image, or database or other application may share the same datacenter), if agencies could analyze each component independently, in a modular fashion, it could realize a significant savings in the long run, especially if such certifications could be shared among agencies.</p>\n\n<h3 id='c_a_grace_period_for_pilot_programs'>C. A Grace Period for Pilot Programs</h3>\n\n<p>Last, and most importantly, congress should carve a pilot program exception within existing IT security requirements. Given the pace at which consumer technology advances, if agencies wish to adopt new, innovative services to improve non-mission critical lines of business, it should be permitted do so with limited administrative overhead. Even with a rigid adherence to industry best practices, given such a grace period, agencies could rapidly prototype and onboard new applications and services to better the delivery of citizen services, and if successful, can insure FISMA compliance in tandem with the ongoing pilot.</p>\n\n<h2 id='conclusion'>Conclusion</h2>\n\n<p>Congress has imposed on federal executive agencies an onerous system to ensure information security benchmarks are met. Despite OMBs best efforts, however, compliance is low, and successful attacks continue. Agencies are finding it difficult to complete the myriad requirements that become increasingly ambiguous in sight of an ever-changing technology landscape. This may be due, at least in part, to an indifference endemic of both agency implementers and the public. Such requirements, however, do not come without a cost. FISMA creates significant administrative overhead for agencies looking to innovate, and in many cases, may do so to such an extent so as to retard or otherwise prevent adoption. As a result, some argue, that by inhibiting such innovation, todays federal security policies simply secure nothing more than the status quo. As communications technology becomes increasingly consumerized, the opportunity for federal agencies to do more with less, and to streamline the delivery of, or expand into new citizen services has never been more apparent. Yet at the same time, public sector adoption is increasingly falling behind private sector counterparts. Instead, OMB should seek to incentivize those agencies that best secure federal information assets and seek out innovative, secure solutions to transacting the nations business. Existing requirements can be streamlined, such as breaking security analyses into the disparate technology components they represent, and allowing such modules of certification to be shared among systems and agencies. Finally, a formal grace period, for low risk, high impact, citizen-facing systems can usher in a new era of transparency and collaborative democracy yet unimagined. Our nations information is one of its chief resources, and great care should be taken to secure it, just as we secure our territories and tangible interests. Such security, however, and the overhead required to implement it, should be proportionate to the risk involved, and should secure the information systems of tomorrow, not simple the status quo.</p>\n<div class='footnotes'><hr /><ol><li id='fn:1'>\n<p>Ctr. for Strategic &#38; Int&#8217;l Studies, Securing Cyberspace for the 44th Presidency 56 (2008), available at http://bit.ly/UvUVew</p>\n<a href='#fnref:1' rev='footnote'>&#8617;</a></li><li id='fn:2'>\n<p>Chief Financial Officers Act of 1990, Pub.L. 101&#8211;576, Nov. 15, 1990, 104 Stat. 2838.</p>\n<a href='#fnref:2' rev='footnote'>&#8617;</a></li><li id='fn:3'>\n<p>Office of Management and Budget Fiscal Year 2011 Report to Congress on the Implementation of the Federal Information Security Act of 2002, March 7, 2012, available at http://1.usa.gov/yiyFBb.</p>\n<a href='#fnref:3' rev='footnote'>&#8617;</a></li><li id='fn:4'>\n<p>White House Office of the Press Secretary, Remarks by the President on Securing Our Nation&#8217;s Cyber Infrastructure (May 29, 2009), http://1.usa.gov/gvW7VM.</p>\n<a href='#fnref:4' rev='footnote'>&#8617;</a></li><li id='fn:5'>\n<p>Cybersecurity: Next Steps To Protect Our Critical Infrastructure: Hearing Before the S. Comm. on Commerce, Science &#38; Transportation, 111th Cong. (Feb. 23, 2010) (statement of Sen. Rockefeller) (A major cyberattack could shut down our nation&#8217;s most critical infrastructure&#8230;.), http://1.usa.gov/TLlgEh; Senate Comm. on Commerce, Science &#38; Transportation, Press Release, Rockefeller and Snowe Gain Momentum for Landmark Cybersecurity Act (Mar. 24, 2010) (statement of Sen. Snowe) (cyber intrusions and attacks represent both a potential national security and economic catastrophe), http://1.usa.gov/VXWVx0.</p>\n<a href='#fnref:5' rev='footnote'>&#8617;</a></li><li id='fn:6'>\n<p>Marshall, Panetta Discusses Security Challenges in Stratcom Visit, American Forces Press Service, Aug. 5, 2011, http://1.usa.gov/pF6Fqx.</p>\n<a href='#fnref:6' rev='footnote'>&#8617;</a></li><li id='fn:7'>\n<p>Rethinking Fisma and Federal Information Security Policy, 81 N.Y.U. L. Rev. 1844, 1846 (2006), citing Catriona Davies, US Army Computers Shut Down by Hacker, Daily Telegraph (London), July 28, 2005, at 11 (internal quotation marks omitted).</p>\n<a href='#fnref:7' rev='footnote'>&#8617;</a></li><li id='fn:8'>\n<p>Ukman, Jason, 24,000 Pentagon files stolen in major cyber breach, officials say, Washington Post, July 14, 2011, available at http://wapo.st/o5wKnu.</p>\n<a href='#fnref:8' rev='footnote'>&#8617;</a></li><li id='fn:9'>\n<p>Keneally, Meghan, Chinese government hacks into White House office in charge of the nuclear launch codes, Daily Maily, October 1st, 2012, available at http://bit.ly/SSZJgH.</p>\n<a href='#fnref:9' rev='footnote'>&#8617;</a></li><li id='fn:10'>\n<p>44 U.S.C.A. 3541(1).</p>\n<a href='#fnref:10' rev='footnote'>&#8617;</a></li><li id='fn:11'>\n<p>Robert Silvers, Rethinking Fisma and Federal Information Security Policy, 81 N.Y.U. L. Rev. 1844, 1847-48 (2006), citing <a>H.R. Rep. No. 107-787, pt.1, at 54 (2002)</a>, as reprinted in 2002 U.S.C.C.A.N. 1880, 1889 (noting that FISMA consolidates the Government Information Security Reform Act, Pub. L. No. 106-398, sec. 1061-65, 3531-36, 114 Stat. 1654A, 266-75 (2000), the Information Technology Management Reform (Clinger-Cohen) Act of 1996, Pub. L. No. 104-106, 5001-02, 110 Stat. 679, 679-80, the Computer Security Act,Pub. L. No. 100-235, 101 Stat. 1724 (1988), and the Paperwork Reduction Act of 1980, Pub. L. No. 96-511, 94 Stat. 2812).</p>\n<a href='#fnref:11' rev='footnote'>&#8617;</a></li><li id='fn:12'>\n<p>44 U.S.C.A 3542(b)(1); see also FAR 2.101(b); 70 Fed. Reg. 57449, 57451 (Sept. 30, 2005).</p>\n<a href='#fnref:12' rev='footnote'>&#8617;</a></li><li id='fn:13'>\n<p>44 U.S.C. 3543(a).</p>\n<a href='#fnref:13' rev='footnote'>&#8617;</a></li><li id='fn:14'>\n<p>Id. 3543(a)(5).</p>\n<a href='#fnref:14' rev='footnote'>&#8617;</a></li><li id='fn:15'>\n<p>44 U.S.C.A. 3543(a).</p>\n<a href='#fnref:15' rev='footnote'>&#8617;</a></li><li id='fn:16'>\n<p>Federal Information Processing Standards Publication 199, Standards for Security Categorization of Federal Information Systems 1, 2 (Feb. 2004), available at http://1.usa.gov/4nzS8. FAR 11.102 and 11.201 include references to the FIPS PUB standards.</p>\n<a href='#fnref:16' rev='footnote'>&#8617;</a></li><li id='fn:17'>\n<p>Daniel M. White, The Federal Information Security Management Act of 2002: A Potemkin Village, 79 Fordham L. Rev. 369, 380-81 (2010)</p>\n<a href='#fnref:17' rev='footnote'>&#8617;</a></li><li id='fn:18'>\n<p>Id., citing Arthur Conklin, Why FISMA Falls Short: The Need for Security Metrics, 41 Wireless Internet S. Provider Proc. 1, 1-8 (2008), http:// www.tech.uh.edu/cae-dc/documents/WISP%202007%C20FISMA%C20metrics%C20paper% 20final.pdf; see also Agencies in Peril (internal citations omitted).</p>\n<a href='#fnref:18' rev='footnote'>&#8617;</a></li><li id='fn:19'>\n<p>44 U.S.C.A. 3544(b)(8).</p>\n<a href='#fnref:19' rev='footnote'>&#8617;</a></li><li id='fn:20'>\n<p><em>See generally</em> 12-3 BRPAPERS 1, 12-3 Briefing Papers 1, 11-12.</p>\n<a href='#fnref:20' rev='footnote'>&#8617;</a></li><li id='fn:21'>\n<p>44 U.S.C.A. 3544(a)(2)(C); see also 44 U.S.C.A. 3544(b)(2)(B). NIST Special Publication 800-53A, Rev. 1, Guide for Assessing the Security Controls in Federal Information Systems and Organizations 3, 1.1 (June 2010) ([O]rganizations have the inherent flexibility to determine the level of effort needed for a particular assessment This determination is made on the basis of what will accomplish the assessment objectives in the most cost-effective manner and with sufficient confidence to support the subsequent determination of the resulting mission or business risk.), available at http://1.usa.gov/aDXfog.</p>\n<a href='#fnref:21' rev='footnote'>&#8617;</a></li><li id='fn:22'>\n<p>5 U.S.C.A 552a.</p>\n<a href='#fnref:22' rev='footnote'>&#8617;</a></li><li id='fn:23'>\n<p><em>Id</em>552a(b), (d), (f)<em>.</em></p>\n<a href='#fnref:23' rev='footnote'>&#8617;</a></li><li id='fn:24'>\n<p>44 U.S.C.A. 3601 <em>et seq</em>.</p>\n<a href='#fnref:24' rev='footnote'>&#8617;</a></li><li id='fn:25'>\n<p><em>Id.</em> <em>See generally,</em> Shahid Khan, <u>&quot;Apps.gov&quot;: Assessing Privacy in the Cloud Computing Era</u>, 11 N.C.J.L. &#38; Tech. On. 259, 272 (2010).</p>\n<a href='#fnref:25' rev='footnote'>&#8617;</a></li><li id='fn:26'>\n<p>44 U.S.C.A. 3601 at 208(b)(2)(b)(i), 116 Stat. 2922.</p>\n<a href='#fnref:26' rev='footnote'>&#8617;</a></li><li id='fn:27'>\n<p>44 U.S.C.A. 3501.</p>\n<a href='#fnref:27' rev='footnote'>&#8617;</a></li><li id='fn:28'>\n<p>44 U.S.C.A. 3502(14) (1994), amended by Paperwork Reduction Act of 1995, Pub. L. No. 104-13, 3502(8), 109 Stat. 163, 166.</p>\n<a href='#fnref:28' rev='footnote'>&#8617;</a></li><li id='fn:29'>\n<p><em>Id.</em>at 3502(6).</p>\n<a href='#fnref:29' rev='footnote'>&#8617;</a></li><li id='fn:30'>\n<p><em>See</em> Shahid Khan, <u>&quot;Apps.gov&quot;: Assessing Privacy in the Cloud Computing Era</u>, 11 N.C.J.L. &#38; Tech. On. 259, 273 (2010)</p>\n<a href='#fnref:30' rev='footnote'>&#8617;</a></li><li id='fn:31'>\n<p>Shahid Khan, <u>&quot;Apps.gov&quot;: Assessing Privacy in the Cloud Computing Era</u>, 11 N.C.J.L. &#38; Tech. On. 259, 273-74 (2010)</p>\n<a href='#fnref:31' rev='footnote'>&#8617;</a></li><li id='fn:32'>\n<p>5 U.S.C.A. 552a(e) (2000).</p>\n<a href='#fnref:32' rev='footnote'>&#8617;</a></li><li id='fn:33'>\n<p>About Privacy Act Issuances, Government Printing Office, available at http://1.usa.gov/QSzFBE.</p>\n<a href='#fnref:33' rev='footnote'>&#8617;</a></li><li id='fn:34'>\n<p>Julianne M. Sullivan, Will the Privacy Act of 1974 Still Hold Up in 2004? How Advancing Technology Has Created A Need for Change in the &#34;System of Records&#34; Analysis, 39 Cal. W. L. Rev. 395, 399 (2003) (adding The definition provided by the Privacy Act is not based on the ordinary, plain meaning of the words system of records, but is in fact a very specific type of system, with very particular rules. This distinction likely arose out of the need to create some kind of distinction between groups of records that should be accessible and those that should not.)</p>\n<a href='#fnref:34' rev='footnote'>&#8617;</a></li><li id='fn:35'>\n<p>5 U.S.C.A. 552(a)(5) (2000).</p>\n<a href='#fnref:35' rev='footnote'>&#8617;</a></li><li id='fn:36'>\n<p>Henke v. Dept of Commerce, 83 F.3d 1553, 1459-60 (D.C. Cir. 1996).</p>\n<a href='#fnref:36' rev='footnote'>&#8617;</a></li><li id='fn:37'>\n<p><em>See</em> Sullivan, citing Henke, 83 F.3d at 1461 (noting that when records are compiled for investigatory purposes, even a few retrievals might be sufficient to create a system of records).</p>\n<a href='#fnref:37' rev='footnote'>&#8617;</a></li><li id='fn:38'>\n<p>FAR 7.103(w). <em>See</em> generally Appendix III to OMB Circular No. A-130, Office of Management and Budget, available at http://1.usa.gov/RlibPS.</p>\n<a href='#fnref:38' rev='footnote'>&#8617;</a></li><li id='fn:39'>\n<p>FIPS PUB 199, Standards for Security Categorization of Federal Information and Information Systems 1, 2 (Feb. 2004), <a>http://1.usa.gov/4nzS8</a>; NIST Special Publication 800-53, Rev. 3, Recommended Security Controls for Federal Information Systems and Organizations 6, 2.1 (May 2010), http://1.usa.gov/9DDoih.</p>\n<a href='#fnref:39' rev='footnote'>&#8617;</a></li><li id='fn:40'>\n<p><em>See, e.g.,</em>OMB Memorandum 11-33, FY 2011 Reporting Instructions for the Federal Information Security Management Act and Agency Privacy Management (Sept. 14, 2011) (enclosing DHS Memorandum FISM 11-02 (Aug. 24, 2011)), http://1.usa.gov/oCB4it.</p>\n<a href='#fnref:40' rev='footnote'>&#8617;</a></li><li id='fn:41'>\n<p>More Security, Less Waste: What Makes Sense for Our Federal Cyber Defense: Hearing Before the Subcomm. on Federal Financial Management, Government Information, Federal Services &#38; International Security, 111th Cong. (Oct. 29, 2009) (statement of Sen. McCain), http://1.usa.gov/Ut4XuK.</p>\n<a href='#fnref:41' rev='footnote'>&#8617;</a></li><li id='fn:42'>\n<p>GovWin Says FISMA Fails to Improve Overal Security, March 16, 2006, http://bit.ly/UxOqHX.</p>\n<a href='#fnref:42' rev='footnote'>&#8617;</a></li><li id='fn:43'>\n<p>Daniel M. White, The Federal Information Security Management Act of 2002: A Potemkin Village, 79 Fordham L. Rev. 369, 372 (2010) (internal citations omitted).</p>\n<a href='#fnref:43' rev='footnote'>&#8617;</a></li><li id='fn:44'>\n<p>See Wm. Arthur Conklin, Why FISMA Falls Short: The Need for Security Metrics, 41 Wireless Internet S. Provider Proc. 1, 1-8 (2008), http://bit.ly/TMqEqM; <em>see also</em> Agencies in Peril: Are We Doing Enough to Protect Federal IT and Secure Sensitive Information?: Hearing Before the S. Subcomm. on Fed. Fin. Mgmt., Gov&#8217;t, Info., Fed. Servs., and Int&#8217;l Sec., 110th Cong. 1 (2008) at 2-6 (statement of Tim Bennett, President of Cyber Security Industry Alliance) (identifying general flaws in FISMA reporting); Angela Gunn, Fed Having Fits over FISMA and Cybersecurity, Betanews (Dec. 12, 2008), http://bit.ly/X16RFd. <em>See</em> <em>generally</em> Daniel M. White, The Federal Information Security Management Act of 2002: A Potemkin Village, 79 Fordham L. Rev. 369, 380 (2010).</p>\n<a href='#fnref:44' rev='footnote'>&#8617;</a></li><li id='fn:45'>\n<p><em>Id.</em></p>\n<a href='#fnref:45' rev='footnote'>&#8617;</a></li><li id='fn:46'>\n<p>Vijayan, Jaikumar, Critics question value of federal IT security report card, Computerworld, May 21st, 2008, available at http://bit.ly/QSHKX0 (noting some agencies that are making an effort to comply with the true intent of the 396-page FISMA requirements document are getting poor grades on the annual report card, while others that have treated the process as a mere paperwork exercise are getting good grades.) (Internal quotation marks omitted).</p>\n<a href='#fnref:46' rev='footnote'>&#8617;</a></li><li id='fn:47'>\n<p>White, 79 Fordham L. Rev 369, 382; <em>Id.</em>(commenting First, Congress creates waste by writing FISMA in a way that demands useless reporting, and then it highlights the useless scores in a way that in some cases provides incentives for federal agencies to deliver misleading results.).</p>\n<a href='#fnref:47' rev='footnote'>&#8617;</a></li><li id='fn:48'>\n<p>White, 79 Fordham L. Rev 369, 381-82.</p>\n<a href='#fnref:48' rev='footnote'>&#8617;</a></li><li id='fn:49'>\n<p><em>Id.</em> at 381.</p>\n<a href='#fnref:49' rev='footnote'>&#8617;</a></li><li id='fn:50'>\n<p>Gregg Carlstrom, Net Attacks Triple in 2 Years, Fed. Times (Aug. 3, 2009), http://bit.ly/RluFaf. (a conservative estimated since many agencies under report by as much as 50%, and since the statistic excludes the Department of Defense which receives millions of scans and probes each year.); <em>See also</em>Conklin, 41 Wireless Internet S. Provider Proc. 1 (The recent spate of highly publicized information security failures in Federal agencies highlight the limitations of the current FISMA based approach&#8230;. The fact that &#8230; some agencies have not had an information security failure[s may be due to] lack of knowledge.). <em>See generally id.</em>at 382.</p>\n<a href='#fnref:50' rev='footnote'>&#8617;</a></li><li id='fn:51'>\n<p>Kevin R. Pinkney, Putting Blame Where Blame Is Due: Software Manufacturer and Customer Liability for Security-Related Software Failure, 13 Alb. L.J. Sci. &#38; Tech. 43, 66 (2002).</p>\n<a href='#fnref:51' rev='footnote'>&#8617;</a></li><li id='fn:52'>\n<p>White, 79 Fordham L. Rev 369, 384.</p>\n<a href='#fnref:52' rev='footnote'>&#8617;</a></li><li id='fn:53'>\n<p>White House Office of the Press Secretary, Remarks by the President on Securing Our Nation&#8217;s Cyber Infrastructure (May 29, 2009), http://1.usa.gov/gvW7VM (In one of the most serious cyber incidents to date against our military networks, several thousand computers were infected [in 2008] by malicious software&#8211;malware.).</p>\n<a href='#fnref:53' rev='footnote'>&#8617;</a></li><li id='fn:54'>\n<p>Source in Iran Sees Plans for President&#8217;s Chopper, USA Today, Mar. 2, 2009 (The U.S. Navy is investigating how an unauthorized user in Iran gained online access to blueprints and other information about a helicopter in President Obama&#8217;s fleet.)</p>\n<a href='#fnref:54' rev='footnote'>&#8617;</a></li><li id='fn:55'>\n<p>Cybersecurity: Assessing the Nation&#8217;s Ability To Address the Growing Cyber Threat: Hearing Before the H. Comm. on Oversight &#38; Government Reform, 112th Cong. (July 7, 2011) (statement of Rep. Issa), http://1.usa.gov/T2MnvZ.</p>\n<a href='#fnref:55' rev='footnote'>&#8617;</a></li><li id='fn:56'>\n<p>Information Sharing in the Era of WikiLeaks: Balancing Security and Collaboration: Hearing Before the S. Comm. on Homeland Security &#38; Government Affairs, 112th Cong. (Mar. 10, 2011) (statement of Sen. Collins), http://1.usa.gov/TMnAuL.</p>\n<a href='#fnref:56' rev='footnote'>&#8617;</a></li><li id='fn:57'>\n<p>Kime, DOD Hit With Lawsuit Over Lost Tricare Data, ArmyTimes, Oct. 13, 2011, http://bit.ly/ro8C2E.</p>\n<a href='#fnref:57' rev='footnote'>&#8617;</a></li><li id='fn:58'>\n<p>S. Rep. No. 111-110, at 3 (Dec. 17, 2009).</p>\n<a href='#fnref:58' rev='footnote'>&#8617;</a></li><li id='fn:59'>\n<p>Cybersecurity: Assessing Our Vulnerabilities and Developing an Effective Response: Hearing Before the S. Comm. on Commerce, Science &#38; Transportation, 111th Cong. 8 (Mar. 19, 2009) (statement of Dr. James Lewis), http://1.usa.gov/QT2gXm.</p>\n<a href='#fnref:59' rev='footnote'>&#8617;</a></li><li id='fn:60'>\n<p>Chabrow, Navy CIO&#8217;s PII Exposed for Sixth Time, Gov&#8217;t Info. Sec. News, Jan. 4, 2010, http://bit.ly/QT2nlU.</p>\n<a href='#fnref:60' rev='footnote'>&#8617;</a></li><li id='fn:61'>\n<p>As outlined in the Chief Financial Officer Act.</p>\n<a href='#fnref:61' rev='footnote'>&#8617;</a></li><li id='fn:62'>\n<p>No Computer System Left Behind: A Review of the 2005 Federal Computer Security Scorecards Before the H. Comm. on Government Reform, 109th Cong. 32 (2006) (statement of Gregory C. Wilshusen, Director, Information Security Issues, United States Government Accountability Office).</p>\n<a href='#fnref:62' rev='footnote'>&#8617;</a></li><li id='fn:63'>\n<p>Robert Silvers, Rethinking Fisma and Federal Information Security Policy, 81 N.Y.U. L. Rev. 1844, 1850 (2006).</p>\n<a href='#fnref:63' rev='footnote'>&#8617;</a></li><li id='fn:64'>\n<p><em>Id.,</em> citing House Comm. on Gov&#8217;t Reform, 109th Cong., Computer Security Report Card 1 (2006).</p>\n<a href='#fnref:64' rev='footnote'>&#8617;</a></li><li id='fn:65'>\n<p>OMB 2004 FISMA Report. <em>See Generally</em> Silvers, 81 N.Y.U. L. Rev. <em>at</em> 1850.</p>\n<a href='#fnref:65' rev='footnote'>&#8617;</a></li><li id='fn:66'>\n<p>OMB 2011 FISMA Report, Table A, <em>available at</em> http://1.usa.gov/yiyFBb.</p>\n<a href='#fnref:66' rev='footnote'>&#8617;</a></li><li id='fn:67'>\n<p>Fanin v. U.S. Dep&#8217;t of Veterans Affairs, 572 F.3d 868, 870-71 (11th Cir. 2009).</p>\n<a href='#fnref:67' rev='footnote'>&#8617;</a></li><li id='fn:68'>\n<p>Agencies in Peril: Are We Doing Enough to Protect Federal IT and Secure Sensitive Information?: Hearing Before the S. Subcomm. on Fed. Fin. Mgmt., Gov&#8217;t, Info., Fed. Servs., and Int&#8217;l Sec., 110th Cong. 1 (2008).</p>\n<a href='#fnref:68' rev='footnote'>&#8617;</a></li><li id='fn:69'>\n<p>OMB 2011 FISMA Report, Figure 8.</p>\n<a href='#fnref:69' rev='footnote'>&#8617;</a></li><li id='fn:70'>\n<p>Cobell v. Norton, 394 F. Supp. 2d 164 (D.D.C. 2005). <em>See generally</em> Silvers, 81 N.Y.U. L. Rev. 1844, 1849-63; White, 79 Fordham L. Rev. 369, 378.</p>\n<a href='#fnref:70' rev='footnote'>&#8617;</a></li><li id='fn:71'>\n<p><em>See</em> Silvers, 81 N.Y.U. L. Rev. 1844, 1853.</p>\n<a href='#fnref:71' rev='footnote'>&#8617;</a></li><li id='fn:72'>\n<p>In addition, contractors and third-party service providers are implicated under 44 U.S.C.A. 3544(a)-(b) (including information systems provided or managed by contractor, or other source), and DHS Memorandum FISM 11-02 as enclosed in OMB Memorandum M-11-33, Reporting Instructions for the Federal Information Security Management Act and Agency Privacy Management (DHS identified&#8230; contractors most likely to be subject to FISMA requirements [including] Service providers&#8211;e.g&#8230; managed services, like subscriptions to software services.).</p>\n<a href='#fnref:72' rev='footnote'>&#8617;</a></li><li id='fn:73'>\n<p><em>Id.</em>, citing H.R. Rep. No. 107-787, pt.1, at 76-88 (2002).</p>\n<a href='#fnref:73' rev='footnote'>&#8617;</a></li><li id='fn:74'>\n<p><em>Id</em>. at 1853.</p>\n<a href='#fnref:74' rev='footnote'>&#8617;</a></li><li id='fn:75'>\n<p>NetIQ, NetIQ FISMA Compliance &#38; Risk Management Solutions 2 (2005), available at http://bit.ly/UyC9TJ. <em>See generally</em> White, 79 Fordham L. Rev. 369, 405.</p>\n<a href='#fnref:75' rev='footnote'>&#8617;</a></li><li id='fn:76'>\n<p>Silvers, 81 N.Y.U. L. Rev. 1844, 1859-60 (citing L.L. Cummings &#38; Donald P. Schwab, Performance in Organizations: Determinants and Appraisals 90-101 (1973)).</p>\n<a href='#fnref:76' rev='footnote'>&#8617;</a></li><li id='fn:77'>\n<p><em>Id.</em></p>\n<a href='#fnref:77' rev='footnote'>&#8617;</a></li><li id='fn:78'>\n<p><em>Supra</em> footnote 69 <em>et seq.</em></p>\n<a href='#fnref:78' rev='footnote'>&#8617;</a></li><li id='fn:79'>\n<p>Silvers, 81 N.Y.U. L. Rev. 1844, 1852 (2006) (citing 394 F. Supp. 2d at 261 (quoting trial testimony of W. Hord Tipton, Chief Information Officer, DOI)).</p>\n<a href='#fnref:79' rev='footnote'>&#8617;</a></li><li id='fn:80'>\n<p><em>Id.</em> at 1860-61.</p>\n<a href='#fnref:80' rev='footnote'>&#8617;</a></li><li id='fn:81'>\n<p><em>Id. See</em> Jack M. Beermann, Essay, Administrative Failure and Local Democracy: The Politics of DeShaney, 1990 Duke L.J. 1078, 1105 ([A]dministrative failures may be so low on the political agenda that they will not even be addressed in the electoral process.).</p>\n<a href='#fnref:81' rev='footnote'>&#8617;</a></li><li id='fn:82'>\n<p><em>Id.</em> at 1862, <em>See</em> Beermann, supra note 79, at 1106 ([U]nelected agents are shielded from direct political scrutiny. Thus, given the difficulty of effective oversight, agency actions may not be brought into line with legislatively stated goals.).</p>\n<a href='#fnref:82' rev='footnote'>&#8617;</a></li><li id='fn:83'>\n<p>Silver, 81 N.Y.U. L. Rev. at 1862.</p>\n<a href='#fnref:83' rev='footnote'>&#8617;</a></li><li id='fn:84'>\n<p><em>See generally</em>Silvers, 81 N.Y.U. L. Rev. 1844 at 1868.</p>\n<a href='#fnref:84' rev='footnote'>&#8617;</a></li><li id='fn:85'>\n<p><em>Id.</em> (citing Randal O&#8217;Toole, Reforming the Forest Service 104 (1988) (For top managers, larger budgets mean greater prestige. For middle managers, larger budgets mean more people on their staff, and this generally provides them with higher salaries. For lower managers, larger budgets mean greater opportunities for advancement.)).</p>\n<a href='#fnref:85' rev='footnote'>&#8617;</a></li><li id='fn:86'>\n<p><em>Id.</em> at 1871.</p>\n<a href='#fnref:86' rev='footnote'>&#8617;</a></li></ol></div>"}